{
    "intents": [
        {
            "tag": "responsibility_of_the_Information_Commissioner",
            "patterns": ["What is the responsibility of the Information Commissioner, Gujarat State, regarding the publication of press releases?",
                         "What is the responsibility of the Information Commissioner?", 
                         "Explain the duty of the Information Commissioner, Gujarat State, in publishing press releases as per the provided instructions."],
            "responses": ["The Information Commissioner, Gujarat State, is required to publish press releases from time to time to give wide publicity to compliance with the provisions of the present Act. These press releases are to be sent to the editors and managers of all daily newspapers, regular, fortnightly, monthly magazines, etc., in the state.\n\nIn other words.\n\nThe Information Commissioner, Gujarat State, has the responsibility to ensure that press releases are accurate, timely, and transparent. The Commissioner must also ensure that press releases are written in a clear and concise style and that they are available to the public in a timely manner.\n\nThe Commissioner's responsibilities include:\n• Ensuring that press releases are accurate and factual.\n• Ensuring that press releases are timely and up-to-date.\n• Ensuring that press releases are transparent and do not contain any misleading or false information.\n• Ensuring that press releases are written in a clear and concise style.\n• Ensuring that press releases are available to the public in a timely manner.\n• Ensuring that press releases are in compliance with all relevant laws and regulations.\n\n To keep the public's confidence in the Information Commissioner's Office, it is imperative that the Commissioner make sure press releases are truthful, timely, and transparent.\n\nAbove details are Mentioned in The State Emblem of India (Prohibition of Improper use) Rules, 2005\n\n I hope this helps 🙂! & if you have any more dquestions, feel free to ask me.",
                          "The Information Commissioner of Gujarat State is obligated to periodically release press statements, aiming to widely disseminate information about compliance with the current Act. These releases should be distributed to the editors and managers of all daily newspapers, regular, fortnightly, monthly magazines, etc., within the state.\n\nIn simpler terms, the Information Commissioner of Gujarat State is responsible for ensuring that press releases are accurate, timely, and transparent. It is crucial that these releases are presented in a clear and concise manner and made available to the public promptly.\n\nThe Commissioner's duties encompass:\n•   Confirming the accuracy and factual nature of press releases.\n•   Ensuring the timeliness and currency of press releases.\n•     Guaranteeing transparency in press releases, devoid of any misleading or false information.\n•    Writing press releases in a clear and concise style.\n•     Making press releases accessible to the public in a timely manner.\n•   Ensuring compliance with all relevant laws and regulations in the preparation of press releases.\n\nTo maintain public trust in the Information Commissioner's Office, it is vital for the Commissioner to ensure that press releases are truthful, timely, and transparent.\n\nAbove details are Mentioned in The State Emblem of India (Prohibition of Improper use) Rules, 2005\n\nI hope this clarifies! If you have any further questions, feel free to ask. 🙂"]
        },
        {
            "tag": "use_of_national_emblem_of_india",
            "patterns": ["What instructions are given regarding the use of the National Emblem, specifically the motto 'Satyamev Jayate'?", 
                         "Explain the guidelines for using the National Emblem, including the motto 'Satyamev Jayate', as per the provided instructions.",
                        "Explain the guidelines for using the National Emblem."],
            "responses": ["The State Emblem of India, including the National Emblem 'Satyamev Jayate', shall be used by various government agencies in their writing material, publications, buildings, vehicles, and for various purposes. It is emphasized that the National Emblem 'Satyamev Jayate' shall be used only with the motto 'Satyamev Jayate'. The Information Commissioner is instructed to publish press releases periodically in local newspapers and publications of the district to ensure compliance with these guidelines.\n\nThe use of the National Emblem of India is governed by the State Emblem of India (Prohibition of Improper Use) Act, 2005 and the State Emblem of India (Regulation of Use) Rules, 2007. These rules prohibit the unauthorized use of the National Emblem and prescribe certain conditions for its authorized use.\n\nThe motto of the National Emblem, <b>'सत्यमेव जयते (Satyameva Jayate)'</b>, which means <b>'Truth alone triumphs'</b>, is also protected by law. The Prevention of Insults to National Honour Act, 1971 prohibits the intentional insult to the National Emblem or its motto.\n\nHere are some specific instructions regarding the use of the National Emblem and its motto:\n• The National Emblem may only be used for official or ceremonial purposes.\n• The National Emblem may not be used for any commercial purpose.\n• The National Emblem may not be used in any way that is likely to cause disrespect or offense.\n• The motto <b>'सत्यमेव जयते (Satyameva Jayate)'</b> may only be used in conjunction with the National Emblem.\n• The motto <b>'सत्यमेव जयते (Satyameva Jayate)'</b> may not be used in any way that is likely to cause disrespect or offense.\n\nAny person who knowingly contravenes these instructions may be liable to imprisonment for a term which may extend to two years, or with fine, or with both.\n\nAbove details are Mentioned in The State Emblem of India (Prohibition of Improper use) Rules, 2005\n\n I hope this helps! & if you have any more questions, feel free to let me know!"]
        },
        {
            "tag": "role_of_the_Survey_Departments",
            "patterns": ["What is the role of the Survey Departments of the Secretariat?",
                         "What is the responsibility of the Survey Departments of the Secretariat?"],
            "responses": ["The Survey Departments of the Secretariat are requested to bring this notification to the attention of the Heads of Survey Departments and Heads of Offices under their respective departments of Corporations / Panchas / Autonomous Boards / State Public Enterprises and all concerned. They are also instructed to insist on the strict implementation of the notification. Those involved in the registration process are particularly requested to bring these instructions to their attention.\n\nAbove details are Mentioned in The State Emblem of India (Prohibition of Improper use) Rules, 2005\n\nI hope this Helps."]
        },
        {
            "tag": "display_national_emblem",
            "patterns": ["What is the instruction given to Chief Secretaries/Administrators of all State Governments/Union Territories regarding the display of the national emblem of India?",
                         "What are the instruction about displaying the national emblem of India?",
                         "Explain the directive regarding the display of the national emblem of India."],
            "responses": ["Chief Secretaries/Administrators of all State Governments/Union Territories are instructed to ensure the display of the full national emblem of India.\n The national emblem should include the motto 'Satyamev Jayate,' written in Devanagari below the side image of the lion pillar capital. The national emblem is the official seal of the Government of India, derived from the lion head of Ashoka at Sarnath. It features three lions sitting on the top panel, Dharma Chakra in the middle, a bull and a running horse on either side of the Dharma Chakra, and Devanagari script below the side picture of the lion pillar head with the motto <b>'सत्यमेव जयते (Satyameva Jayate)'</b>.\n Various Government agencies are reminded to include the complete national emblem, as omitting the motto is considered incomplete.\n Attached are copies of the National Emblem of India (Prohibition of Improper Use) Act, 2005, and the National Emblem of India (Regulation of Use) Rules, 2007 for information and guidance.\n\nAbove details are Mentioned in The State Emblem of India (Prohibition of Improper use) Rules, 2005\n\n I trust you find this information valuable. Do you have any further questions? Feel free to ask!"]
        },
        {
            "tag": "state_emblem_prohibition_act",
            "patterns": ["What is the purpose of the State Emblem of India (Prohibition of Improper Use) Act, 2005?",
                         "What is purpose of state emblem of india ?",
                         "Explain all provisions of the state emblem of india.", 
                         "Explain the key provisions of the State Emblem of India (Prohibition of Improper Use) Act, 2005."],
            "responses": ["The State Emblem of India (Prohibition of Improper Use) Act, 2005 is enacted to prohibit and prevent the improper use of the State Emblem of India for commercial and commercial purposes. The key provisions of the act are:\n1.• Short Title: The abbreviation of this Act is the State Emblem of India (Prohibition of Improper Use) Act, 2005.\n  • Extension and Application: It extends to the whole of India and applies to citizens of India outside India.\n  • Coming into Force: The act shall come into force on a date specified by the Central Government through notification in the Official Gazette.\n\n2. Definitions: Competent authority is defined as the authority competent to register companies, firms, bodies, trade marks, or designs.\n 'Emblem' refers to the State Emblem of India.\n\n3. Prohibition of Improper Representation:\n- No person shall use the emblem or any likeness of it in any manner that implies a connection to the Government or the Central Government without prior permission.\n- This prohibition extends to the use on any official document of the State Government.\n- 'Person' in this context includes any former functionary of the Central Government or a State Government.\n\n4. Prohibition of the Use of Symbols for Faulty Accusations:\n- No person shall use the emblem for trade, business, or profession purposes, or in the name of any patent or trademark, except under prescribed cases and conditions.\n\n5. Prohibition of Improper Representation:\n- Any competent authority may register a trade vehicle or beacon bearing the emblem.\n- No patent shall be granted for any shape having a name in which the symbol occurs.\n- If any question arises before any authority regarding the void status of any Schedule specified in the relevant Schedule or related thereto, the competent authority shall refer the question to the Central Government.\n- The decision of the Central Government on such matters shall be final.\n\n6. Provisions for Central Government's Use:\n- The Central Government may use the emblem in its official currency and in the offices of the Central Government and State Governments, subject to prescribed terms and conditions.\n\n- The Central Government has the authority to:\n     (a) Use the emblem on stationery by legislative authorities, ministers, members of Parliament, members of the Legislative Assembly, and officials of the Central Government and State Governments.\n     (b) Specify the date on which the emblem is to be used.\n        (c) Not allow the use of the emblem by government officials, foreign dignitaries, and central government and state agencies.\n      (d) Introduce the audience principle for displaying the emblem on public buildings in India and on diplomatic and official accounts of India abroad.\n        (e) Specify surveys for purposes including use for works.\n     (f) Specify such devices and the manner of their use as the Central Government may exercise its powers.\n\n7. Punishments for Offenses under Section 7:\n   (1) Any person committing an offense under this section shall be punished with imprisonment for a term up to two years, or a fine up to five thousand rupees, or both.\n        -If convicted again for the same offense, the minimum punishment for subsequent offenses is not applicable, but the maximum imprisonment remains two years, with a fine of up to five thousand rupees.\n    (2) If any person contravenes the provisions of section 4, the punishment for such offense shall not be less than one month but may extend to one year and with a fine not exceeding five thousand rupees.\n\n8. Prosecution Sanction Requirement:\n    -No prosecution for any offense under this section shall take place without the previous sanction of any officer authorized by general or special order of the Central Government.\n\n9. Proof of Evidence:\n      - Evidence may be proved by any action under any other law or by giving any gift to any other person.\n\n10. It is also subject to the provisions of any rule enacted by any other law.\n\n11. Rule Making under the State Emblem of India (Prohibition of Improper Use) Act, 2005:\n\n (1) The Central Government may, by notification in the Official Gazette, make rules to carry out the purposes of this Act.\n\n  (2) In particular, and without prejudice to the generality of the foregoing powers, such rules may provide for all or any of the following matters:\n       (a) the matters and conditions regulating the use of the emblem under section 4;\n       (b) rules for regulating the use of the emblem on the official seal of the Government and specifying the terms and conditions relating thereto, under sub-section (1) of section 6;\n       (c) Use of symbols on writing materials subject to treatment (2) of section 6, divine of government currency bearing symbols and other matters;\n       (d) general authority for giving prior sanction for bringing prosecution under section 8 or by special order authorizing the officer;\n       (e) any other matter which is required to be, or may be, prescribed.\n\n   (3) Every rule made under this section shall, as soon as may be after it is made, be laid before each House of Parliament when it is in session for a total period of thirty days. This period may be completed in one session or in two or more consecutive sessions, if before the expiry of that session or the session immediately following the aforesaid aggregators, both Houses agree to make any change in that rule and thereafter it shall be so changed. It will be effective only in its original form, if before the said expiry both the Houses agree that that rule should not be made, then thereafter it will become ineffective. But such modification or annulment of the rule will not adversely affect the validity of anything previously done under it.\n\nAbove details are Mentioned in The State Emblem of India (Prohibition of Improper use) Rules, 2005\n\nI trust this information is beneficial. Is there anything additional you need assistance with?"]
        },
        {
            "tag": "central_government_provisions",
            "patterns": ["What provisions does the State Emblem of India (Prohibition of Improper Use) Act, 2005 have regarding the use of the emblem by the Central Government?",
                         "Explain the provisions allowing the Central Government to use the emblem."],
            "responses": ["Provisions for Central Government's Use:\n- The Central Government may use the emblem in its official currency and in the offices of the Central Government and State Governments, subject to prescribed terms and conditions.\n\n- The Central Government has the authority to:\n     (a) Use the emblem on stationery by legislative authorities, ministers, members of Parliament, members of the Legislative Assembly, and officials of the Central Government and State Governments.\n     (b) Specify the date on which the emblem is to be used.\n        (c) Not allow the use of the emblem by government officials, foreign dignitaries, and central government and state agencies.\n      (d) Introduce the audience principle for displaying the emblem on public buildings in India and on diplomatic and official accounts of India abroad.\n        (e) Specify surveys for purposes including use for works.\n     (f) Specify such devices and the manner of their use as the Central Government may exercise its powers.\n\nAbove details are Mentioned in The State Emblem of India (Prohibition of Improper use) Rules, 2005\n\nI hope this proves useful. Do you have any other inquiries or areas where I can offer assistance?"]
        },
        {
            "tag": "offense_punishment_State_Emblem",
            "patterns": ["What are the punishments for offenses under Section 7 of the State Emblem of India (Prohibition of Improper Use) Act, 2005?",
                         "Explain the penalties for committing an offense under Section 7 of the State Emblem of India (Prohibition of Improper Use) Act, 2005.",
                         "Tell me about the punishments specified in the State Emblem of India (Prohibition of Improper Use) Act, 2005."],
            "responses": ["Punishments for Offenses under Section 7:\n   (1) Any person committing an offense under this section shall be punished with imprisonment for a term up to two years, or a fine up to five thousand rupees, or both.\n        If convicted again for the same offense, the minimum punishment for subsequent offenses is not applicable, but the maximum imprisonment remains two years, with a fine of up to five thousand rupees.\n    (2) If any person contravenes the provisions of section 4, the punishment for such offense shall not be less than one month but may extend to one year and with a fine not exceeding five thousand rupees.\n\nAbove details are Mentioned in The State Emblem of India (Prohibition of Improper use) Rules, 2005\n\nI hope this helps."]
        },
        {
            "tag": "prosecution_sanction_State_Emblem_india",
            "patterns": ["Under what circumstances can a person be prosecuted for an offense under the State Emblem of India?",
                         "Explain the requirement of prosecution sanction in cases related to the State Emblem of India (Prohibition of Improper Use) Act, 2005.",
                         "Tell me about the conditions under which prosecution for an offense under the State Emblem of India (Prohibition of Improper Use) Act, 2005, can take place."],
            "responses": ["Prosecution Sanction Requirement:\n    No prosecution for any offense under this section shall take place without the previous sanction of any officer authorized by general or special order of the Central Government.\n\nAbove details are Mentioned in The State Emblem of India (Prohibition of Improper use) Rules, 2005\n\nI hope this helps."]
        },
        {
            "tag": "evidence_proof_under_National_Emblem",
            "patterns": ["How can evidence be proved in cases related to offenses under the State Emblem of India (Prohibition of Improper Use) Act, 2005?",
                         "Explain the methods of proving evidence in cases involving offenses under the State Emblem of India (Prohibition of Improper Use) Act, 2005.",
                         "Tell me about the ways in which evidence can be established in cases related to the State Emblem of India (Prohibition of Improper Use) Act, 2005."],
            "responses": ["Proof of Evidence:\n      - Evidence may be proved by any action under any other law or by giving any gift to any other person.\n\nIt is also subject to the provisions of any rule enacted by any other law.\n\nAbove details are Mentioned in The State Emblem of India (Prohibition of Improper use) Rules, 2005\n\nI hope this helps."]
        },
        {
            "tag": "rule_making_under_prohibition_of_improper_use",
            "patterns": ["How can rules be made under the State Emblem of India (Prohibition of Improper Use) Act, 2005?",
                         "Explain the process of making rules under the State Emblem of India (Prohibition of Improper Use) Act, 2005.",
                         "Tell me about the authority and process of rule-making under the State Emblem of India (Prohibition of Improper Use) Act, 2005."],
            "responses": [" Rule Making under the State Emblem of India (Prohibition of Improper Use) Act, 2005:\n\n (1) The Central Government may, by notification in the Official Gazette, make rules to carry out the purposes of this Act.\n\n  (2) In particular, and without prejudice to the generality of the foregoing powers, such rules may provide for all or any of the following matters:\n       (a) the matters and conditions regulating the use of the emblem under section 4;\n       (b) rules for regulating the use of the emblem on the official seal of the Government and specifying the terms and conditions relating thereto, under sub-section (1) of section 6;\n       (c) Use of symbols on writing materials subject to treatment (2) of section 6, divine of government currency bearing symbols and other matters;\n       (d) general authority for giving prior sanction for bringing prosecution under section 8 or by special order authorizing the officer;\n       (e) any other matter which is required to be, or may be, prescribed.\n\n   (3) Every rule made under this section shall, as soon as may be after it is made, be laid before each House of Parliament when it is in session for a total period of thirty days. This period may be completed in one session or in two or more consecutive sessions, if before the expiry of that session or the session immediately following the aforesaid aggregators, both Houses agree to make any change in that rule and thereafter it shall be so changed. It will be effective only in its original form, if before the said expiry both the Houses agree that that rule should not be made, then thereafter it will become ineffective. But such modification or annulment of the rule will not adversely affect the validity of anything previously done under it.\n\nAbove details are Mentioned in The State Emblem of India (Prohibition of Improper use) Rules, 2005\n\nI trust this information is beneficial. Is there anything additional you need assistance with?"]
        },
        {
            "tag": "state_emblem_of_india_description",
            "patterns": ["Describe the state emblem of India.",
                         "Provide information about the state emblem of India.",
                         "What is the design of the state emblem of India?",
                         "National emblem of India",
                         "State emblem of India",
                         "State emblem of Bharat",
                         "Tell me about the symbols on the state emblem of India.",
                         "Explain the significance of the state emblem of India."],
            "responses": ["The State Emblem of India is a rich and symbolic representation of the country's heritage and values. It is based on the Lion Capital of Ashoka, a sculpture that was originally erected at Sarnath in the 3rd century BCE. The Lion Capital is a representation of power, courage, confidence, and faith.\n\nState Emblem of India Description:\n\nThe state emblem of India has been adopted from the lion capital of Ashoka at Sarnath, displayed in the Sarnath Museum. The design includes:\n- At the top of the Lion Pillar, four lions are sitting with their backs on the circular top panel.\n- The central strip of the lower panel is adorned with relief sculptures of an elephant, a running horse, a bull, and a lion, separated by an intermediate Dharmachakra.\n- The top panel rests on an hourglass-shaped lotus.\nThe picture features three lions seated on the top panel, a Dharmachakra in the middle, a bull on its right, and a running cart on its left. The Dharmachakra is on its immediate right and left. The bell-shaped lotus is omitted.\n\nThe motto <b>'सत्यमेव जयते (Satyameva Jayate)'</b> is written in Devanagari script below the side image of the lion pillar cap and is an integral part of the state emblem of India.\nThe State Emblem of India(National emblem of the Republic of India)\n<img src='https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Emblem_of_India.svg/800px-Emblem_of_India.svg.png' alt='Emblem of India' width='150' height='200' class='responce-image'>\n\nThe four lions standing back-to-back symbolize the power, courage, confidence, and faith of the Indian people. The wheel (Dharma Chakra) below the lions represents righteousness, law, and order. The motto of the State Emblem, <b>'सत्यमेव जयते (Satyameva Jayate)' (Truth alone triumphs)</b>, is written in Devanagari script beneath the wheel.\n\nThe State Emblem is used on all official documents and buildings of the Government of India. It is also used on the Indian currency and on the passports of Indian citizens. The State Emblem is a reminder of the country's rich history and culture, and it serves as a symbol of unity and national pride.\n\nAbove details are Mentioned in The State Emblem of India (Prohibition of Improper use) Rules, 2005.\n\nI hope this helps. Is there anything else I can help you with?"]
        }
    ]
}
