{
  "intents": [
    {
      "tag": "Definition_of_Appointing_Authority",
      "patterns": [
        "What is definition of 'Appointing Authority' ?",
        "Define 'Appointing Authority'.",
        "What is 'Appointing Authority'?"
      ],
      "responses": [
        "In rules, 'Appointing Authority' refers to the authority empowered to make appointments to the service, grade, or post of a Government servant.<br>Appointing Authority as per the Gujarat Civil Services refers to the authority that is empowered to make appointments to civil service posts. The appointing authority is responsible for determining the qualifications and eligibility criteria for each post, and for selecting the most qualified candidates.<br>The Gujarat Civil Services (Classification and Recruitment) (General) Rules, 1967, specify the different levels of appointing authority for civil service posts. The highest level of appointing authority is the State Government, which can make appointments to all civil service posts, regardless of their level or rank."
      ]
    },
    {
      "tag": "Definition_of_Disciplinary_Authority",
      "patterns": [
        "Disciplinary Authority' ?",
        "Define 'Disciplinary Authority'.",
        "Define 'Disciplinary Authority' as per the Gujarat Civil Services."
      ],
      "responses": [
        "'Disciplinary Authority' is the authority competent under these rules to impose disciplinary penalties.<br>Disciplinary Authority in the context of the Gujarat Civil Services refers to the authority that is empowered to initiate and conduct disciplinary proceedings against a government servant for alleged misconduct. The disciplinary authority is also responsible for imposing penalties on government servants who are found guilty of misconduct.<br>The Gujarat Civil Services (Discipline and Appeal) Rules, 1971, specify the different levels of disciplinary authority for government servants. The highest level of disciplinary authority is the State Government, which can initiate disciplinary proceedings against any government servant, regardless of their level or rank.",
        "'Disciplinary Authority' refers to the competent authority authorized by these regulations to enforce disciplinary penalties.<br> In the context of the Gujarat Civil Services, Disciplinary Authority denotes the entity empowered to initiate and conduct disciplinary proceedings against a government servant accused of misconduct. This authority is also tasked with imposing penalties on government servants found culpable of misconduct.<br> The Gujarat Civil Services (Discipline and Appeal) Rules, 1971, outline the various levels of disciplinary authority applicable to government servants. The highest echelon of disciplinary authority is the State Government, which has the authority to initiate disciplinary proceedings against any government servant, irrespective of their level or rank."
      ]
    },
    {
      "tag": "Definition_of_Government_servant",
      "patterns": [
        "what is Government servant ?",
        "Who is Government servant ?",
        "Definition of Government servant"
      ],
      "responses": [
        "The term 'government servant', as defined in the Gujarat Civil Services (Discipline and Appeal) Rules, 1971, means any person who is employed in civil capacity under the Government of Gujarat, or under any body or authority controlled by the Government of Gujarat, and who is paid out of the revenues of the State of Gujarat.<br>The definition of 'government servant' is very broad and includes a wide range of employees, including:<br>->Civil servants, such as IAS, IPS, and IFS officers<br>->Employees of state-owned enterprises and government undertakings<br>->Employees of local governments, such as municipalities and district panchayats<br>->Teachers and other employees of government-aided educational institutions<br>->Employees of hospitals and other healthcare institutions run by the government<br>->Employees of research institutions and other organizations funded by the government<br>The Gujarat Civil Services (Discipline and Appeal) Rules, 1971, apply to all government servants, regardless of their level or rank. These rules provide for a comprehensive framework for disciplinary proceedings against government servants who are alleged to have committed misconduct.",
        "The term 'government servant,' as defined in the Gujarat Civil Services (Discipline and Appeal) Rules, 1971, refers to any individual employed in a civil capacity under the Government of Gujarat or any body or authority under the control of the Government of Gujarat. These individuals receive payment from the revenues of the State of Gujarat.<br>The definition of 'government servant' is extensive, encompassing various categories of employees, including:<br>->Civil servants like IAS, IPS, and IFS officers<br>->Employees of state-owned enterprises and government undertakings<br>->Employees of local governments, such as municipalities and district panchayats<br>->Teachers and other staff in government-aided educational institutions<br>->Employees in hospitals and other healthcare institutions operated by the government<br>->Employees in research institutions and other organizations funded by the government<br>The Gujarat Civil Services (Discipline and Appeal) Rules, 1971, are applicable to all government servants, regardless of their level or rank. These rules establish a comprehensive framework for disciplinary proceedings against government servants accused of misconduct."
      ]
    },
    {
      "tag": "ShortTitleCommencement",
      "patterns": [
        "When do the Gujarat Civil Services (Discipline and Appeal) Rules come into force?",
        "To whom do the Gujarat Civil Services (Discipline and Appeal) Rules, 1971 apply?",
        "Who is included in Gujarat Civil Services rules?"
      ],
      "responses": [
        "The Gujarat Civil Services (Discipline and Appeal) Rules, 1971, come into force from 15th August, 1971. They apply to all persons appointed to civil services and posts in connection with the affairs of the State of Gujarat, whose conditions of service are regulated under Article 309 of the Constitution, except for members of the All India Services, Inspectors of Police, and Members of the Subordinate ranks of the Police Force."
      ]
    },
    {
      "tag": "SpecialProvisionsRights",
      "patterns": [
        "What are the special provisions for a Government servant",
        "special provisions for a Government servant",
        "What special provisions can the appointing authority make for a Government servant under Gujarat Civil Services rules?"
      ],
      "responses": [
        "Under the rules, special provisions can be made for a Government servant in specific matters through agreement with the appointing authority. These rules do not deprive any Government servant of rights or privileges conferred by existing laws or agreements between the person and the Government at the time of the rules' commencement.",
        "The Appointing Authority under Gujarat Civil Services Rules has the power to make special provisions for a Government servant in the following cases:<br>Appointment on ad-hoc basis: The Appointing Authority can appoint a Government servant on an ad-hoc basis for a period of up to one year, if it is in the public interest to do so. The Appointing Authority must record the reasons for making such an appointment in writing.<br>Appointment on contract basis: The Appointing Authority can appoint a Government servant on a contract basis for a period of up to five years, if it is in the public interest to do so. The terms and conditions of the contract must be clearly specified in writing.<br>Appointment on deputation: The Appointing Authority can depute a Government servant to another department or organization for a period of up to five years, if it is in the public interest to do so. The Appointing Authority must obtain the consent of the Government servant before deputing them.<br>Appointment on re-employment basis: The Appointing Authority can re-employ a Government servant who has retired, for a period of up to five years, if it is in the public interest to do so. The terms and conditions of the re-employment must be clearly specified in writing.<br>Relaxation in qualifications and eligibility criteria: The Appointing Authority can relax the qualifications and eligibility criteria for a particular post, if it is in the public interest to do so. The Appointing Authority must record the reasons for such relaxation in writing.<br>In addition to the above provisions, the Appointing Authority can also make special provisions for a Government servant in the following cases:<br>Promotion: The Appointing Authority can promote a Government servant to a higher post, even if they have not completed the required period of service, if it is in the public interest to do so.<br>Pay: The Appointing Authority can grant a special pay to a Government servant, if it is in the public interest to do so.<br>Leave: The Appointing Authority can grant special leave to a Government servant, if it is in the public interest to do so.<br>Disciplinary proceedings: The Appointing Authority can waive or reduce the penalty imposed on a Government servant in disciplinary proceedings, if it is in the public interest to do so.<br>The Appointing Authority has the discretion to make special provisions for a Government servant in the above cases, but it must exercise its discretion judiciously and in the public interest.\n\n I hope this helps."
      ]
    },
    {
      "tag": "rights_protection",
      "patterns": [
        "Government servant Protection of rights and privileges",
        "Rights conferred by law for Government servant",
        "Deprivation of rights under rules for Government servant"
      ],
      "responses": [
        "The rules ensure the protection of rights and privileges conferred by any law or agreement.\nNo government servant shall be deprived of any right or privilege under these rules.\nRights and privileges under the law or existing agreements are safeguarded.\n\n The Gujarat Administrative Department (GAD) has formulated various rules and regulations to protect the rights and privileges of government servants in the state. These rules cover a wide range of aspects, including:\n• Appointment and promotion: The GAD has laid down clear procedures for the appointment and promotion of government servants. These procedures ensure that appointments are made on the basis of merit and that promotions are based on seniority and performance.\n• Pay and allowances: The GAD has also prescribed pay scales and allowances for different categories of government servants. These pay scales and allowances are regularly revised to keep pace with the rising cost of living.\n• Leave and vacation: Government servants are entitled to a certain number of leave days and vacation days in a year. The GAD has laid down clear rules for the grant of leave and vacation.\n• Disciplinary action: The GAD has also formulated rules for disciplinary action against government servants. These rules ensure that government servants are treated fairly and that disciplinary action is taken only for misconduct.\n• Retirement benefits: Government servants are entitled to a number of retirement benefits, including pension, gratuity, and commutation of pension. The GAD has laid down clear rules for the calculation and payment of these benefits.\n\n These measures ensure that government servants in Gujarat are treated fairly and that their rights and privileges are protected.\n\n I hope this helps.",
        "The rules guarantee the safeguarding of rights and privileges granted by any law or agreement.\nNo government servant shall be deprived of any right or privilege under these rules.\nRights and privileges under the law or existing agreements are safeguarded.\n\nThe Gujarat Administrative Department (GAD) has established various rules and regulations to ensure the protection of the rights and privileges of government servants in the state. These rules encompass diverse aspects, including:\n• Appointment and promotion: The GAD has outlined transparent procedures for the appointment and promotion of government servants, ensuring merit-based appointments and seniority and performance-based promotions.\n• Pay and allowances: The GAD has stipulated pay scales and allowances for different categories of government servants, regularly revising them to align with the increasing cost of living.\n• Leave and vacation: Government servants are entitled to a specific number of leave days and vacation days annually. The GAD has established clear rules for the grant of leave and vacation.\n• Disciplinary action: The GAD has also devised rules for disciplinary action against government servants, ensuring fair treatment and disciplinary measures only for misconduct.\n• Retirement benefits: Government servants are entitled to various retirement benefits, including pension, gratuity, and commutation of pension. The GAD has established explicit rules for the calculation and disbursement of these benefits.\n\nThese measures guarantee equitable treatment of government servants in Gujarat and the protection of their rights and privileges.\n\nI hope this helps.",
        "The rules guarantee the safeguarding of rights and privileges as conferred by any law or agreement.\nNo government servant shall be deprived of any right or privilege under these rules.\nRights and privileges under the law or existing agreements are safeguarded.\n\nThe Gujarat Administrative Department (GAD) has established various rules and regulations to protect the rights and privileges of government servants in the state. These rules encompass diverse aspects, including:\n• Appointment and promotion: The GAD has defined explicit procedures for the appointment and promotion of government servants, ensuring merit-based appointments and seniority- and performance-based promotions.\n• Pay and allowances: The GAD has set pay scales and allowances for different categories of government servants, regularly revising them to keep pace with the increasing cost of living.\n• Leave and vacation: Government servants are entitled to a specific number of leave and vacation days annually, with the GAD providing clear rules for their grant.\n• Disciplinary action: The GAD has also formulated rules governing disciplinary action against government servants, ensuring fair treatment and disciplinary measures strictly for misconduct.\n• Retirement benefits: Government servants are entitled to various retirement benefits, including pension, gratuity, and commutation of pension. The GAD has established clear rules for calculating and disbursing these benefits.\n\nThese measures guarantee fair treatment of government servants in Gujarat and the protection of their rights and privileges.\n\nI hope this helps."
      ]
    },
    {
      "tag": "suspension_rules",
      "patterns": [
        "Suspension rules",
        "Government servant suspension rules",
        "Disciplinary proceeding suspension of government servant"
      ],
      "responses": [
        "The rules governing suspension outline circumstances under which a government servant may be placed under suspension. This includes instances during disciplinary proceedings or criminal investigations.\n\n Government servants may find themselves under suspension based on the discretion of the appointing authority or a relevant disciplinary authority. The suspension process is subject to review within a specified timeframe.\n\n The review of suspension involves considerations of the circumstances leading to the suspension. The competent authority has the power to either extend or revoke the suspension within a ninety-day period.\n\nSuspension rules for government servants are regulations that govern the temporary removal of a government employee from their position pending an investigation into allegations of misconduct or wrongdoing. These rules are designed to balance the need to protect the government's interests and the rights of its employees.\n\nPurpose of Suspension\n     The primary purpose of suspending a government servant is to:\n1. Prevent the employee from interfering with the investigation\n2. Protect the integrity of the government service\n3. Safeguard the interests of the public\n\nGrounds for Suspension\n\nA government servant may be suspended on the basis of various grounds, typically including:\n\n1. Allegations of misconduct, such as corruption, negligence, or breach of discipline\n2. Criminal charges or convictions\n3. Acts prejudicial to the interests of the government or the public\n4. Serious irregularities or negligence in performance of duties\n5. Unabsented leave without proper authorization.\n\n Importance of Suspension Rules\n\n    Suspension rules play a crucial role in maintaining the integrity and efficiency of the government service. They ensure that government employees are held accountable for their actions while safeguarding their rights and preventing arbitrary or unjust treatment. These rules also protect the public interest by ensuring that government employees maintain high standards of conduct and ethical behavior.\n\n I hope this helps. if you have more question, feel free to ask!",
        "The regulations governing suspension delineate the circumstances under which a government servant may be placed under suspension, including instances during disciplinary proceedings or criminal investigations.\n\nGovernment servants may face suspension at the discretion of the appointing authority or a relevant disciplinary authority. The suspension process is subject to review within a specified timeframe.\n\nThe review of suspension involves an assessment of the circumstances leading to the suspension. The competent authority possesses the discretion to either extend or revoke the suspension within a ninety-day period.\n\nSuspension rules for government servants are guidelines that govern the temporary removal of a government employee from their position pending an investigation into allegations of misconduct or wrongdoing. These rules aim to balance the need to protect the government's interests and the rights of its employees.\n\nPurpose of Suspension\n The primary objectives of suspending a government servant are to:\n1. Prevent the employee from interfering with the investigation\n2. Protect the integrity of the government service\n3. Safeguard the interests of the public\n\nGrounds for Suspension\n\nA government servant may be suspended based on various grounds, typically including:\n\n1. Allegations of misconduct, such as corruption, negligence, or breach of discipline\n2. Criminal charges or convictions\n3. Acts prejudicial to the interests of the government or the public\n4. Serious irregularities or negligence in the performance of duties\n5. Unabsented leave without proper authorization.\n\nImportance of Suspension Rules\n\nSuspension rules play a crucial role in maintaining the integrity and efficiency of the government service. They ensure that government employees are held accountable for their actions while safeguarding their rights and preventing arbitrary or unjust treatment. These rules also protect the public interest by ensuring that government employees maintain high standards of conduct and ethical behavior.\n\nI hope this helps."
      ]
    },
    {
      "tag": "disciplinary_proceeding",
      "patterns": [
        "Disciplinary proceeding suspension",
        "Suspension during inquiry of government servant",
        "tell me about Suspension period extension"
      ],
      "responses": [
        "Suspension may be initiated when a disciplinary proceeding is either contemplated or already in progress. This precautionary measure is taken to ensure a fair and unbiased inquiry.\n\nDuring a disciplinary inquiry, the appointing authority or a relevant disciplinary authority has the discretion to suspend a government servant. The suspension period may be extended beyond the initial ninety days under specific circumstances, as recorded in writing.\n\n The periodic review of suspension during a disciplinary proceeding is crucial. The competent authority, after considering special circumstances, may extend the suspension beyond ninety days, but such extensions cannot exceed ninety days at a time.\n\nProvided further that the Government or any other authority empowered by the government by special or general order may at any time before the expiry of the said period of ninety days and after considering the special circumstances for not initiating disciplinary proceedings, to be recorded in writing extend the period of suspension beyond the period of ninety days without disciplinary proceeding being initiated: \nProvided also that such extension of suspension shall not be for a period of ninety days at a time.\n\n If there's anything else on your mind, feel free to ask. I'm here to provide assistance.",
        "Suspension may be initiated when a disciplinary proceeding is either contemplated or already in progress, serving as a precautionary measure to ensure a fair and unbiased inquiry.\n\nIn the course of a disciplinary inquiry, the appointing authority or a relevant disciplinary authority holds the discretion to suspend a government servant. The suspension period may be extended beyond the initial ninety days under specific circumstances, as documented in writing.\n\nThe periodic review of suspension during a disciplinary proceeding is of utmost importance. The competent authority, taking special circumstances into account, may extend the suspension beyond ninety days, but such extensions cannot exceed ninety days at a time.\n\nMoreover, the Government or any other authority empowered by the government, by special or general order, may, before the expiry of the said period of ninety days and after considering the special circumstances for not initiating disciplinary proceedings (to be recorded in writing), extend the period of suspension beyond the ninety days without disciplinary proceedings being initiated. Additionally, such extensions of suspension shall not be for a period of ninety days at a time.\n\n I'm glad if this information is of help. Is there anything more you'd like assistance on?"
      ]
    },
    {
      "tag": "deemed_suspension",
      "patterns": [
        "Deemed suspension",
        "Deemed suspension of government servant",
        "Suspension from date of detention",
        "Suspension after conviction"
      ],
      "responses": [
        "Deemed suspension occurs under certain conditions. For example, a government servant is deemed to be under suspension from the date of detention if held in custody for a period exceeding forty-eight hours, whether on a criminal charge or otherwise.\nSimilarly, if a government servant is convicted and sentenced to imprisonment exceeding forty-eight hours, and there is no immediate dismissal, removal, or compulsory retirement, they are deemed to be under suspension from the date of conviction.\n\n The review of suspension in deemed cases is essential. The competent authority may, after reviewing, pass an order either extending or revoking the suspension. Extensions, however, are limited to a maximum of one hundred and eighty days at a time.\n\nDeemed suspension is a procedural mechanism under which a government servant is considered to be under suspension even though no formal order of suspension has been issued. This is typically applied in situations where the circumstances surrounding the government servant's position or actions indicate that suspension is warranted, even though the process of issuing a formal order may take some time.\nCircumstances Leading to Deemed Suspension\n\n Deemed suspension typically arises in the following situations:\n     Detention in Custody: If a government servant is detained in custody for more than 48 hours, either on criminal charges or otherwise, they are deemed to be under suspension from the date of detention. This is to ensure that the government servant is not able to interfere with the criminal proceedings or continue with their official duties while under investigation.\n       Criminal Conviction: If a government servant is convicted of a crime and sentenced to imprisonment for a period exceeding 48 hours, they are deemed to be under suspension from the date of conviction, even if they have not yet been dismissed, removed, or compulsorily retired from service. This is to prevent the convicted individual from holding a position in the government while they serve their sentence.\n\n Implications of Deemed Suspension\nDespite the lack of a formal suspension order, deemed suspension has the same legal consequences as a regular suspension. This means that the government servant is temporarily removed from their position, is not entitled to perform their official duties, and is only entitled to a portion of their pay, typically half or two-thirds, as a subsistence allowance.\n\nAppeal and Reinstatement\n Just like in a regular suspension, a Government servant deemed to be under Suspension has the right to appeal the decision to the appropriate authority. If the appeal is successful, the deemed suspension order will be revoked, and the government servant will be reinstated to their position with full pay and benefits.\n\n  If there's anything else on your mind, feel free to ask. I'm here to provide assistance.",
        "Deemed suspension comes into effect under specific conditions. For instance, if a government servant is detained in custody for a period exceeding forty-eight hours, whether on a criminal charge or otherwise, they are considered to be under suspension from the date of detention. Similarly, if a government servant is convicted and sentenced to imprisonment for more than forty-eight hours, and there is no immediate dismissal, removal, or compulsory retirement, they are deemed to be under suspension from the date of conviction.\n\nReviewing the suspension in deemed cases is crucial. The competent authority may, after assessment, issue an order either extending or revoking the suspension. Extensions, however, are constrained to a maximum of one hundred and eighty days at a time.\n\nDeemed suspension is a procedural mechanism wherein a government servant is regarded as being under suspension even without a formal suspension order. This is typically applied in situations where the circumstances surrounding the government servant's position or actions indicate that suspension is warranted, even though the process of issuing a formal order may take some time.\n\nCircumstances Leading to Deemed Suspension\n\nDeemed suspension usually arises in the following situations:\n Detention in Custody: If a government servant is detained in custody for more than 48 hours, either on criminal charges or otherwise, they are deemed to be under suspension from the date of detention. This is to prevent interference with criminal proceedings or continuation of official duties during investigation.\n Criminal Conviction: If a government servant is convicted and sentenced to imprisonment for a period exceeding 48 hours, they are deemed to be under suspension from the date of conviction, even if there is no immediate dismissal, removal, or compulsory retirement. This is to prevent the convicted individual from holding a government position while serving the sentence.\n\nImplications of Deemed Suspension\nDespite the absence of a formal suspension order, deemed suspension carries the same legal consequences as regular suspension. This entails temporary removal from the position, inability to perform official duties, and entitlement to only a portion of the pay, typically half or two-thirds, as a subsistence allowance.\n\nAppeal and Reinstatement\nJust as in regular suspension, a government servant deemed to be under suspension has the right to appeal the decision to the appropriate authority. A successful appeal results in the revocation of the deemed suspension order, and the government servant is reinstated to their position with full pay and benefits.\n\nIf there's anything else on your mind, feel free to ask. I'm here to provide assistance."
      ]
    },
    {
      "tag": "suspension_continuation",
      "patterns": [
        "Continuation of suspension of a government servant",
        "Suspension after penalty set aside",
        "Suspension during further inquiry",
        "What happens after an employee has been suspended during further inquiry?"
      ],
      "responses": [
        "Suspension continues if a penalty of dismissal, removal, or compulsory retirement is set aside in appeal. In such cases, the order of suspension is deemed to have continued with effect from the date of the original order of dismissal, removal, or compulsory retirement.\n\nIf a penalty is set aside or declared void due to a court decision, and the disciplinary authority decides to hold a further inquiry, the government servant is deemed to be under suspension from the date of the original order and remains under suspension until further orders.\n\nThe continuation of suspension is contingent upon the circumstances of the case and the decisions made by the competent authorities. The suspension remains in force until modified or revoked by the authority that made the order or any authority to which that authority is subordinate.\n\n I hope this Helps.",
        "If a penalty of dismissal, removal, or compulsory retirement is overturned on appeal, the suspension remains in effect from the date of the initial dismissal, removal, or compulsory retirement order.\n\nIn cases where a court decision declares a penalty null and void, and the disciplinary authority decides to pursue further investigation, the government servant is considered under suspension from the date of the initial order until further notice.\n\nThe continuation of suspension hinges on the specific circumstances of the case and the decisions made by the relevant authorities. The suspension remains in force until modified or revoked by the authority that issued the order or any superior authority.\n\n I hope this helps, feel free to ask further."
      ]
    },
    {
      "tag": "Procedure_of_suspension",
      "patterns":["The procedure for suspending a government servant",
                  "What is procedure for suspending a government servant?",
                  "Procedure of suspension?",
                  "tell me about Procedure of suspension."],
      "responses":["Procedure for Suspension\n\nThe procedure for suspending a government servant generally involves the following steps:\n1. Issuance of Show-Cause Notice: The competent authority, such as the department head or a designated disciplinary officer, issues a show-cause notice to the concerned employee. The notice outlines the allegations against the employee and provides them an opportunity to explain or defend their actions.\n2. Consideration of Response: The competent authority reviews the employee's response to the show-cause notice and makes a determination based on the available evidence and the employee's explanation.\n3. Issuance of Suspension Order: If the competent authority decides to suspend the employee, they issue a formal suspension order. The order specifies the grounds for suspension, the duration of suspension, and any restrictions imposed on the employee during the suspension period.\n\nDuration of Suspension\n\nThe duration of suspension typically varies depending on the severity of the allegations and the complexity of the investigation. In general, suspensions may range from a few weeks to several months. However, the suspension period can be extended if the investigation is not yet complete.\n\n Reinstatement\n\nIf the investigation finds that the employee is not guilty of the alleged misconduct or wrongdoing, they are reinstated to their position and are entitled to receive the full amount of pay and allowances they would have received if they had not been suspended.\n\n I hope this helps.",
  "Procedure for Suspension\n\nThe process of suspending a government servant generally entails the following steps:\n    1. Show-Cause Notice: The competent authority, such as the department head or a designated disciplinary officer, issues a notice detailing allegations and providing the concerned employee with an opportunity to explain or defend their actions.\n   2. Response Evaluation: The competent authority assesses the employee's response to the show-cause notice, making a determination based on available evidence and the employee's explanation.\n 3. Issuance of Suspension Order: If the competent authority decides on suspension, they release a formal suspension order specifying grounds, suspension duration, and any imposed restrictions on the employee during the suspension period.\n\nDuration of Suspension\n    The suspension duration typically varies based on the severity of allegations and investigation complexity. In general, suspensions may last from a few weeks to several months, with the possibility of extension if the investigation is incomplete.\n\nReinstatement\n    Upon investigation finding the employee not guilty of alleged misconduct, they are reinstated to their position, entitled to receive the full amount of pay and allowances they would have received if not suspended.\n\nI hope this provides clarity."]
      },
      {
        "tag": "modification_revocation_suspension_order",
        "patterns": [
          "what is Modification of suspension order",
          "Revocation of suspension order",
          "Authority to modify or revoke suspension order"
        ],
        "responses": [
          "An order of suspension made or deemed to have been made under the rule may be modified or revoked at any time. The authority that made the suspension order or the authority deemed to have made it, or any authority to which that authority is subordinate, holds the power to make modifications or revoke the suspension.\n\nThis provision allows flexibility in the management of suspensions. The competent authority can reassess the circumstances and, if deemed appropriate, modify or revoke the suspension order.\n\nThe authority's ability to modify or revoke the suspension order ensures that the decision remains aligned with the evolving situation and any changes in the government servant's status or the disciplinary proceedings."
        ]
      },
      {
        "tag": "suspension_continuation_disciplinary_proceeding",
        "patterns": [
          "Continuation of suspension during disciplinary proceeding",
          "Disciplinary proceeding during suspension",
          "Extension of suspension during inquiry"
        ],
        "responses": [
          "If a government servant is suspended or deemed to have been suspended in connection with any disciplinary proceeding or otherwise, and another disciplinary proceeding is initiated during the ongoing suspension, the competent authority may, for recorded reasons, direct that the government servant shall continue to be under suspension until the termination of all or any of such proceedings.\n\nThis provision ensures that if additional disciplinary proceedings are commenced while the government servant is already under suspension, the authority competent to place the individual under suspension has the discretion to extend the suspension until the conclusion of all related proceedings.\n\nThe decision to continue the suspension is made based on reasons recorded in writing. This ensures transparency and accountability in the process, allowing the competent authority to provide a clear rationale for the extension of the suspension period.\n\n I hope this information found helpful.",
          "If a government servant is suspended or deemed to have been suspended, and another disciplinary proceeding is initiated during the ongoing suspension, the competent authority may, for recorded reasons, direct the continuation of the suspension until the termination of all or any of such proceedings.\n\nThis provision ensures that if additional disciplinary proceedings commence while the government servant is already under suspension, the authority competent to suspend has the discretion to extend the suspension until the conclusion of all related proceedings.\n\nThe decision to prolong the suspension is based on reasons recorded in writing, ensuring transparency and accountability. This allows the competent authority to provide a clear rationale for the extension of the suspension period.\n\nI hope this helps🙂."
        ]
      },
      {
        "tag":"Censure",
        "patterns":[
          "What is Censure?",
          "Censure"],
    "responses": [
      "Censure is a formal reprimand expressing disapproval of the government servant's conduct.",
      "A official rebuke that expresses displeasure of the behaviour of a government employee is called a censure",
      "Censure is a formal rebuke that expresses displeasure of the government employee's behaviour."]
      },
      {
        "tag": "disciplinary_penalties",
        "patterns": [
          "what is Nature of penalties",
          "disciplinary penalties",
          "what are minor and major penalties?",
          "Tell me about penalties in Gujarat Government.",
          "Government servant penalties"
        ],
        "responses": [
          "Disciplinary actions and penalties are outlined in accordance with the rules, without prejudice to existing laws. Various penalties may be imposed on members of the State, Subordinate, or Inferior Service for good and sufficient reasons.\n\nThe penalties are categorized into two types: Minor Penalties and Major Penalties.\n\n <b>Minor Penalties:</b>\n1. Censure\n2. Withholding of increments or promotion.\n3. Recovery from pay of the whole or part of any pecuniary loss caused to Government by negligence or breach of orders.\n\nMajor Penalties:\n4. Reduction to a lower stage in the time scale of pay for a specified period, with further directions on increments and effect on subsequent increments.\n5. Reduction to a lower time scale of pay, grade, post or service, with or without conditions for restoration and impact on seniority and pay upon restoration.\n6. Compulsory retirement.\n7. Removal from service without disqualification for future employment.\n8. Dismissal from service with ordinary disqualification for future government employment.",
          "Disciplinary actions and penalties are delineated in accordance with the rules, without prejudice to existing laws. Various penalties may be imposed on members of the State, Subordinate, or Inferior Service for good and sufficient reasons.\n\nThe penalties are divided into two categories: Minor Penalties and Major Penalties.\n\n<b>Minor Penalties:</b>\n1. Censure\n2. Withholding of increments or promotion.\n3. Recovery from pay of the whole or part of any pecuniary loss caused to the Government by negligence or breach of orders.\n\nMajor Penalties:\n4. Reduction to a lower stage in the time scale of pay for a specified period, with further directions on increments and the effect on subsequent increments.\n5. Reduction to a lower time scale of pay, grade, post or service, with or without conditions for restoration and impact on seniority and pay upon restoration.\n6. Compulsory retirement.\n7. Removal from service without disqualification for future employment.\n8. Dismissal from service with ordinary disqualification for future government employment.\n\n I hope this helps."
        ]
      },
      {
        "tag": "minor_penalties",
        "patterns": [
          "What are Minor penalties",
          "Minor penalties.",
          "Tell me all Minor penalties."
        ],
        "responses": [
          "Minor Penalties:\n1. Censure\n2. Withholding of increments or promotion.\n3. Recovery from pay of the whole or part of any pecuniary loss caused to Government by negligence or breach of orders.\n\nMinor penalties may be imposed for certain disciplinary offenses. These penalties include censure, withholding of increments, and recovery from pay for pecuniary loss caused to the Government by negligence or breach of orders.\nCensure is a formal reprimand expressing disapproval of the government servant's conduct.\nWithholding of increments serves as a disciplinary measure affecting salary increases or promotions.\nRecovery from pay is applicable when the government servant's actions result in pecuniary loss to the Government."
        ]
      },
      {
        "tag": "major_penalties",
        "patterns": [
          "Major penalties",
          "what are major penalties",
          "tell me all major penalties that government can do.",
          "what is big panelties in gujarat for government servant?",
          "can goverment remove servant from service under penalties.?",
          "what happen when i do serious disciplinary violations.?"
        ],
        "responses": [
          "Major penalties are more severe and are imposed for serious disciplinary violations. They include:\n\n-> Reduction to a lower stage in the time scale of pay for a specified period, with further directions on increments and effect on subsequent increments.\n-> Reduction to a lower time scale of pay, grade, post or service, with or without conditions for restoration and impact on seniority and pay upon restoration.\n Compulsory retirement.\n-> Removal from service without disqualification for future employment.\n-> Dismissal from service with ordinary disqualification for future government employment.\n\n I hope this helps.",
          "Major penalties are more severe and are imposed for serious disciplinary violations. They encompass:\n\n-> Reduction to a lower stage in the time scale of pay for a specified period, with further directions on increments and the effect on subsequent increments.\n-> Reduction to a lower time scale of pay, grade, post, or service, with or without conditions for restoration and impact on seniority and pay upon restoration.\n Compulsory retirement.\n-> Removal from service without disqualification for future employment.\n-> Dismissal from service with ordinary disqualification for future government employment\n\n I hope this information found helpful."
        ]
      },
      {
        "tag": "no_penalty_explanation",
        "patterns": [
          "what are those Actions that are not considered as a penalties",
          "Non-penalty actions",
          "What actions do not amount to penalties under rules."
        ],
        "responses": [
          "Certain actions do not amount to penalties under the meaning of the relevant rules. These include:\n\n(1) Withholding of increments for failure to pass a departmental or other examination, as per the rules or orders in force or in accordance with the terms of the appointment.\n(2) Stoppage of pay at the efficiency bar in the time-scale due to the government servant's unfitness to cross the bar.\n(3) Non-promotion of a government servant, whether in a substantive or officiating capacity, to a service, grade, or post for which they are ordinarily eligible, based on administrative grounds and not as a penalty for misconduct.\n(4) Reversion to a lower service, grade, or post of an officiating government servant in a higher position on the grounds of unsuitability after trial or purely administrative reasons.\n(5) Reversion to the permanent service, grade, or post of a government servant appointed on probation to another service, grade, or post during or at the end of the probation period, following the terms of appointment or prevailing rules and orders.\n(6) Replacement of services of a government servant borrowed from Central or other State Government or any other authority at the disposal of the borrowing entity.\n(7) Compulsory retirement in accordance with the provisions of existing laws or rules related to such retirements.\n(8) Termination of service, which may occur during or at the end of the probation period for a government servant appointed on probation, termination of service for a temporary government servant based on administrative grounds, or termination of service for a government servant employed under a contract, following the terms of the contract.\n\n If there's anything else on your mind, feel free to ask. I'm here to provide assistance."
        ]
      },{
        "tag": "government_penalties_imposition",
        "patterns": [
          "Imposition of penalties by authorities",
          "Authority to impose penalties on government servant",
          "Head of Department disciplinary penalties powers",
          "Penalties by Heads of Departments and Offices",
          "Disciplinary powers of Heads of Departments and Offices",
          "Penalties by High Level Committee"
        ],
        "responses": [
          "The government has the authority to impose any of the penalties specified in rule on any government servant.\nPenalties may include censure, withholding of increments, reduction in pay scale, compulsory retirement, removal from service, and dismissal from service.\nThe imposition of penalties is subject to the rules and regulations in force.\n\nThe Head of a Department has the authority to impose penalties specified in rule on any government servant of State Service Class II under their administrative control.\nThis authority allows the Head of Department to take disciplinary actions, including censure, withholding of increments, and other specified penalties.\nThe exercise of disciplinary powers by the Head of Department is in accordance with the rules and regulations in force.\n\nHeads of Departments and Heads of Offices have the authority to impose penalties mentioned in rule on government servants of subordinate services, whom they have the power to appoint.\nDisciplinary powers are exercised based on the rules and regulations in force and the administrative control of the Heads of Departments and Offices.\n\nThe High Level Committee has the authority, under rule 11 A, to impose any of the penalties specified in rule on any government servant.\nThis authority allows the High Level Committee to take disciplinary actions, including censure, withholding of increments, and other specified penalties.\nThe imposition of penalties by the High Level Committee is governed by rule 11 A and is subject to the rules and regulations in force.\n\nI hope this helps.",
          "The government possesses the authority to apply any of the penalties outlined in the rule to any government servant.\nPenalties may encompass censure, withholding of increments, reduction in pay scale, compulsory retirement, removal from service, and dismissal from service. The imposition of penalties is contingent on the rules and regulations currently in effect.\n\nThe Head of a Department holds the authority to enforce penalties specified in the rule on any government servant of State Service Class II under their administrative control. This authorization enables the Head of Department to take disciplinary actions, such as censure, withholding of increments, and other specified penalties.\nThe exercise of disciplinary powers by the Head of Department adheres to the rules and regulations currently in force.\n\nHeads of Departments and Heads of Offices possess the authority to apply penalties mentioned in the rule on government servants of subordinate services, over whom they have the power to appoint. Disciplinary powers are exercised based on the rules and regulations in force and the administrative control of the Heads of Departments and Offices.\n\nThe High-Level Committee has the authority, under rule 11A, to impose any of the penalties specified in the rule on any government servant. This authorization empowers the High-Level Committee to take disciplinary actions, including censure, withholding of increments, and other specified penalties.\nThe imposition of penalties by the High-Level Committee is governed by rule 11A and is subject to the rules and regulations currently in force.\n\n If there's anything else on your mind, feel free to ask. I'm here to provide assistance."
        ]
      },
      {
        "tag": "authority_to_institute_proceedings",
        "patterns": [
          "Authority to institute proceedings against government servant",
          "Instituting disciplinary proceedings",
          "authority to initiate Instituting disciplinary proceedings"
        ],
        "responses": [
          "The authority to initiate disciplinary proceedings is vested in the Government or any other authority empowered by general or special order.\n\nDisciplinary proceedings may be initiated against a government servant based on the following:\n(a) The Government or any other authority empowered by it can institute disciplinary proceedings against a government servant.\n(b) A Disciplinary Authority may be directed to institute disciplinary proceedings against any government servant on whom that disciplinary authority is competent to impose any of the penalties specified in rule 6.\nThe Disciplinary Authority, competent to impose minor penalties, may also institute disciplinary proceedings for major penalties, even if not competent to impose the latter penalties under these rules.\nAdditionally, a Disciplinary Authority competent under these rules to impose penalties on a government servant is also competent to institute disciplinary proceedings for acts committed while holding another government post previously.\n\n I hope this helps."
        ]
      },
      {
        "tag": "disciplinary_proceeding_initiation",
        "patterns": [
          "Initiation of disciplinary proceeding against a government servant.",
          "what is Disciplinary action initiation by Authority?"
        ],
        "responses": [
          "The initiation of disciplinary proceedings can occur under the following circumstances:\n- The Government or any other empowered authority may institute disciplinary proceedings against a government servant.\n- Directives may be issued to a Disciplinary Authority, competent to impose penalties, to initiate disciplinary proceedings against a government servant.\n- A Disciplinary Authority, competent to impose minor penalties, may initiate proceedings for major penalties, even if not initially competent for the latter penalties under these rules.\n- Disciplinary Authorities competent to impose penalties are also authorized to initiate proceedings for acts committed by a government servant while holding a previous government post.",
          "The process of initiating disciplinary proceedings involves:\n- The Government or an empowered authority having the authority to institute disciplinary proceedings against a government servant.\n- Issuance of directives to a Disciplinary Authority, competent to impose penalties, for initiating disciplinary proceedings against a government servant.\n- Empowering Disciplinary Authorities competent to impose minor penalties to also initiate proceedings for major penalties, even if not initially competent for the latter penalties under these rules.\n- Granting authority to Disciplinary Authorities competent to impose penalties to initiate proceedings for acts committed by a government servant while holding a previous government post."
        ]
      },
      {
        "tag": "sexual_harassment_complaints",
        "patterns": [
          "Sexual harassment complaints",
          "What can we do in Sexual harassment Condition.",
          "Designated Complaints Committee role",
          "What mechanism has the Gujarat Administrative Department established to address sexual harassment complaints by government employees in the state?",
          "Sexual Harassment Prevention Committee",
          "rule of sexual harassment.",
          "What steps does the GAD's Sexual Harassment Prevention Committee (SHPC) take when a sexual harassment complaint is received?",
          "Through which channels can government employees in Gujarat report sexual harassment incidents?"
        ],
        "responses": [
          "In cases of sexual harassment complaints, the Complaints Committee established in each department or office is deemed the inquiry authority.'\nThe committee follows the procedure laid down in the rules for inquiries, ensuring fairness and adherence to guidelines.\nIf separate procedures are not prescribed for sexual harassment inquiries, the committee conducts the inquiry in accordance with the rules.\n\n The Gujarat Administrative Department (GAD) has established a comprehensive mechanism for addressing sexual harassment complaints filed by government employees in the state. The mechanism aims to provide a safe, supportive, and impartial environment for reporting and investigating sexual harassment incidents, ensuring that victims are treated with dignity and respect throughout the process.\n\nReporting Sexual Harassment\nGovernment employees in Gujarat can report sexual harassment incidents through various channels, including:\n-> Directly to the GAD: Employees can submit their complaints directly to the GAD's Sexual Harassment Prevention Committee (SHPC). The SHPC is responsible for receiving, investigating, and adjudicating complaints.\n-> Through the Designated Complaint Committee (DCC): Each government department has a designated DCC to receive and address sexual harassment complaints within the department.-> Through the GAD's Online Complaint Portal: Employees can file their complaints electronically through the GAD's dedicated online portal.\n\n Complaint Investigation Process\n Once a sexual harassment complaint is received, the GAD's SHPC initiates a thorough investigation. The investigation typically involves:\n-> Preliminary Inquiry: The SHPC conducts a preliminary inquiry to gather information about the complaint and assess its validity.\n-> Detailed Investigation: If the preliminary inquiry indicates merit, a detailed investigation is conducted. This may involve interviews with witnesses, review of relevant documents, and collection of evidence.\n-> Submission of Investigation Report: The SHPC prepares a detailed investigation report summarizing the findings and recommendations.\n-> Consideration of Recommendations: The competent authority, such as the department head or the GAD's SHPC, reviews the investigation report and considers the recommended action.\n-> Action Taken: Based on the investigation report and recommendations, appropriate action is taken, which may include counseling, warnings, disciplinary action, or even termination of employment.\n\nEmployee Protection and Support\nThroughout the complaint investigation process, the GAD provides various forms of support to the victim of sexual harassment, including:\n-> Confidentiality: The GAD maintains strict confidentiality throughout the process to protect the victim's identity and privacy.\n-> Counseling and Support Services: The GAD provides counseling and support services to victims, helping them cope with the emotional impact of the harassment and guiding them through the legal process.\n-> Temporary Accommodation or Transfer: If necessary, the GAD may arrange temporary accommodation or transfer for the victim to ensure their safety and well-being.\n-> Legal Assistance: The GAD may provide legal assistance to victims who wish to pursue legal action against the perpetrator\n\n By establishing a robust complaint mechanism and implementing preventive measures, the Gujarat Administrative Department is committed to creating a safe and respectful work environment for all government employees, ensuring that sexual harassment is not tolerated and that victims receive the support and justice they deserve.\n\n I trust this was helpful. Is there anything else I can support you with at the moment?",
          "In instances of complaints related to sexual harassment, the Complaints Committee established in each department or office serves as the designated inquiry authority. The committee adheres to the procedures outlined in the rules for inquiries, ensuring fairness and compliance with guidelines. If specific procedures are not outlined for sexual harassment inquiries, the committee conducts the inquiry in accordance with the established rules.\n\nThe Gujarat Administrative Department (GAD) has instituted a comprehensive mechanism to address sexual harassment complaints from government employees in the state. The objective is to create a secure, supportive, and impartial environment for reporting and investigating incidents of sexual harassment, ensuring that victims are treated with dignity and respect throughout the entire process.\n\nReporting Sexual Harassment:\nGovernment employees in Gujarat have various channels through which they can report sexual harassment incidents, including:\n-> Directly to the GAD: Complaints can be submitted directly to the GAD's Sexual Harassment Prevention Committee (SHPC), which is responsible for receiving, investigating, and adjudicating complaints.\n-> Through the Designated Complaint Committee (DCC): Each government department has a designated DCC to receive and address sexual harassment complaints within the department.\n-> Through the GAD's Online Complaint Portal: Employees can electronically file complaints through the GAD's dedicated online portal.\n\nComplaint Investigation Process:\nUpon receiving a sexual harassment complaint, the GAD's SHPC initiates a thorough investigation, typically involving:\n-> Preliminary Inquiry: Conducted by the SHPC to gather information about the complaint and assess its validity.\n-> Detailed Investigation: If the preliminary inquiry indicates merit, a detailed investigation is conducted, which may involve interviews with witnesses, document reviews, and evidence collection.\n-> Submission of Investigation Report: The SHPC prepares a detailed report summarizing findings and recommendations.\n-> Consideration of Recommendations: The competent authority, such as the department head or the GAD's SHPC, reviews the investigation report and considers the recommended action.\n-> Action Taken: Based on the investigation report and recommendations, appropriate action is taken, which may include counseling, warnings, disciplinary action, or termination of employment.\n\nEmployee Protection and Support:\nThroughout the complaint investigation process, the GAD provides various forms of support to the victim of sexual harassment, including:\n-> Confidentiality: Strict confidentiality is maintained throughout the process to protect the victim's identity and privacy.\n-> Counseling and Support Services: Victims receive counseling and support services to cope with the emotional impact of harassment and navigate the legal process.\n-> Temporary Accommodation or Transfer: If necessary, the GAD may arrange temporary accommodation or transfer for the victim to ensure safety and well-being.\n-> Legal Assistance: The GAD may provide legal assistance to victims pursuing legal action against the perpetrator.\n\nBy establishing a robust complaint mechanism and implementing preventive measures, the Gujarat Administrative Department is committed to creating a safe and respectful work environment for all government employees, ensuring that sexual harassment is not tolerated, and that victims receive the support and justice they deserve.\n\nI trust this information is helpful. Is there anything else I can assist you with at this moment?"
        ]
      },
      {
        "tag": "procedure_major_penalties",
        "patterns": [
          "Procedure for imposing major penalties",
          "What is the process for imposing major penalties"],
        "responses": [
          "The process for imposing major penalties involves a thorough inquiry as outlined in the rules.\nNo order imposing major penalties (items 1 to 4 of rule 6 major panalties) can be passed without a proper inquiry.\nThe Disciplinary Authority, if it finds grounds for inquiry into misconduct or misbehavior, may conduct the inquiry itself or appoint an Inquiry Authority.\nIn cases of sexual harassment complaints, the Complaints Committee is deemed the inquiry authority.\nThe Disciplinary Authority is required to draw up definite charges, provide a statement of misconduct, and list supporting evidence and witnesses.\nThe Government servant is given an opportunity to submit a written defense and express the desire to be heard in person.\nThe Inquiry Authority, after receiving the defense, may proceed to inquire into the charges, appointing an Inquiry Authority if needed.\nThe Inquiry Authority may nominate a Presenting Officer to present the case in support of the charges.\nThe Government servant may seek assistance from another government servant during the proceedings.\nThe Inquiry Authority may hear both sides, cross-examine witnesses, and allow the presentation of additional evidence if necessary.\nAfter the completion of the inquiry, a report is prepared containing details of charges, defense, assessment of evidence, findings, and reasons.\nThe report is forwarded to the Disciplinary Authority, including all relevant documents and orders made during the inquiry.\nThe disciplinary inquiry process involves several steps to ensure a fair assessment of charges and evidence.\nCharges are framed, evidence is presented, and the government servant has an opportunity to defend against the allegations.\nThe Inquiry Authority plays a crucial role in examining witnesses, assessing evidence, and preparing a comprehensive report.\nThe Government servant is entitled to legal representation, and assistance from another government servant, subject to certain conditions.\nThe process ensures transparency and adherence to principles of natural justice.\n\n I hope this helps."
        ]
      },
      {
        "tag": "disciplinary_inquiry_report",
        "patterns": [
          "disciplinary Inquiry report contents",
          "what are the Details in the disciplinary inquiry report?",
          "What the inquiry report of penalties includes?",
          "What specific details are included in the inquiry report regarding the charges brought against the government servant?"
        ],
        "responses": [
          "The inquiry report includes details of the charges, defense presented by the government servant, assessment of evidence, findings, and reasons for the findings.\nIt provides a comprehensive overview of the entire inquiry process and forms the basis for further actions by the Disciplinary Authority.",
          "The inquiry report offers a detailed account of the charges, the government servant's defense, an evaluation of evidence, findings, and the rationale behind those findings. Serving as a comprehensive summary, it constitutes the groundwork for subsequent actions taken by the Disciplinary Authority.",
          "The report on the inquiry encompasses a thorough examination of the charges, the defense articulated by the government servant, an analysis of the evidence, the resulting findings, and the underlying reasons for those findings. Serving as a comprehensive summary, it establishes the foundation for subsequent actions to be taken by the Disciplinary Authority.",
          "Comprising an in-depth review of the charges, the government servant's defense, an assessment of evidence, findings, and the reasons behind those findings, the inquiry report serves as a comprehensive document that shapes the basis for further actions to be undertaken by the Disciplinary Authority."
        ]
      },
      {
        "tag": "retired_govt_servant_assistance",
        "patterns": [
          "Assistance from retired servant",
          "can i take Retired government servant support for my case?",
          "Assistance from retired government servant to present the case"
        ],
        "responses": [
          "Yes, a government servant may seek assistance from a retired government servant to present the case on his behalf.\nThis is subject to conditions that may be determined in general or special orders issued by the Government.\nThe conditions for seeking assistance from a retired government servant may vary based on the specific guidelines provided by the Government."
        ]
      },
      {
        "tag": "forward_documents_to_inquiry_authority",
        "patterns": [
          "Forward documents to Inquiry Authority from Disciplinary Authority",
          "what is Transfer of documents to Inquiry Authority",
          "Submission of documents to Inquiry Authority"
        ],
        "responses": [
          "The Disciplinary Authority, when not serving as the Inquiry Authority, is required to forward specific documents to the Inquiry Authority.\nThese documents include a copy of the articles of charges and the statement of imputations of misconduct or misbehavior.\nAdditionally, the Disciplinary Authority forwards a copy of the written statement of defense, if any, submitted by the Government servant, along with the statement of witnesses as per sub-rule (3)(Gujarat Civil Services (Discipline and Appeal) Rules, 1971)\nEvidence proving the delivery of the documents to the Government servant and a copy of the order appointing the Presenting Officer are also included in the forwarded documents."
        ]
      },
      {
        "tag": "action_on_inquiry_report",
        "patterns": [
          "What actions can the Disciplinary Authority take after receiving the inquiry report?",
          "Explain the process of imposing penalties based on the inquiry report.",
          "Action on Inquiry Report",
          "Describe the steps taken by the Disciplinary Authority in response to the inquiry report."
        ],
        "responses": [
          "After receiving the inquiry report, the Disciplinary Authority has several courses of action.\nIf it disagrees with any findings of the Inquiry Authority, it records the reasons for the disagreement and establishes its own findings if the evidence supports it.\nIn cases where penalties specified in items (1) to (3) of Rule 6 are deemed appropriate, the Disciplinary Authority can make an order imposing such penalties.\nFor penalties specified in items (4) to (8) of Rule 6(Gujarat Civil Services (Discipline and Appeal) Rules, 1971), the Disciplinary Authority may directly impose the penalty without giving the Government servant an opportunity for representation on the proposed penalty.\nHowever, if consultation with the Commission is required in any case, the record of the inquiry is forwarded to the Commission for advice, which is considered before making any final decisions on the penalties to be imposed.\n\n I hope this helps🙂."
        ]
      },
      {
        "tag": "communication_of_orders",
        "patterns": [
          "How are orders communicated by the Disciplinary Authority?",
          "Explain the process of communicating orders to a Government servant by the Disciplinary Authority.",
          "information supplied to the Government servant after the Disciplinary Authority makes orders.",
          "What role does the Commission play in the communication of orders by the Disciplinary Authority?"
        ],
        "responses": [
          "Orders made by the Disciplinary Authority are communicated directly to the Government servant.\n\nThe Government servant is supplied with a copy of the report of the inquiry, if conducted by the Disciplinary Authority, and a copy of its findings on each article of charge.\nIn cases where the Disciplinary Authority is not the Inquiry Authority, the Government servant receives a copy of the report of the Inquiry Authority and a statement of the findings of the Disciplinary Authority along with brief reasons for any disagreement with the Inquiry Authority's findings.\nThe communication also includes a copy of the advice, if any, given by the Commission. If the Disciplinary Authority does not accept the advice of the Commission, a brief statement of the reasons for non-acceptance is provided.\nThis process ensures that the Government servant is fully informed of the decisions, findings, and advice related to the disciplinary proceedings.\nThe Commission's role is crucial in cases where its advice is sought. The communication to the Government servant includes details of the Commission's advice, if applicable.\n\n I hope this helps."
        ]
      },
      {
        "tag": "common_proceedings",
        "patterns": [
          "Explain the concept of common (joint) proceedings in disciplinary actions involving multiple Government servants.",
          "common proceedings initiated in disciplinary cases",
          "Who has the authority to make an order for common proceedings?",
          "Specify the penalties that a Disciplinary Authority in common proceedings can impose."
        ],
        "responses": [
          "Common (joint) proceedings in disciplinary actions occur when two or more Government servants are involved in a case.\nThe Government or any other authority competent to impose the penalty of dismissal from service on all concerned Government servants can order disciplinary action in a common proceeding.\nIf the authorities competent to impose dismissal are different, the highest-ranking authority among them can order common proceedings with the consent of the others.\nThe order for common proceedings specifies the Disciplinary Authority, the penalties it can impose, and the applicable procedure.\nThe authority specified in the order functions as the Disciplinary Authority for the common proceedings.\nThe Disciplinary Authority in common proceedings is competent to impose the penalties specified in rule 6 which provided in Gujarat Civil Services (Discipline and Appeal) Rules, 1971.\nThe order for common proceedings outlines whether the procedure laid down in rules 9 and 10 or rule 11 shall be followed in the disciplinary proceedings\n\n I hope this information found helpful."
        ]
      },
      {
        "tag": "special_procedure",
        "patterns": [
          "Explain the special procedure outlined in certain cases under rule 8 and 9 exceptions.",
          "Under what circumstances does the special procedure in rule 8 and 9 exceptions apply?"
        ],
        "responses": [
          "The special procedure outlined in certain cases under rule 8 and 9 of Gujarat Civil Services (Discipline and Appeal) Rules, 1971 exceptions applies in specific circumstances.\nIt does not apply where a penalty is to be imposed based on a Government servant's conviction on a criminal charge.\nThe special procedure exceptions apply when the Disciplinary Authority deems it impracticable, records reasons in writing, or when the Government believes it's not expedient for the security of the State.\nThe Disciplinary Authority may consider the circumstances and pass an order as deemed fit in cases covered by the exceptions in rules 8 and 9.\nIn cases exempted by rule 8 and 9 exceptions, the Commission must be consulted before passing orders if such consultation is necessary.\nExceptions to rules 8 and 9 allow the Disciplinary Authority to pass orders based on the circumstances of the case.\nThe Government may decide not to follow prescribed procedures in the interest of the security of the State.\n\n I hope this information found helpful, if you have more question, feel free to ask me!"
        ]
      },
      {
        "tag": "officers_lent_to_central_gov",
        "patterns": [
          "Explain the provisions regarding government officers lent to the Central Government or other State Governments.",
          "What actions can the borrowing authority take based on the findings of a disciplinary proceeding?",
          "Explain the steps the borrowing authority follows after a disciplinary proceeding against a government servant on loan.",
          "How does the borrowing authority decide on penalties after a disciplinary proceeding?"
        ],
        "responses": [
          "When a government servant's services are lent to the Central Government or other State Governments, the borrowing authority gains powers related to suspension and disciplinary proceedings.\nThe borrowing authority can place the government servant under suspension and act as the Disciplinary Authority for disciplinary proceedings.\nThe borrowing authority must inform the lending authority of the circumstances leading to the suspension or disciplinary proceeding.\nAfter a disciplinary proceeding, if the borrowing authority decides on penalties specified in items (1) to (3) of rule 6(Gujarat Civil Services (Discipline and Appeal) Rules, 1971), it may consult with the lending authority to make necessary orders.\nIn case of a difference of opinion between the borrowing and lending authorities, the services of the government servant shall be returned to the lending authority.\n\nSteps the borrowing authority follows after a disciplinary proceeding against a government servant on loan.After a disciplinary proceeding, the borrowing authority can take various actions based on its findings.\nIf the borrowing authority decides on penalties specified in items (1) to (3) of rule 6(Gujarat Civil Services (Discipline and Appeal) Rules, 1971), it may consult with the lending authority to make necessary orders.\nIn case of penalties specified in items (4) to (8) of rule 6 (Gujarat Civil Services (Discipline and Appeal) Rules, 1971), the borrowing authority returns the services of the government servant to the lending authority, transmitting the inquiry proceedings.\nThe lending authority, if it is the Disciplinary Authority, may pass necessary orders on the case, and if not, it can submit the case to the Disciplinary Authority.\n\n I hope this proves useful. Do you have any other inquiries or areas where I can offer assistance?",
          "When a government servant's services are lent to the Central Government or other State Governments, the borrowing authority acquires powers related to suspension and disciplinary proceedings. The borrowing authority can suspend the government servant and act as the Disciplinary Authority for disciplinary proceedings. The borrowing authority is required to inform the lending authority of the circumstances leading to the suspension or disciplinary proceeding.\n\nAfter a disciplinary proceeding, if the borrowing authority decides on penalties specified in items (1) to (3) of rule 6 (Gujarat Civil Services (Discipline and Appeal) Rules, 1971), it may consult with the lending authority to issue necessary orders.\n In case of a difference of opinion between the borrowing and lending authorities, the services of the government servant shall be returned to the lending authority.\n\nFollowing a disciplinary proceeding against a government servant on loan, the borrowing authority can take various actions based on its findings. If the borrowing authority decides on penalties specified in items (1) to (3) of rule 6 (Gujarat Civil Services (Discipline and Appeal) Rules, 1971), it may consult with the lending authority to issue necessary orders. For penalties specified in items (4) to (8) of rule 6 (Gujarat Civil Services (Discipline and Appeal) Rules, 1971), the borrowing authority returns the services of the government servant to the lending authority, transmitting the inquiry proceedings.\n\nIf the lending authority is the Disciplinary Authority, it may pass necessary orders on the case; if not, it can submit the case to the Disciplinary Authority.\n\nI hope this proves useful. Do you have any other inquiries or areas where I can offer assistance?"
        ]
      },
      {
        "tag": "officers_borrowed_from_central_gov",
        "patterns": [
          "Explain the provisions regarding government officers borrowed from the Central Government or other State Governments.",
          "How does the lending authority get informed when a government servant on loan faces suspension or disciplinary proceedings?"
        ],
        "responses": [
          "When an order of suspension is issued or a disciplinary proceeding is initiated against a Government servant whose services have been borrowed from the Central Government, other State Governments, or a related authority, certain procedural steps are outlined. First and foremost, the lending authority, i.e., the entity or government from which the services have been borrowed, must be promptly notified of the circumstances leading to the suspension or the commencement of the disciplinary proceeding (as per Rule 24 mentioned in Gujarat Civil Services (Discipline and Appeal) Rules, 1971).\n\nAs the disciplinary proceeding unfolds, the Disciplinary Authority holds the responsibility of deciding on the appropriate penalties based on the findings. If the Disciplinary Authority deems that penalties falling within the categories specified in items (1) to (3) of Rule 6(Gujarat Civil Services (Discipline and Appeal) Rules, 1971) are warranted, it may, after consultation with the lending authority, pass orders on the case as deemed necessary. However, should a difference of opinion arise between the borrowing and lending authorities, the services of the Government servant in question will be returned to the disposal of the lending authority.\n\nFurthermore, if the penalties considered by the Disciplinary Authority extend to those specified in items (4) to (8) of Rule 6 which are mentioned in Gujarat Civil Services (Discipline and Appeal) Rules, 1971, a distinct process comes into play. In such cases, the services of the Government servant are immediately replaced at the disposal of the lending authority, and the entire proceedings of the inquiry are transmitted to them for further action as they may deem fit\n\n Hope this information found helpful..",
          "The procedure concerning government officers whose services have been borrowed unfolds in a structured manner when disciplinary actions, such as suspension or proceedings, are initiated against them. Rule 24 mandates that the lending authority, which refers to the entity or government from which the services have been borrowed, must be promptly informed of the circumstances leading to the suspension or the commencement of the disciplinary proceeding.\n\nAs the disciplinary process progresses, the Disciplinary Authority plays a pivotal role in determining the appropriate penalties based on the inquiry's findings. If the penalties under consideration fall within the categories outlined in items (1) to (3) of Rule 6( Gujarat Civil Services (Discipline and Appeal) Rules, 1971 ), the Disciplinary Authority may, after consultation with the lending authority, issue necessary orders in response to the case. However, if there is a disagreement between the borrowing and lending authorities, the services of the Government servant will be returned to the lending authority's disposal.\n\nIn cases where the considered penalties extend to those specified in items (4) to (8) of Rule 6 (Gujarat Civil Services (Discipline and Appeal) Rules, 1971), a different course of action is taken. The services of the Government servant are promptly returned to the disposal of the lending authority, and the complete inquiry proceedings are transmitted to them for further action as they see fit. This comprehensive process ensures a fair and coordinated approach in dealing with disciplinary matters involving borrowed government officers.\n\n I hope this helps.",
          "In instances where a Government servant, whose services have been borrowed from the Central Government, other State Governments, or a related authority, faces suspension or disciplinary proceedings, a structured protocol is set in motion. Rule 24 stipulates that the lending authority, the entity or government lending the services, must be immediately informed of the circumstances surrounding the suspension or initiation of disciplinary actions.\n\nAs the disciplinary proceedings unfold, the Disciplinary Authority takes on the responsibility of deciding on appropriate penalties based on the findings. If the considered penalties fall within the categories specified in items (1) to (3) of Rule 6(Gujarat Civil Services (Discipline and Appeal) Rules, 1971), the Disciplinary Authority, after consultation with the lending authority, may pass orders as deemed necessary. However, any divergence of opinions between the borrowing and lending authorities triggers a provision whereby the services of the Government servant are reverted to the disposal of the lending authority.\n\nFurthermore, if the Disciplinary Authority deems that the penalties should extend to those specified in items (4) to (8) of Rule 6 which are mentioned in Gujarat Civil Services (Discipline and Appeal) Rules, 1971, a specific process is enacted. In such cases, the services of the Government servant are expeditiously returned to the lending authority's disposal, and the complete inquiry proceedings are transmitted to them for further action according to their discretion. This meticulous process ensures a transparent and coordinated approach in addressing disciplinary matters involving government officers whose services have been borrowed.\n\n I'm glad if this information is of help. Is there anything more you'd like assistance on?"
        ]
      },
      {
        "tag": "disciplinary_actions_for_borrowed_officers",
        "patterns": [
          "What actions can the Disciplinary Authority take based on the findings of a disciplinary proceeding for a government servant borrowed from another authority?",
          "Explain the steps the Disciplinary Authority follows after a disciplinary proceeding against a government servant borrowed from the Central Government or other State Governments.",
          "How does the Disciplinary Authority decide on penalties after a disciplinary proceeding for a borrowed government servant?"
        ],
        "responses": [
          "When a disciplinary proceeding is initiated or an order of suspension is issued against a government servant borrowed from another authority, such as the Central Government or a State Government, the lending authority must be promptly informed about the circumstances leading to the suspension or disciplinary action. This ensures transparency and communication between the borrowing and lending authorities.\n\nIn the event that the Disciplinary Authority, after conducting the disciplinary proceeding, determines that penalties specified in items (1) to (3) of rule 6 ( Gujarat Civil Services (Discipline and Appeal) Rules, 1971 ) should be imposed, it has the authority to pass orders on the case. This action is taken after consultation with the lending authority. However, in cases of disagreement between the borrowing and lending authorities, the services of the government servant are to be returned to the lending authority\n\n I hope this helps.",
          "Following the initiation of a disciplinary proceeding or suspension order against a government servant borrowed from another authority, the lending authority is promptly informed about the situation. This reporting mechanism ensures that the authority lending the services is aware of the developments in the disciplinary process.\n\n If, upon conclusion of the disciplinary proceeding, the Disciplinary Authority deems it necessary to impose penalties specified in items (1) to (3) of rule 6 which is mentioned in Gujarat Civil Services (Discipline and Appeal) Rules, 1971, it can do so after consulting with the lending authority. However, in cases where there is a disagreement between the borrowing and lending authorities, the services of the government servant are returned to the lending authority.",
          "In instances where a government servant, borrowed from another authority, faces disciplinary action or suspension, the lending authority is immediately notified of the circumstances surrounding the case. This notification ensures that the authority lending the services is kept informed about the developments in the disciplinary proceedings.Upon completion of the disciplinary proceeding, if the Disciplinary Authority decides that penalties specified in items (1) to (3) of rule 6(Gujarat Civil Services (Discipline and Appeal) Rules, 1971) should be imposed, it can take necessary actions after consulting with the lending authority. However, in cases of disagreement between the borrowing and lending authorities, the services of the government servant are to be returned to the lending authority. For penalties specified in items (4) to (8) of rule 6(Gujarat Civil Services (Discipline and Appeal) Rules, 1971), the services of the government servant are replaced at the disposal of the lending authority, and the inquiry proceedings are transmitted to it for further action."
        ]
      },
      {
        "tag": "orders_appeal_not_allowed",
        "patterns": [
          "Which orders are exempted from the appeal process?",
          "Explain the circumstances in which an appeal shall not lie against an order."
        ],
        "responses": [
          "Certain orders are exempted from the appeal process.\nNo appeal is allowed against orders of an interlocutory nature or those considered steps-in-aid for the final disposal of a disciplinary proceeding, excluding suspension orders.\nOrders passed by an inquiry authority during the course of an inquiry under rule 9 are also not appealable.\nAdditionally, orders issued by the High Level Committee under rule 11-A are not subject to appeal.\n\n I hope this helps🙂.",
          "Certain orders are exempted from the appeal process.\n No appeal is permitted against orders of an interlocutory nature or those considered steps-in-aid for the final disposal of a disciplinary proceeding, excluding suspension orders.\n Orders passed by an inquiry authority during the course of an inquiry under rule 9 are also not appealable. Additionally, orders issued by the High Level Committee under rule 11-A are not subject to appeal.\n\n I hope this information found helpful."
        ]
      },
      {
        "tag": "orders_appeal_allowed",
        "patterns": [
          "Which orders can a government servant appeal against?",
          "circumstances under which a government servant can file an appeal?",
          "What are the appealable orders for a government servant?"
        ],
        "responses": [
          "A government servant may prefer an appeal against the following orders:\n\n- An order of suspension made or deemed to have been made under rule 5 (Gujarat Civil Services (Discipline and Appeal) Rules, 1971).\n- An order imposing any of the penalties specified in rule 6, whether made by the Disciplinary Authority or any appellate or reviewing authority.\n- An order enhancing any penalty imposed under rule 6 Gujarat Civil Services (Discipline and Appeal) Rules, 1971.\n- An order that denies or varies to the disadvantage of the government servant's pay, allowances, pension, or other conditions of service.\n- An order discharging the government servant from service or having the effect of his non-promotion to a higher post or non-confirmation in service.\n- An order stopping him at the efficiency bar, reverting him while officiating in a higher service, grade, or post (other than as a penalty), reducing or withholding the pension, or denying the maximum pension admissible.\n- An order determining subsistence and other allowances during suspension.\n- An order determining pay and allowances for specific periods.\nAppeals may be directed to different authorities based on the nature of the order.\n- An appeal against an order reducing or withholding the pension or denying the maximum pension admissible lies only to the Government.\n- Appeals from a decision of an officer in appeal or an order in a common proceeding held under rule 13 have specific authorities to which they can be directed.\n- An appeal to the State Government is possible from an order passed by an officer or authority immediately subordinate to the State Government.\n\nIt's important to note that the term 'government servant' includes a person who has ceased to be in government service, and 'pension' includes additional pension, gratuity, and any other retirement benefit.\n\n I'm glad if this information is of help. Is there anything more you'd like assistance on?",
          "A government servant may file an appeal against the following orders:\n\nAn order of suspension made or deemed to have been made under rule 5 (Gujarat Civil Services (Discipline and Appeal) Rules, 1971).\nAn order imposing any of the penalties specified in rule 6, whether made by the Disciplinary Authority or any appellate or reviewing authority.\n An order enhancing any penalty imposed under rule 6 Gujarat Civil Services (Discipline and Appeal) Rules, 1971.\n An order that denies or varies to the disadvantage of the government servant's pay, allowances, pension, or other conditions of service.\n An order discharging the government servant from service or having the effect of his non-promotion to a higher post or non-confirmation in service.\n An order stopping him at the efficiency bar, reverting him while officiating in a higher service, grade, or post (other than as a penalty), reducing or withholding the pension, or denying the maximum pension admissible.\n An order determining subsistence and other allowances during suspension\n An order determining pay and allowances for specific periods.\n\nAppeals may be directed to different authorities based on the nature of the order:\n An appeal against an order reducing or withholding the pension or denying the maximum pension admissible lies only to the Government.\n Appeals from a decision of an officer in appeal or an order in a common proceeding held under rule 13 have specific authorities to which they can be directed.\n An appeal to the State Government is possible from an order passed by an officer or authority immediately subordinate to the State Government.\n\n It's important to note that the term 'government servant' includes a person who has ceased to be in government service, and 'pension' includes additional pension, gratuity, and any other retirement benefit.\n\nI'm happy if this information is of help. Is there anything more you'd like assistance on?"
        ]
      },
      {
        "tag": "appeal_period_limitation",
        "patterns": [
          " the period of limitation for appeals?",
          "Can you provide information about the time limit for submitting an appeal?",
          "Explain the period within which an appeal must be submitted."
        ],
        "responses": [
          "No appeal under this part shall be entertained unless it is submitted within a period of 45 days from the date on which the appellant receives a copy of the order appealed against.\nHowever, the appellate authority may entertain the appeal after the expiry of the said period if it is satisfied that the appellant had sufficient cause for not submitting the appeal in time.\n\n I hope this helps.",
          "No appeal under this part shall be entertained unless it is submitted within a period of 45 days from the date on which the appellant receives a copy of the order appealed against.\nProvided that the appellate authority may entertain the appeal after the expiry of the said period, if it is satisfied that the appellant had sufficient cause for not submitting the appeal in time.\n\n I hope this information found helpful."
        ]
      },
      {
        "tag": "appeal_form_contents",
        "patterns": [
          "What are the requirements for the form and contents of an appeal?",
          "Can you explain how to prepare an appeal?",
          "Tell me about the form and contents of appeals.",
          "What should be included in an appeal?"
        ],
        "responses": [
          "(1) Every person preferring an appeal must do so separately and in their own name.\n\n(2) The appeal shall be presented to the authority to whom the appeal lies, and a copy thereof forwarded by the appellant to the authority that made the order appealed against. It should contain all material statements and arguments on which the appellant relies, should not contain any disrespectful or improper language, and should be complete in itself.\n\n(3) The authority that made the order appealed against shall, on receipt of a copy of the appeal, forward the same together with the relevant records to the appellate authority without any avoidable delay and without waiting for any direction from the appellate authority.n\n\nI hope this information found helpful.",
          "(1) Every person preferring an appeal do so separately and in his own name. \n(2) The appeal shall be presented to the authority to whom the appeal lies, and a copy thereof forwarded by the appellant to the authority which made the order appealed against. It shall contain all material statements and arguments on which the appellant relies, shall not contain any disrespectful or improper language, and shall be complete itself. \n(3) The authority which made the order appealed against shall on receipt of a copy of the appeal, forward the same together with the relevant records to the appellate authority without any avoidable delay, and without waiting for any direction from the appellate authority.\n\n I hope this Helps."
        ]
      },
      {
        "tag": "consideration_of_appeals",
        "patterns": [
          "How are appeals considered?",
          "What factors are considered in the appeal process?",
          "consideration of appeals."
        ],
        "responses": [
          "(1) In the case of an appeal against an order of suspension, the appellate authority shall assess whether, considering the provisions of rule 5 and the circumstances of the case, the order of suspension is justified. It will confirm or revoke the order accordingly.\n\n(2) In the case of an appeal against an order imposing any of the penalties specified in rule 6 (Gujarat Civil Services (Discipline and Appeal) Rules, 1971) or enhancing any penalty under the said rule, the appellate authority shall consider: \n   (a) compliance with the prescribed procedure, \n     (b) any resulting material irregularity or illegality causing miscarriage of justice, \n   (c) justification of findings, and \n   (d) the adequacy of the penalty. After consultation with the Commission, if necessary, the appellate authority shall pass orders, such as setting aside, reducing, confirming, or enhancing the penalty. It may also remit the case for further inquiry with specific directions.\n\n(3) In the case of an appeal against any order specified in rule 14 (Gujarat Civil Services (Discipline and Appeal) Rules, 1971), the appellate authority shall consider all the circumstances of the case and pass orders deemed just and equitable.\n\nI hope this helps🙂.",
          "Consideration of appeals: \n(1) In the case of an appeal against an order of suspension, the appellate authority shall assess the justification of the suspension order in light of rule 5 provisions and the case's circumstances, confirming or revoking the order accordingly. \n\n(2) For appeals against penalties specified in rule 6 or penalty enhancements, the appellate authority shall consider compliance with procedural rules, assess material irregularities or illegalities, examine the justification of findings, and evaluate the adequacy of the imposed penalty. After consultation with the Commission if necessary, it can set aside, reduce, confirm, enhance the penalty, or remit the case for further inquiry with directions. \n Provided that the appellate authority must not enhance the penalty beyond its or the authority that issued the appealed order's competency, must afford the appellant an opportunity to represent against the enhanced penalty, and if the proposed penalty is in items (4) to (8) of rule 6 without a prior rule 9 inquiry, it should hold or direct an inquiry according to rule 8 (Gujarat Civil Services (Discipline and Appeal) Rules, 1971). \n\n(3) In appeals against orders specified in rule 14, the appellate authority shall consider all case circumstances and pass just and equitable orders.\n\n Hope this helps.",
          "Consideration of appeals:\n(1) Assessing suspension justifiability, the appellate authority confirms or revokes based on rule 5 (Gujarat Civil Services (Discipline and Appeal) Rules, 1971) and case circumstances.\n\n(2) For penalties under rule 6 (Gujarat Civil Services (Discipline and Appeal) Rules, 1971), it reviews compliance, irregularities, findings' justification, and penalty adequacy, with options to set aside, reduce, confirm, enhance, or remit the case for further inquiry, considering: \n(a) Compliance with procedural rules\n(b) Assessment of non-compliance impact\n(c) Justification of findings\n(d) Evaluation of penalty adequacy\n\n(3) Appeals against rule 14 orders prompt the appellate authority to consider all case circumstances for just and equitable decisions\n\n I hope this information found helpful."
        ]
      },
      {
        "tag": "government_power_to_review",
        "patterns": [
          "government's power to review.",
          "What authority does the government have in reviewing orders?",
          "How does the government review orders?",
          "Can the government modify or set aside orders?"
        ],
        "responses": [
          "Notwithstanding anything contained in these rules, the Government may, on its own motion or otherwise, review any order passed by any authority made or appealable under these rules. After calling for the record of the case and consulting with the Commission, it may: (a) confirm, modify, or set aside the order; (b) impose or alter penalties; (c) remit the case for further action or inquiry; or (d) pass any other order deemed fit.\n\nThe Government's review may include setting aside, reducing, confirming, enhancing penalties, or modifying the order as necessary. If proposing penalties specified in items (4) to (8) of rule 6 Gujarat Civil Services (Discipline and Appeal) Rules, 1971 without a prior inquiry under rule 9, the Government shall conduct an inquiry or direct someone to do so before making a decision.\n\nThe Government shall not review orders or decisions related to a specified Civil Servant under the Gujarat Civil Services Tribunal Act, 1972, in cases where an appeal lies to the Gujarat Civil Services Tribunal against such orders or decisions.\n\n I hope this information Helps.",
          "Notwithstanding anything contained in these rules, the Government may, after calling for the record of the case, review any order made or appealable under these rules. It may:\n(a) Confirm, modify, or set aside the order.\n(b) Impose, set aside, reduce, confirm, or enhance the penalty imposed by the order.\n(c) Remit the case for further action or inquiry.\n(d) Pass any other order deemed fit.\nProvided that:\n(i) An order imposing or enhancing a penalty requires the person's opportunity for representation.\n(ii) If the Government proposes penalties in items (4) to (8) of rule 6(Gujarat Civil Services (Discipline and Appeal) Rules, 1971)without an inquiry under rule 9, it shall hold or direct an inquiry under rule 9 and pass orders after considering the proceedings.\n(iii) The Government shall not review orders or decisions for specified Civil Servants under the Gujarat Civil Services Tribunal Act, 1972, where an appeal lies to the Gujarat Civil Services Tribunal.\n\n I hope this helps."
        ]
      },
      {
        "tag": "SHPC",
        "patterns": [
          "what is Full form of SHPC.",
          "Full name of SHPC"
        ],
        "responses": [
          "Full form of SHPC is Sexual Harassment Prevention Committee.",
          "Sexual Harassment Prevention Committee."
        ]
      },
      {
        "tag": "review_of_orders_disciplinary_cases",
        "patterns": [
          "review of orders in disciplinary cases.",
          "What is the process for reviewing orders in disciplinary cases?"
        ],
        "responses": [
          "The authority to which an appeal against an order imposing any of the penalties specified in rule 6 lies may, on its own motion or otherwise, review any order passed in such a case. After calling for the record of the proceeding and consulting with the Commission when necessary, the authority may pass orders as if the government servant had appealed against such order.\nThe review process allows the authority to reconsider and take necessary actions on orders imposing penalties specified in rule 6. Consultation with the Commission may be required in certain cases.\n\nYes, the authority has the power to review an order imposing any of the penalties specified in rule 6(Gujarat Civil Services (Discipline and Appeal) Rules, 1971).\nIt's important to note that no action under this rule shall be taken after the expiry of a period of more than six months from the date of such order.\n\n I Hope this helps.",
          "The authority to which an appeal against an order imposing any of the penalties specified in rule 6 lies may, of its own motion or otherwise, call for the record of any  proceeding under these rules and review any order passed in such a case and, may,after consultation with the Commission where such consultation is necessary, pass such orders as it deems fit as if the Government servant had preferred an appeal against such order;\n   that no action under this rule shall be taken after the expiry of a period of more than six months from the date of such order\nI Hope this helps."
        ]
      },
      {
        "tag": "review_by_government",
        "patterns": [
          "conditions for the government to review its own order.",
          "Under what circumstances can the government review its own order?",
          "What is the procedure for the government to review its own order?",
          "Tell me about the limitations and considerations in the government's review process."
        ],
        "responses": [
          "The Government may review its own order under the following conditions: (i) if there is some error apparent on the face of the record, or (ii) if there are other sufficient reasons for review. However, the penalty imposed on a Government servant shall not be enhanced without providing an opportunity for the government servant to show cause against such enhancement.\nThe government can review its own order if there is an error on the face of the record or for other sufficient reasons. Any enhancement of the penalty requires the government servant to be given an opportunity to present reasons against the enhancement.\nThe procedure for the government to review its own order involves ensuring that the penalty is not enhanced without giving the government servant a chance to show cause. Additionally, the review process must follow the procedure laid down in rule 9 if changing penalties from items (1) to (3) to items (4) to (8) of rule 6(Gujarat Civil Services (Discipline and Appeal) Rules, 1971).\nProceedings of review under this rule cannot commence until after either the expiry of the period of limitation for an appeal or the disposal of the appeal, if one has been preferred.\n\n I hope this information found helpful.",
          "The Government may review its order under two conditions: (i) in case of an apparent error on the face of the record or (ii) if there are sufficient reasons. However, any enhancement of the penalty for a Government servant requires providing an opportunity for the servant to show cause against the enhancement.\n The review process includes adherence to the rule 9 procedure when changing penalties from items (1) to (3) to items (4) to (8) of rule 6 (Gujarat Civil Services (Discipline and Appeal) Rules, 1971). Review proceedings cannot commence until after the expiry of the appeal period or the disposal of any preferred appeal\n\nI hope this helps."
        ]
      },
      {
        "tag": "power_to_relax_time_limit",
        "patterns": [
          "Explain the authority's power to relax time limits in these rules.",
          "Can the authority condone delays in specific cases?",
          "Tell me about the provisions for extending time limits and condoning delays in these rules."
        ],
        "responses": [
          "The authority competent under these rules has the power to relax time limits for good and sufficient reasons. If there is a valid and justifiable cause, the authority may extend the time specified in these rules for anything required to be done. Additionally, the authority can condone any delay if sufficient cause is shown.\nThe authority is empowered to extend the time specified in these rules when there are good and sufficient reasons. It can also condone delays if there is sufficient cause shown for the delay.\nUnder these rules, the authority competent to make orders has the discretion to extend time limits for valid reasons. If there is a sufficient cause presented, the authority may also condone delays.\nProvisions in these rules allow the authority to extend time limits and condone delays for good and sufficient reasons or if sufficient cause is shown. This flexibility is provided to ensure fairness and accommodate exceptional circumstances.\n\nI hope this helps.",
          "The authority authorized by these regulations possesses the ability to grant extensions to time limits for valid and justifiable reasons. If there is a legitimate and reasonable cause, the authority can prolong the specified timeframes outlined in these regulations. Moreover, the authority has the discretion to excuse any delays if sufficient cause is demonstrated.\nThe competent authority, as per these rules, is capable of extending time limits for valid reasons and may also excuse delays if a satisfactory cause is presented. These rules afford the authority the flexibility to extend timeframes and overlook delays to uphold fairness and accommodate exceptional circumstances.\nThe authority mandated by these rules has the discretion to extend time limits for valid reasons and may also condone delays if sufficient cause is demonstrated. These provisions aim to ensure fairness and adaptability in dealing with exceptional situations.\nIn adherence to these rules, the authority with the power to make decisions can exercise its discretion to extend time limits for valid reasons, and it has the option to excuse delays if there is sufficient cause. This flexibility is designed to promote fairness and accommodate unforeseen circumstances.\n\n I'm glad if this information is of help. Is there anything more you'd like assistance on?"
        ]
      },
      {
        "tag": "supply_of_commission_advice",
        "patterns": [
          "Explain the procedure for supplying a copy of the Commission's advice under rules.",
          "supply of copy of commission advice",
          "Tell me about the requirement to furnish a copy of the Commission's advice to the Government servant."
        ],
        "responses": [
          "   In cases where the Commission is consulted as per these rules, a copy of the advice by the Commission is furnished to the Government servant. Additionally, if the advice has not been accepted, a brief statement of the reasons for non-acceptance is also provided. This information is given along with a copy of the order passed in the case by the authority making the order.\nWhen the Commission is consulted according to these rules, the Government servant is supplied with a copy of the Commission's advice. If the advice is not accepted, a brief statement outlining the reasons for non-acceptance is also provided. This information is given along with a copy of the order passed by the authority making the decision.\nUnder these rules, when the Commission is consulted, the Government servant is entitled to receive a copy of the Commission's advice. If the advice is not accepted, a brief statement explaining the reasons for non-acceptance is also furnished. This information is provided along with a copy of the order issued by the authority making the decision.\nThe procedure for supplying a copy of the Commission's advice is as follows: when the Commission is consulted as specified in these rules, the Government servant receives a copy of the Commission's advice. If the advice is not accepted, a brief statement detailing the reasons for non-acceptance is also supplied. This information is given along with a copy of the order made by the authority in the case.\n\n I hope this information found helpful.",
          "   In instances where the Commission is consulted per these regulations, the Government servant is given a copy of the Commission's advice, and if the advice is not accepted, a brief statement elucidating the reasons for non-acceptance is provided. This information is furnished alongside a copy of the order issued by the decision-making authority.\n When the Commission is consulted as outlined in these rules, the Government servant is provided with a copy of the Commission's advice, and in cases of non-acceptance, a concise statement detailing the reasons for rejection is also supplied. This information is presented along with a copy of the decision-making authority's order.\n According to these rules, when the Commission is consulted, the Government servant is entitled to receive a copy of the Commission's advice, and if not accepted, a brief statement elucidating the reasons for non-acceptance is also given. This information is provided alongside a copy of the decision-making authority's order.\n  The process for providing a copy of the Commission's advice involves, as specified in these rules, furnishing the Government servant with a copy of the Commission's advice. In instances of non-acceptance, a brief statement outlining the reasons for rejection is also provided. This information is conveyed alongside a copy of the order made by the decision-making authority.\n\n I hope this helps."
        ]
      },
      {
        "tag": "repeal_and_saving",
        "patterns": [
          "provisions related to repeal and saving",
          "rule related to repeal and saving",
          "Tell me about the impact of the repeal on previous rules and orders.",
          "What rights are preserved under the repeal and saving provisions in the rules?"
        ],
        "responses": [
          "The provisions related to repeal and saving in Gujarat Civil Services (Discipline and Appeal) Rules, 1971 are as follows:\n\n1. Any rule corresponding to these rules in force immediately before the commencement of these rules and applicable to the Government servants to whom these rules apply is hereby repealed. However:\n   (a) This repeal does not affect the previous operation of the said rules or anything done or any action taken thereunder.\n   (b) Any order passed under the rules hereby repealed shall, to the extent it is not inconsistent with these rules, be deemed to have been passed under these rules.\n   (c) Any proceedings under the said rules pending at the commencement of these rules shall be continued and disposed of, as far as possible, in accordance with the provisions of these rules.\n\n2. Nothing in these rules operates to deprive any person to whom these rules apply of any right of appeal that had accrued to him under the rules hereby repealed in respect of any order passed before the commencement of these rules. Such a right, if not exercisable under these rules, is exercisable as if the rules referred to in sub-rule (1) had not been repealed.\n\n3. An appeal pending at or preferred after the commencement of these rules against an order made before such commencement shall be considered and orders thereon shall be passed in accordance with these rules.\n\n I'm glad if this information is of help. Is there anything more you'd like assistance on?",
          "The provisions related to repeal and saving in the Gujarat Civil Services (Discipline and Appeal) Rules, 1971 are outlined as follows:\n\n1. Any rule corresponding to these rules in force immediately before the commencement of these rules and applicable to the Government servants covered by these rules is repealed. However:\n   (a) This repeal does not affect the previous operation of the said rules or anything done or any action taken thereunder.\n   (b) Any order passed under the rules hereby repealed is deemed to have been passed under these rules, to the extent it is not inconsistent with them.\n   (c) Any proceedings under the said rules pending at the commencement of these rules are continued and disposed of, as far as possible, in accordance with the provisions of these rules.\n\n2. Nothing in these rules deprives any person covered by these rules of any right of appeal that had accrued to him under the rules hereby repealed in respect of any order passed before the commencement of these rules. Such a right, if not exercisable under these rules, is exercisable as if the rules referred to in sub-rule (1) had not been repealed.\n\n3. An appeal pending at or preferred after the commencement of these rules against an order made before such commencement is considered, and orders thereon are passed in accordance with these rules.\n\n I'm glad if this information is of help. Is there anything more you'd like assistance on?",
          "The provisions related to repeal and saving in Gujarat Civil Services (Discipline and Appeal) Rules, 1971  are:\n\n1. Any rule corresponding to these rules in force immediately before the commencement of these rules and applicable to the Government servants to whom these rules apply is repealed. However:\n   (a) This repeal does not affect the previous operation of the said rules or anything done or any action taken thereunder.\n   (b) Any order passed under the rules hereby repealed is deemed to have been passed under these rules, to the extent it is not inconsistent with them.\n   (c) Any proceedings under the said rules pending at the commencement of these rules are continued and disposed of, as far as possible, in accordance with the provisions of these rules.\n\n2. Nothing in these rules operates to deprive any person to whom these rules apply of any right of appeal that had accrued to him under the rules hereby repealed in respect of any order passed before the commencement of these rules. Such a right, if not exercisable under these rules, is exercisable as if the rules referred to in sub-rule (1) had not been repealed.\n\n3. An appeal pending at or preferred after the commencement of these rules against an order made before such commencement is considered, and orders thereon are passed in accordance with these rules.\n\n I hope this information serves your needs. Is there any other way I can assist you?",
          "The provisions related to repeal and saving in Gujarat Civil Services (Discipline and Appeal) Rules, 1971 are:\n\n1. Any rule corresponding to these rules in force immediately before the commencement of these rules and applicable to the Government servants to whom these rules apply is hereby repealed. However:\n   (a) This repeal does not affect the previous operation of the said rules or anything done or any action taken thereunder.\n   (b) Any order passed under the rules hereby repealed is deemed to have been passed under these rules, to the extent it is not inconsistent with them.\n   (c) Any proceedings under the said rules pending at the commencement of these rules are continued and disposed of, as far as possible, in accordance with the provisions of these rules.\n\n2. Nothing in these rules deprives any person to whom these rules apply of any right of appeal that had accrued to him under the rules hereby repealed in respect of any order passed before the commencement of these rules. Such a right, if not exercisable under these rules, is exercisable as if the rules referred to in sub-rule (1) had not been repealed.\n\n3. An appeal pending at or preferred after the commencement of these rules against an order made before such commencement is considered, and orders thereon are passed in accordance with these rules.\n\n I'm here to assist. Is there anything else you'd like information or help with?"
        ]
      },
      {
        "tag": "removal_of_doubts",
        "patterns": [
          "Explain the provisions related to the removal of doubts",
          "Removal of doubts in Gujarat Civil Services",
          "What happens when there is a doubt about the Head of an office or the hierarchy of authorities?",
          "How is doubt regarding the interpretation of provisions resolved under the rules?"
        ],
        "responses": [
          "The provisions related to the removal of doubts in these rules are as follows:\n\nWhere a doubt arises as to who is the Head of any office or as to whether any authority is subordinate to or higher than any other authority or as to the interpretation of any of the provisions of these rules, the matter shall be referred to the Government. The decision of the Government on such matters shall be final.",
          "In case of any doubt about the Head of any office, the hierarchy of authorities, or the interpretation of any provision in these rules, the matter is referred to the Government. The decision of the Government on such matters is final.",
          "The rules outline the following provisions regarding the removal of doubts:\n\nWhere a doubt arises as to who is the Head of any office or as to whether any authority is subordinate to or higher than any other authority or as to the interpretation of any of the provisions of these rules, the matter shall be referred to the Government. The decision of the Government on such matters shall be final.",
          "If there is a doubt about who is the Head of any office, the hierarchy of authorities, or the interpretation of any provision in these rules, the matter is referred to the Government for resolution. The decision of the Government on such matters is considered final."
        ]
      },
      {
        "tag": "minor_penalties_procedure",
        "patterns": [
          "Explain the procedure for imposing minor penalties on a Government servant.",
          "What are the steps involved in passing orders for minor penalties?",
          "How is an inquiry conducted for minor penalties?",
          "Minor penalties procedure?"
        ],
        "responses": [
          "The procedure for imposing minor penalties on a Government servant, as per the rules, involves the following steps:\n\n1. Informing the Government servant in writing of the proposal to take action against him, specifying the imputation of misconduct or misbehavior.\n2. Giving the Government servant a reasonable opportunity to make representations against the proposal.\n3. Holding an inquiry if the Disciplinary Authority deems it necessary.\n4. Taking into consideration the representations made by the Government servant and the inquiry records.\n5. Recording a finding on each imputation of misconduct or misbehavior.\n6. Consulting the Commission when necessary.\n\nAdditionally, if the proposal involves withholding increments of pay with adverse effects on pension or for a period exceeding three years, an inquiry must be held before imposing such penalties.\n\n Hopefully, this provides some support.",
          "The process for imposing minor penalties on a Government servant includes informing the individual of the proposed action, providing an opportunity for representation, conducting an inquiry if required, considering representations and inquiry records, recording findings on each imputation, and consulting the Commission when necessary. \nIf the penalty involves withholding increments of pay affecting pension or exceeding three years, a separate inquiry is mandated.\n\n I trust this proves beneficial.",
          "To impose minor penalties on a Government servant, the following steps are followed:\n\n1. Inform the Government servant in writing of the proposal, specifying the imputation of misconduct or misbehavior.\n2. Allow the Government servant to make representations.\n3. Conduct an inquiry if deemed necessary by the Disciplinary Authority.\n4. Consider the representations and inquiry records.\n5. Record findings on each imputation.\n6. Consult the Commission when required.\n\nFor penalties like withholding increments with adverse pension effects or exceeding three years, a separate inquiry is mandatory.\n\n I believe this will be of assistance.",
          "The procedure for imposing minor penalties on a Government servant includes:\n\n1. Informing the individual in writing about the proposed action and specifying the imputation of misconduct.\n2. Providing an opportunity for the Government servant to make representations.\n3. Conducting an inquiry if deemed necessary.\n4. Considering the representations and inquiry records.\n5. Recording findings on each imputation.\n6. Consulting the Commission when necessary.\n\nFor penalties involving withholding increments with significant effects on pension or exceeding three years, a separate inquiry is mandated.\n\n I hope this helps."
        ]
      },
      {
          "tag": "Secretary",
          "patterns": ["Who is included in the term 'Secretary' in the rules?",
                       "Secretary",
                       "What is role of Secretary?",
                       "Who is Secretary"],
          "responses": [" 'Secretary' includes Chief Secretary, Principal Secretary, and Additional Chief Secretary.\n\n The term 'Secretary' in the context rules to a high-level administrative official who assists the Minister-in-Charge in managing a particular department or ministry. Secretaries play a crucial role in the functioning of the government by providing expert advice, coordinating activities, and ensuring the implementation of government policies.\n\n According to the Gujarat Government Rules the Secretary is responsible for the following duties:\n\n1. Advising the Minister-in-Charge: The Secretary acts as a key advisor to the Minister-in-Charge, providing insights on policy matters, administrative issues, and departmental operations.\n\n2. Coordinating Departmental Activities: The Secretary oversees the day-to-day functioning of the department, ensuring smooth coordination among various branches and sections.\n\n3. Implementing Government Policies: The Secretary is responsible for translating government policies into actionable plans and ensuring their effective implementation within the department.\n\n4. Monitoring Departmental Performance: The Secretary regularly monitors the performance of the department, identifying areas for improvement and taking corrective actions.\n\n5. Managing Financial Resources: The Secretary oversees the financial management of the department, ensuring efficient utilization of funds and adherence to budgetary guidelines.\n\n6. Liaising with Other Departments: The Secretary acts as a liaison between the department and other government agencies, facilitating collaboration and information exchange.\n\n7. Maintaining Records and Documentation: The Secretary ensures the proper maintenance of departmental records, documents, and correspondence.\n\n8. Enforcing Rules and Regulations: The Secretary upholds the department's compliance with relevant laws, rules, and regulations.\n\n In essence, the Secretary serves as the administrative backbone of a department or ministry, working closely with the Minister-in-Charge to achieve the department's objectives and contribute to the overall functioning of the Gujarat government\n\n I hope this proves useful. Do you have any other inquiries or areas where I can offer assistance?",
      "The term 'Secretary' encompasses the Chief Secretary, Principal Secretary, and Additional Chief Secretary.\n\nIn the context of the rules, a 'Secretary' refers to a high-ranking administrative official who assists the Minister-in-Charge in overseeing a specific department or ministry. Secretaries play a pivotal role in government functioning by offering expert advice, coordinating activities, and ensuring the implementation of government policies.\n\nAs per the Gujarat Government Rules, the Secretary is entrusted with various responsibilities, including:\n\n1. Advising the Minister-in-Charge: Providing key insights on policy matters, administrative issues, and departmental operations.\n\n2. Coordinating Departmental Activities: Overseeing the day-to-day functioning and ensuring smooth coordination among different branches and sections.\n\n3. Implementing Government Policies: Translating government policies into actionable plans and ensuring effective implementation within the department.\n\n4. Monitoring Departmental Performance: Regularly assessing departmental performance, identifying areas for improvement, and taking corrective actions.\n\n5. Managing Financial Resources: Overseeing financial management, ensuring efficient fund utilization, and adhering to budgetary guidelines.\n\n6. Liaising with Other Departments: Acting as a liaison between the department and other government agencies to facilitate collaboration and information exchange.\n\n7. Maintaining Records and Documentation: Ensuring proper maintenance of departmental records, documents, and correspondence.\n\n8. Enforcing Rules and Regulations: Upholding the department's compliance with relevant laws, rules, and regulations.\n\nIn essence, the Secretary serves as the administrative backbone of a department or ministry, collaborating closely with the Minister-in-Charge to achieve departmental objectives and contribute to the overall functioning of the Gujarat government.\n\n I trust this was helpful. Is there anything else I can support you with at the moment?"]
      },
      {
        "tag" : "Leave_rule",
        "patterns":[
          "Leave application",
          "Leave rule in Gujarat",
          "Procedure for Applying for Leave",
          "Explain various types of leave"
        ],
        "responses":[
          "The leave rules for government employees in Gujarat are governed by the Gujarat Civil Services Rules (GCSR), 2002. These rules provide for various types of leave, including casual leave, earned leave, medical leave, study leave, and leave for other purposes.\n\nCasual Leave\n   Casual leave is granted for short periods of absence due to illness, personal reasons, or other urgent causes. Government employees are entitled to 15 days of casual leave per year. This leave can be availed of at the convenience of the employee, but prior sanction from the appropriate authority is required.\n\nEarned Leave\n   Earned leave is granted for longer periods of absence, such as rest and recuperation after illness or for personal reasons. Government employees are entitled to 30 days of earned leave per year. This leave can be accumulated up to a maximum of 120 days.\n\nMedical Leave\n    Medical leave is granted for absence due to illness or injury. Government employees are entitled to medical leave on production of a medical certificate from a registered medical practitioner. The duration of medical leave is determined by the severity of the illness or injury.\n\nStudy Leave\n   Study leave is granted to government employees who are pursuing higher education. The duration of study leave is determined by the course of study and the employee's performance in the examinations.\n\nLeave for Other Purposes\n   Leave for other purposes may be granted for special reasons, such as maternity leave, paternity leave, bereavement leave, and leave for attending national or international competitions. The duration of this leave is determined by the appropriate authority.\n\nProcedure for Applying for Leave\n   Government employees are required to apply for leave in the prescribed form to the appropriate authority. The application should be accompanied by a medical certificate, if applicable. The leave sanctioning authority will consider the application and grant leave as per the relevant rules.\n\nLeave Encashment\n    Government employees can encash a portion of their unutilized earned leave at the time of retirement. The amount of leave that can be encashed is determined by the employee's length of service.\n\n If there's anything else on your mind, feel free to ask. I'm here to provide assistance.",
          "The leave rules for government employees in Gujarat are governed by the Gujarat Civil Services Rules (GCSR), 2002. These rules specify the different types of leave available to employees, the eligibility criteria for each type of leave, and the procedures for applying for leave.\n\nTypes of Leave\nThe GCSR outlines the following types of leave:\n   1. Earned Leave (EL): EL is granted to employees based on their length of service. Employees can accumulate up to 30 days of EL in a year, and they can carry forward up to 90 days of EL from one year to the next. EL can be used for any purpose, including rest, sickness, or personal reasons.\n    2. Casual Leave (CL): CL is granted to employees to meet unforeseen or urgent situations. Employees can avail of up to 10 days of CL in a year. CL cannot be carried forward from one year to the next.\n    3. Half Pay Leave (HPL): HPL is granted to employees who are unable to attend work due to ill health. Employees can avail of up to 60 days of HPL in a year. HPL is paid at half the employee's regular salary.\n   4. Sick Leave (SL): SL is granted to employees who are suffering from prolonged or chronic ill health. Employees can avail of up to 150 days of SL in their entire career. SL is paid at half the employee's regular salary.\n    5. Study Leave: Study leave is granted to employees who are pursuing higher education. Employees can avail of up to 12 months of study leave in their entire career. Study leave is paid at full salary.\n    6. pecial Leave: Special leave is granted to employees for exceptional circumstances, such as natural calamities or family emergencies. The duration of special leave is determined by the competent authority. Special leave is paid at full salary.\n\nEligibility Criteria\n   The eligibility criteria for each type of leave is specified in the GCSR. For example, to be eligible for EL, an employee must have completed one year of service. To be eligible for CL, an employee must be on duty and in a fit state to work. To be eligible for HPL, an employee must produce a medical certificate from a registered medical practitioner.\n\nProcedures for Applying for Leave\n   Employees must apply for leave in the prescribed form to their competent authority. The competent authority will review the application and grant leave if the employee meets the eligibility criteria and the leave is justified.\n\n If there's anything else on your mind, feel free to ask. I'm here to provide assistance."
        ]
      }
  ]
}
