{
    "intents": [
        {
            "tag": "publication_of_Gujarat Government Rules of Business,",
            "patterns": ["When were the Gujarat Government Rules of Business, 1990, published?", 
                         "Tell me about the publication date of the Business rules of Gujarat Government."],
            "responses": ["The Gujarat Government Rules of Business, 1990, were published on 11th March, 1990."]
        },
        {
            "tag": "article 166",
            "patterns": ["What is article 166 of the Constitution of India?",
                         "Article 166",
                         "Tell me about the article 166 of Constitution of India."],
            "responses":["Article 166 of the Constitution of India deals with the conduct of business of the Government of a State. It states that:\n\n• All executive action of the Government of a State shall be expressed to be taken in the name of the Governor. This means that all decisions made by the government, such as issuing orders, making appointments, and entering into contracts, must be made in the name of the Governor.\n\n• Orders and other instruments made and executed in the name of the Governor shall be authenticated in such manner as may be specified in rules to be made by the Governor. This means that the Governor must make rules that specify how orders and other documents made in his name are to be signed and stamped. The validity of an order or instrument which is so authenticated shall not be called in question on the ground that it is not an order or instrument made or executed by the Governor.\n\n• In other words, Article 166 provides that the Governor is the nominal head of the government, but the real power to make decisions rests with the Council of Ministers. This is because the Governor is bound by the advice of the Council of Ministers, and he cannot act independently of them.\n\nArticle 166 is important because it helps to ensure that the government is accountable to the people. The Governor is a public figure who can be held accountable for the actions of the government, and this helps to prevent the abuse of power.\n\n I hope this helps 🙂!",
                         "Article 166 of the Constitution of India deals with the conduct of business of the Government of a State. It states that:\n\n• All executive action of the Government of a State shall be expressed to be taken in the name of the Governor. This means that all official decisions and actions taken by the state government must be done in the name of the Governor, even though they are actually made and executed by the Council of Ministers.\n\n • Orders and other instruments made and executed in the name of the Governor shall be authenticated in such manner as may be specified in rules to be made by the Governor. This means that the Governor must make rules that specify how official documents, such as orders and notifications, are to be signed and sealed. These rules help to ensure that only genuine official documents are circulated.\n\n• The validity of an order or instrument which is so authenticated shall not be called in question on the ground that it is not an order or instrument made or executed by the Governor. This means that if an official document is properly authenticated, it is legally binding even if it was not personally signed or sealed by the Governor.\n\n The purpose of Article 166 is to ensure that the Governor, as the head of the state government, is accountable for all executive actions taken by the state government. This is important because the Governor is appointed by the President of India, and the President is elected by the people of India. Therefore, the Governor is ultimately accountable to the people of India for the actions of the state government.\n\n Article 166 also helps to maintain a clear distinction between the roles of the Governor and the Council of Ministers. The Governor is the constitutional head of the state government, while the Council of Ministers is responsible for the day-to-day administration of the state. By requiring that all executive actions be taken in the name of the Governor, Article 166 helps to ensure that the Governor is not overshadowed by the Council of Ministers.\n\n I hope this helps 🙂!"]
        },
        {
            "tag": "rule_effective_date_of_Gujarat_Government_Rules_of_Business,",
            "patterns": ["When do the Gujarat Government Rules of Business, 1990, come into force?", 
                         "Tell me about the effective date of the rules of Business."],
            "responses": [" The Gujarat Government Rules of Business, 1990, come into force with effect from 1st April, 1990.",
                          " The Gujarat Government Rules of Business, 1990 came into force on April 1, 1990.\n\n I hope this helps 🙂!"]
        },
        {
            "tag": "rule_purpose_of_Gujarat_Government_Rules_of_Business,",
            "patterns": ["What is the purpose of Gujarat Government Rules of Business, 1990?"],
            "responses": [" The Gujarat Government Rules of Business, 1990, are rules made by the Governor of Gujarat for the more convenient transaction of the business of the Government. They provide guidelines for various administrative procedures and decision-making processes.\n\n The Gujarat Government Rules of Business, 1990 (GGRB) are a set of rules that govern the allocation of business among the Ministers and Ministers of State of the Gujarat government. The GGRB also outline the procedures for the transaction of business by the government.\n\nThe GGRB are important because they help to ensure that the government is efficient and effective. By clearly defining the roles and responsibilities of the Ministers and Ministers of State, the GGRB help to avoid confusion and duplication of effort. The GGRB also help to ensure that the government is accountable to the people of Gujarat.\n\n I hope this helps 🙂! & if you have any more questions, feel free to let me know!",
        "The Gujarat Government Rules of Business, 1990, represent regulations established by the Governor of Gujarat to facilitate the government's operations conveniently. These rules offer guidelines for various administrative procedures and decision-making processes.\n\nThe Gujarat Government Rules of Business, 1990 (GGRB) constitute a set of regulations governing the allocation of business among the Ministers and Ministers of State in the Gujarat government. The GGRB also outline the procedures for conducting government business.\n\nThe importance of the GGRB lies in their role in ensuring the government's efficiency and effectiveness. By clearly defining the roles and responsibilities of the Ministers and Ministers of State, the GGRB help prevent confusion and duplication of effort. Additionally, the GGRB play a crucial role in ensuring government accountability to the people of Gujarat.\n\nI hope this helps 🙂! If you have any more questions, feel free to ask me!"]
        },
        {
            "tag": "rule_interpretation_of_Gujarat_Government_Rules_of_Business",
            "patterns": ["How are the Gujarat Government Rules of Business, 1990 interpreted?", 
                         "What applies for the interpretation of Gujarat Government Rules of Business, 1990 and instructions issued under rule 15?"],
            "responses": [" The General Clauses Act, 1897, applies for the interpretation of Gujarat Government Rules of Business, 1990 and the instructions issued under rule 15, as it applies for the interpretation of a Central Act.\n\n I hope this helps 🙂!"]
        },
        {
            "tag": "prior_concurrence",
            "patterns": ["When is prior concurrence required for appointments in Sachivalaya?", 
                         "Explain the requirement of prior concurrence."],
            "responses": ["Prior concurrence is required for the appointment of an officer not borne on the Secretariat cadre to any class-I post in any department of Sachivalaya. This concurrence is obtained from the General Administration Department.\n\n I hope this helps 🙂!"]
        },
        {
            "tag": "allocation_of_business_among_the_Ministers_and_Ministers_of_State",
            "patterns": ["How is the business of the Government allocated among the Ministers and Ministers of State?", 
                         "business among the Ministers and Ministers of State.",
                         "Explain the rules for allocating business among Ministers and Ministers of State."],
            "responses": [" The Governor, on the advice of the Chief Minister, allocates the business of the Government by assigning one or more departments to the charge of a Minister or Minister of State. It is allowed to assign one department to the charge of more than one Minister or more than one Minister of State.\n Additionally, a department or business appertaining to a department can be assigned to both a Minister and a Minister of State. The Chief Minister can also temporarily assign a department or business to the charge of a Minister, Minister of State, or Deputy Minister when the Minister-in-charge is temporarily incapable of acting.\n\n The allocation of business among the Ministers and Ministers of State in Gujarat is governed by the Gujarat Government Rules of Business, 1990. The Rules provide for a flexible and adaptable system of allocation, taking into account the workload and expertise of the Ministers.\n Under the Rules, the Chief Minister is responsible for the overall allocation of business among the Ministers. The Chief Minister may also consult with the Cabinet on the allocation of business.\n\n The Rules also provide for the creation of Cabinet Committees to deal with specific subjects. Cabinet Committees are composed of a group of Ministers who are responsible for a particular subject. Cabinet Committees are chaired by the Minister who is responsible for the subject, and they are responsible for making recommendations to the Cabinet on the subject.",
        "The allocation of business among the Ministers and Ministers of State in Gujarat is governed by the Gujarat Government Rules of Business, 1990. The Rules provide a framework for the allocation of business, as well as the powers and functions of Ministers and Ministers of State.\n\nUnder the Rules, the Chief Minister is responsible for the allocation of business among the Ministers and Ministers of State. The Chief Minister may also entrust the responsibility for specified items of business to a Minister who is in charge of any other Department or to a Minister without Portfolio who is not in charge of any Department.\n\nThe Rules also provide that the Chief Minister may, from time to time, issue instructions for the allocation of business among the Ministers and Ministers of State. These instructions may be general in nature or may apply to specific Departments or subjects.\n\nThe allocation of business is based on a number of factors, including the experience and expertise of the Ministers and Ministers of State, the workload of the Departments, and the priorities of the government.\n\nThe Rules also provide for a mechanism for the coordination of business between Ministers and Ministers of State. This mechanism involves the establishment of Cabinet Committees, which are responsible for overseeing the work of Departments and for coordinating policy development.\n\nThe allocation of business among the Ministers and Ministers of State is a dynamic process that is constantly being reviewed and updated to meet the changing needs of the government.\n\nI hope this helps! & if you have any more questions, feel free to ask me!"]
        },
        {
            "tag": "allotment_of_business_to_Ministers_of_State",
            "patterns": ["How is business appertaining to a department allotted to a Minister of State or Deputy Minister?",
                          "Describe the rules governing the allocation of departmental business to a Minister of State or Deputy Minister.",
                          "What is the procedure for allocating departmental business to a Minister of State or Deputy Minister, as per the rules in place?"],
            "responses": ["The Chief Minister or the Minister-in-charge, in consultation with the Chief Minister, may allot to a Minister of State or Deputy Minister any business appertaining to a department.\n\nThe allocation of business to a Minister of State or Deputy Minister is typically based on the Minister's experience, the department's workload, and the government's priorities. The business is formally assigned to the Minister through a written order or directive, and the allocation is communicated to the relevant parties. The allocation of business is not static and may be reviewed and adjusted as needed",
                          "The allocation of business to a Minister of State or Deputy Minister is a dynamic process that involves considering factors such as the minister's expertise, the department's workload, and the government's priorities. The allocation is typically made through a formal order or directive and may be reviewed and adjusted as needed\n\n The Chief Minister or the Minister-in-charge, in consultation with the Chief Minister, may allot to a Minister of State or Deputy Minister any business appertaining to a department.",
                        "The allocation of business to a Minister of State or Deputy Minister is typically done by the Chief Minister or other responsible authority. The allocation is based on a combination of factors, including the experience and expertise of the Minister of State or Deputy Minister, the workload of the department, and the priorities of the government. In some cases, a Minister of State or Deputy Minister may be assigned specific tasks or projects within a department. The allocation of business is a dynamic process that can be reviewed and updated as needed.\n\nHere are the key steps involved in allocating business to a Minister of State or Deputy Minister:\n• Identification of business\n• Consideration of factors\n• Allocation of business\n• Communication and coordination\n• Ongoing review and adjustment\n\n I hope this helps 🙂! & if you have any more dquestions, feel free to let me know!"]
        },
        {
            "tag": "department_structure_of_the_Secretariat",
            "patterns": ["What is the structure of each department of the Secretariat?", 
                         "Explain the composition of each department of the Secretariat.",
                        "How many secretary can one department have?"],
            "responses": ["Each department of the Secretariat consists of the Secretary to the Government, who serves as the official head of that department, and other officers and servants subordinate to him as determined by the State Government. It is allowed to place more than one department under the same Secretary, and the work of a department may be divided between two or more Secretaries.",
        "Each division within the Secretariat comprises the Secretary to the Government, who functions as the official head of the division, along with other officers and subordinates appointed by the State Government.\n The State Government has the authority to assign multiple departments under a single Secretary, and the responsibilities of a department may be distributed among two or more Secretaries."]
        },
        {
            "tag": "collective_responsibility",
            "patterns": ["What is the collective responsibility of the Council?", 
                         "Explain the collective responsibility of the Council for advice tendered to the Governor."],
            "responses": ["The Council is Collectively responsible for all advice tendered to the Governor, whether by an individual minister on a matter appertaining to his portfolio or as a result of discussions at a meeting of the Council or otherwise.\n\n Collective responsibility also helps to ensure that the government is accountable for its actions. If the government makes a decision that is unpopular with the public, all of the ministers are held responsible for that decision, even if they did not personally agree with it. This helps to ensure that the government is responsive to the needs of the people.",
        "The Council bears collective responsibility for all advice presented to the Governor, whether it originates from an individual minister regarding a matter within their portfolio or arises from discussions during a Council meeting or other avenues.\n\nThis collective responsibility serves to uphold government accountability. In instances where the government makes a decision unpopular with the public, all ministers are collectively accountable for that decision, irrespective of their personal agreement. This mechanism ensures the government remains responsive to the people's needs."]
        },
        {
            "tag": "second_schedule_cases",
            "patterns": ["How are cases referred to in the Second Schedule brought before the Council?", 
                         "Explain the process of bringing cases referred in the Second Schedule before the Council as per the provided rules."],
            "responses": [" All cases referred to in the Second Schedule shall be brought before the Council by the direction of the Governor under clause (c) of article 167. They can also be brought by the direction of the Chief Minister or the Minister-in-charge of the case, with the consent of the Chief Minister, before the Council or before such ministers or Minister of State as the Chief Minister directs.\n However, no case in regard to which the Finance Department is required to be consulted under rule 11 shall be discussed by the Council or by such Ministers or Ministers of State unless the Finance Minister has had the opportunity for its consideration, except in exceptional circumstances under the directions of the Chief Minister."]
        },
        {
            "tag": "responsibility_of_minister_in_charge",
            "patterns": ["What is the primary responsibility of the Minister in-charge of a department in business?", 
                         "Explain the responsibility of the Minister in-charge of a department for the disposal of business."],
            "responses": ["The Minister in-charge of a department shall be primarily responsible for the disposal of the business appertaining to the department.\n\n This means that they are responsible for making decisions about how the department's work is carried out and for ensuring that the department meets its objectives.\n\nThe Minister's responsibilities for the disposal of business include:\n• Setting priorities: The Minister must determine which issues are most important for the department to address and allocate resources accordingly.\n• Making decisions: The Minister must make decisions on a wide range of issues, from day-to-day operations to strategic planning.\n• Overseeing the implementation of decisions: The Minister must ensure that decisions are implemented effectively and efficiently.\n• Monitoring progress: The Minister must monitor the department's progress towards its objectives and make adjustments as needed.\n• Accountability: The Minister is ultimately accountable for the department's performance.\n\nTo fulfill their responsibilities for the disposal of business, the Minister works with a team of senior officials and staff within the department. The Minister relies on their advice and expertise to make informed decisions and to ensure that the department is operating effectively.\n\nThe Minister's responsibilities for the disposal of business are essential for ensuring that the government delivers on its promises to the public. By effectively managing the department's business, the Minister can help to improve the lives of citizens and make a positive impact on society.\n\n I hope this helps. Is there anything else that I can help you with?",
                          "The Minister in-charge of a department is primarily accountable for handling the department's business.\n\nThis responsibility entails making decisions on how the department's work is executed and ensuring the department achieves its objectives.\n\nThe Minister's duties for business disposal encompass:\n• Setting priorities: Prioritizing the issues that require the department's attention and allocating resources accordingly.\n• Decision-making: Addressing a broad spectrum of issues, from day-to-day operations to strategic planning.\n• Supervising decision implementation: Ensuring effective and efficient implementation of decisions.\n• Progress monitoring: Overseeing the department's progress towards its objectives and making adjustments as necessary.\n• Accountability: Ultimately being answerable for the department's performance.\n\nTo fulfill these responsibilities, the Minister collaborates with senior officials and departmental staff. The Minister relies on their advice and expertise to make informed decisions, ensuring the department operates efficiently.\n\nThe Minister's role in business disposal is crucial for delivering government promises to the public. By effectively managing the department's affairs, the Minister can positively impact citizens' lives and contribute to societal improvement.\n\nI trust this information is helpful. If you have any further inquiries, feel free to ask"]
        },
        {
            "tag": "consultation_with_finance_department",
            "patterns": ["What are the rules regarding consultation with the Finance Department?",
                         "Provide details on the guidelines for consulting with the Finance Department in Gujarat.",
                         "Explain the regulations regarding the consultation process with the Finance Department in Gujarat.",
                         "Explain the provisions related to consultation with the Finance Department."],
            "responses": ["No department shall, without previous consultation with the Finance Department, authorize any order that affects the finance of the State, especially those involving grants of land, assignment of revenue, concessions, grants, leases, or licenses of mineral or forest rights. Proposals requiring consultation must not be proceeded with unless concurred by the Finance Department, and no re-appropriation shall be made without their consultation. Every order of an administrative department conveying a sanction to be enforced in audit shall be communicated to the audit authorities with the endorsement that the order is issued with the concurrence of the Finance Department or Financial Adviser, as the case may be.\n\nIn more Detail... \n\nThe rules regarding consultation with the Finance Department in Gujarat are defined in the Gujarat Financial Code (GFC), which was introduced in 2004. The GFC outlines the procedures and requirements for obtaining financial approval from the Finance Department for various government activities.\n\nHere are some of the key rules regarding consultation with the Finance Department in Gujarat:\n\n1. Prior Approval for Financial Commitments: Before making any financial commitments, such as entering into contracts, sanctioning grants, or incurring expenditure, government departments must obtain prior approval from the Finance Department. This ensures that financial resources are allocated judiciously and in accordance with the government's overall fiscal priorities.\n2. Preparation of Budget Proposals: All government departments are required to prepare detailed budget proposals for their planned expenditures. These proposals must be submitted to the Finance Department for review and approval. The Finance Department evaluates the proposals based on their financial implications, alignment with government objectives, and adherence to budgetary guidelines.\n3. Consultation for Policy Changes: Any proposed changes to existing policies or the introduction of new policies that have financial implications must be discussed with the Finance Department. This ensures that financial considerations are factored into policy decisions and that the government's financial commitments are not jeopardized.\n4. Submission of Financial Statements: Government departments are required to submit periodic financial statements, such as quarterly and annual accounts, to the Finance Department. These statements provide a transparent view of the department's financial performance and enable the Finance Department to monitor the utilization of funds.\n5. Compliance with Financial Regulations: All government departments must adhere to the financial regulations and guidelines set by the Finance Department. These regulations cover aspects such as budgeting, expenditure control, revenue management, and accounting procedures.\n6. Seek Clarification and Guidance: Government departments are encouraged to seek clarification and guidance from the Finance Department whenever they encounter ambiguity or uncertainties related to financial matters. This proactive approach helps to avoid delays, discrepancies, and potential irregularities.\n\n In addition to these specific rules, the GFC also emphasizes the importance of maintaining open communication and collaboration between government departments and the Finance Department. This fosters a culture of financial discipline, transparency, and accountability within the government system.\n\nBy following these rules and promoting a collaborative approach to budgeting, the Government of Gujarat strives to ensure efficient use of public funds, sound budgeting and overall economic stability.\n\nI hope this helps. Is there anything else I can help you with?"]
        },
        {
            "tag": "government_orders_making",
            "patterns": ["Explain the procedure for making orders by the Government of the State.",
                         "What are the rules for executing orders on behalf of the Government of gujarat?",
                         "Tell me about the signing authority for orders by the Government of the State.",
                         "Who is responsible for the proper transaction of business according to the rules?",
                         "Explain the role of the Secretary in ensuring the observance of rules by the Government.",
                         "Describe the authentication process for orders or instruments made by the Government."],
            "responses": ["Government Orders and Rules:\n\n• All orders or instruments made or executed by or on behalf of the Government of the State shall be expressed to be made by or by order of or executed in the name of the Governor.\n• Every order or instrument of the Government of the State shall be signed either by a Secretary, an Additional Secretary, a Special Secretary, a Joint Secretary, a Deputy Secretary, an Under Secretary, an Assistant Secretary, or a Section Officer, or by such other officer specially empowered in that behalf by the Government. Such signature shall be deemed to be the proper authentication of such order or instrument.\n• The Secretary of the department concerned is, in each case, responsible for the proper transaction of business and the careful observance of these rules. When he considers that there has been any material departure from them, he shall personally bring the matter to the notice of the Minister in charge and the Chief Secretary.\n• These rules may, to such extent as may be necessary, be supplemented by instructions to be issued by the Governor on the advice of the Chief Minister.\n\nI hope this helps. Is there anything else I can help you with?",
                         "Government Orders and Rules:\n\n• Orders or instruments by/on behalf of the State Government must state they are made by/order of/in the name of the Governor.\n• Every State Government order or instrument must be signed by a designated official (Secretary, Additional Secretary, Special Secretary, Joint Secretary, Deputy Secretary, Under Secretary, Assistant Secretary, or Section Officer), or by an officer authorized by the Government, serving as proper authentication.\n• The Secretary of the concerned department is individually responsible for business conduct and rule adherence. Any significant deviation must be reported to the Minister and Chief Secretary.\n• Rule 15 underscores the Secretary's responsibility. Significant deviations require reporting to the Minister and Chief Secretary.\n• These rules may be supplemented by Governor-issued instructions on the Chief Minister's advice.\n\nI hope this meets your requirements. Is there anything else I can assist you with?"]
        },
        {
            "tag": "general_administration_department",
            "patterns": ["What are the subjects allotted to the General Administration Department?",
                         "Tell me about the functions of the General Administration Department.",
                         "what are the Subjects alloted under GAD",
                         "Explain the roles and responsibilities of the General Administration Department."],
            "responses": ["Subjects Allotted to the General Administration Department:\n\n1. Appointment and leave of the Governor.\n2. Expenditure in connection with the residence of the Governor (including works expenditure).\n3. Salaries and allowances of Ministers, Ministers of State, Deputy Ministers and Parliamentary Secretaries to the Ministers (see also entry No. 1 under the L & PAD).(Date08/02/1993)\n4. Arrangements for the meeting of the Council of Ministers.\n5. The Constitution of India.\n6. Rules of business and instructions thereunder.\n7. Elections to Parliament and to the Legislature of the State.\n8. The Governor's address to the State Legislative Assembly.\n9. Matters pertaining to Zonal Council.\n10. Matters arising from the State's reorganization and bifurcation\n11. Territorial changes other than those within the State.\n12. Ceremonials, including receptions, etc., of illustrious persons, national dress, official mourning, etc.\n13. Warrant of Precedence and Table of Precedence.\n14. National Awards.\n15. Deleted. (Date02/06/2005)\n16. Government records, memorials, rules regarding the disposal of complaints and representation, etc., from members of the public, official correspondence.\n17. General Administration Report (including Dangs Progress Report).n18. Public Holidays.\n19. Accommodation for Government Offices in the City of Gandhinagar.\n20. Deleted. (Date20/01/2004)\n21. Census.\n22. Rights and Privileges of Dangs' Chiefs and Naiks.\n23. Saranjams.\n24. Political Pension.\n25. Foreign Affairs, entering into treaties and agreements with foreign countries and implementation of treaties, agreements, and conventions with foreign countries, extradition.\n26. Consular Officers, including their appointments, lease, etc.\n27. Deleted. (Date02/04/1996)\n28. Deleted. (Date20/05/1996)\n29. Inter-State Migration.\n30. Deleted. (Date20/05/1996)\n31. Pilgrimages to places outside India (See also entry No. 11 under UD and UHD). (Date20/05/1996)\n32. Deleted. (Date20/05/1996)\n33. Ecclesiastical affairs.\n34. Posts and telegraphs, including telephones, but not including the village telephone system, post office savings Bank(See also entry No. 5 under R and BD and Entry No. 7 under HD).\n35. Union Agencies and institutions for professional vocational or technical training or the promotion of special studies or research.\n35‐A. Administrative Reforms, Training. (Date17/06/1998), (Date09/04/2002)\n36. Appointments of the High Court Judges.\n36‐A. Lokayukt.\n37. State Public Service Commission.\n38. All matters affecting the All India Services and posts and Gujarat Administrative Services(See also entry No. 17 under FD.)\n39. Safeguarding the rights and legitimate interest of all establishments(See also entryNo. 17 under FD.)\n40. Classification and recruitment rules.\n41. Measures to secure adequate representation of all castes and communities in the public service.\n42. Conduct, discipline, and appeal rules, including the Government Services Conduct Rules.\n43 Departmental, Hindi and Regional language Examination for Government Servants.\n44. Government Servant's Association.\n45. (i) All matters pertaining to appointments, postings, transfers, promotions, conduct, grant of leave, pension, etc., in respect of all officers of the Indian Administrative Service and (Date29/07/2005)\n    (ii) All matters pertaining to appointments, postings, transfers, promotions, conduct and grant of leave exceeding two months etc. in respect of Class‐I Officers of the Secretariat Departments except officers not borne on the Secretariat Cadre; and\n    (iii) All matters pertaining to appointments, postings, transfers, promotions, proposals of administrative departments for inflictment of any of the penalties as specified at serial numbers 3 to 8 in rule 6 of the Gujarat Civil Services (Discipline and Appeal) Rules, 1971, in respect of all class‐ii officers of the Secretariat Departments except officers not borne on the Secretariat Cadre\n46. (i) All matters pertaining to promotions, conduct, and pension of all officers belonging to the junior time scale of the Indian Administrative Service.\n    (ii) All matters pertaining to appointments, postings, transfers, promotions, conduct, grant of leave, pension, etc., in respect of Gazetted Officers and non‐gazetted Government Servants under the Administrative Control of the Departments ( See also entry No. 32 under RD )\n47. Persons appointed to the Secretariat Staff of the Legislative Assembly.\n48. Prescribing rules for the supply of clothing, uniforms kambalis and umbrellas to Class‐IV employees.\n49. Establishment of Ministers, Ministers of State Deputy Ministers and Parliamentary Secretaries.\n50. Concessions to political sufferers and prohibition affected persons.\n51. Public relations and measures for the speedy redress of cut grievances and complaints from the public (except publicity, vide entry No. 2 under I&BD and entries Nos. 5 and 8 under I & MD).\n52. Works, lands and buildings, vested in or the possession of the Government for the purposes of the State and assigned to the General Administration Department.\n53 Inquiries and Statistics for the purpose of any of the matters in this list.\n54. Fees in respect of any of the matters in this list but not including fees taken in any court.\n55. Any subject not mentioned elsewhere in the First Schedule.\n\n[B] General Administration Department (Planning; Division) :\n56. All matters relating to general principles and policy regarding socioeconomic planning.\n57. Preparation of the Five Year Plan for the State and for the district\n58. Development programmes and periodical programme reports on schemes included in the plan.\n59. Foreign technical assistance.\n60. Co‐ordination and Development activities.\n61. Statistics relating to planning.\n62. Statistical intelligence and training.\n63. All matters relating to district planning\n64. Supervision over the activities conducted and executed by the Central for monitoring Gujarat Economy.\n12\n\n[C] General Administration Department (Non Resident Indians Div.) (Date17/06/1998)\n65. To establish effective communication with Non Resident Indians of Gujarati origin in various parts of the world, prepare and maintain a comprehensive database about Non Resident Indians of Gujarati origin. (Date17/06/1998)\n66. To study from time to time the social and cultural problems of Non Resident Indians of Gujarati origin and take steps to formulate schemes for meeting their requirements. (Date17/06/1998)\n67. To take effective steps to survey and assess the technical and professional skills of Non-resident Indians of Gujarati origin and to dovetail the same in the developmental efforts of the State. (Date17/06/1998)\n68. To tap the technological, managerial, and financial resources of the Non-Resident Indians of Gujarati origin so as to upgrade the technical and professional skills and the human resources of the State, for the economic and industrial development of the State. (Date17/06/1998)\n69. To channelize the savings and surplus financial resources of the Non-Resident Indians of Gujarati origin in the development efforts of the State for mutual benefits. (Date17/06/1998)\n70. To monitor the general welfare of the Non-Resident Indians and in times of crisis identify specific problems of Gujarati Non-Resident Indians groups and take up the same with and through the Government of India. (Date17/06/1998)\n\nI hope this helps. Is there anything else I can help you with?"]
        },
        {
            "tag": "agriculture_department",
            "patterns": ["What are the subjects allotted to the Agriculture and Co‐operation Department?",
                         "Tell me about the functions of the Agriculture and Co‐operation Department.",
                         "Subjects alloted under Agriculture Department",
                         "Subjects alloted under Agriculture and Co‐operation Department",
                         "Explain the roles and responsibilities of the Agriculture and Co‐operation Department."],
            "responses": ["Subjects Allotted to the Agriculture and Co‐operation Department:\n\n1. Agriculture, including agricultural Extension agricultural engineering, agricultural statistics, crop protection from pests and diseases, agricultural research and agricultural schools and colleges, agriculture loans, agricultural colonisation, animal husbandry including dairying and live‐stock improvement, veterinary science, veterinary education and prevention of animal diseases (See also entry No. 1 under ED and Entry No. 5 under NWRWS & KD). (Date14/06/1999, Date03/09/2005)\n1‐A. Agricultural Industry Policy (Date14/06/2006)\n2. Deleted (Date21/03/1997)\n3. Deleted (Date21/03/1997)\n4. Deleted (Date21/03/1997)\n5. The prevention of extension from one unit to another of infections of contagious disease or pests affecting animals or plants (See also entry No. 6 under H&FWD)\n6. Land improvement by mechanical cultivation and soil conservation. (except advanced irrigation methods like drip/sprinkler and micro-irrigation system keeping in view judicious utilization of water. (Date18/03/2005)\n6‐A. Khar lands(See also entry No. 4 Under R. D). (Date08/02/1993)\n6‐B. All works pertaining to deepening the Village ponds. (Date25/02/1999)\n7. Manner and fertilizersincluding trading schemes.\n8. Control of fruit products.\n9. Production, supply and price control of cattle fodder including oilcake and other concentrates, distribution and marketing of fertilizers, whether organic, in‐organic or mixed.\nSupply and price control of tractors under the Essential Commodities Act, 1955 (No. X of 1955), production of essential commodities falling within the list of subjects allotted to the department, Essential Commodities and Cattle Control Act, 1958 in so far as it relates to cattle, control (See also entry No. 9 under H&FWD, entry No. 19 under I&MD entry Nos. 1 and 3 under FCS&CAD)\n10. Milk schemes,\n11. Administration of the Food Bonus Fund.\n12. Meteorological organizations and observatories.\n13. Cotton Ginning and Pressing Factories Act, 1925 and Cotton Ginning and Pressing Factories( Saurashtra amendment ) Act, 1955.\n14. Deleted. (Date01/12/1993)\n15. Support prices of agriculture products excluding food grains (See also entry No. 4 under FCS&CAD).\n16. Lift Irrigation by societies falling within the meaning of that term under the Gujarat Co‐operative Societies Act, 1962 and persons other than corporate bodies, well irrigation and boring (See also entry No. 2 under NWRWS&KD).\n17. Incorporation, regulation and winding up of the corporations other than those specified in List‐I, un-corporated trading co‐operative societies, Bombay Co‐operative Societies Act, 1925, Co‐operative Processing Societies.\n18. Forest Labour's Co‐operative Societies.\n19. Aid to Housing Co‐operative Societies through Gujarat State Co‐operative Housing Finance Societies Limited, etc.\n20. The Bombay Execution of Decrees (Temporary Postponement) Act, 1959 (Bombay LXX of 1959) (See also entry No. 24 under RD).\n21. Bombay Agriculture Debtors Relief, 1947.\n22. Grain Depots.\n23. Ware Houses Act.\n24. Agriculture Produce Markets Act.\n25. Money lending and Money lenders.\n26. Deleted. (Date30/05/1994)\n27. (i) All matters pertaining to appointments postings, transfers, promotions, conduct, grants of leave, pension etc. in respect of all Gazetted Officers (Other than those covered under entry No. 45 in the subjects allotted to the GAD) and non‐Gazetted servants under the administrative control of the departments;\n(ii) all matters pertaining to grant of pension in respect of Class I and II Officers of the Secretariat cadre under the administrative control of the department; and\n(iii) All matters pertaining to grant of leave impose penalties as specified at serial numbers 1 and 2 of rule 6 or die Gujarat Civil Services (Discipline and Appeal) Rules, 1971, and to institute, disciplinary proceedings for imposing penalties as specified at serial numbers 3 to 8 of the said rule 6 in respect of Class II Officers of the Secretariat cadre under the administrative control of the Department (See also entry No. 45 under GAD).\n28. Works, lands and buildings vested in or in the possession of Government for the purposes of the State and assigned to the Agriculture and Co‐operation Department. (Date21/03/1997)\n29. Inquiries and statistics for purposes of any of the matters in thislist.\n30. Fees in respect of any of the matters in this list but not including fees taken in any court.\n31. Fishing rights, fish farms and fisheries (See also entry No. 9 under NWRWS&KD). (Date03/09/2005)\n32. (a) Cow breeding, [(a) to (f) ] (Date03/09/2005)\n(b) All matters pertaining to Gau‐Seva Ayog,\n(c) All matters pertaining to the development of ‘Gau Shala’,\n(d) Trusts of 'E' Category registered as such under the Bombay Public Trusts Act, 1950, or under the Societies Registration Act, 1860 for the purpose of Panjarapole,\n(e) Trusts of 'A' Category registered as such for the purpose of Cow breeding, Gau Seva, Gau Shala and Panjarapole under the Bombay Public Trusts Act, 1950 or under the Societies Registration Act, 1860,\n(f) Administration under the Bombay Public Trusts Act, 1950 and the Societies Registration Act, 1860 so far as they relate to the Trusts referred to in the aforesaid clauses (d) and (e) (See also entries Nos. 28 and 30 under ID)\n\nIf you have any other questions or needs, feel free to let me know. I'm here to help."]
        },
        {
            "tag": "education_department",
            "patterns": ["What are the subjects allotted to the Education Department?",
                         "Tell me about the functions of the Education Department.",
                         "subjects allotted under the Education Department",
                         "Explain the roles and responsibilities of the Education Department."],
            "responses": ["Subjects Allotted to the Education Department:\n\n1. Education including technical, European and Anglo Indian education and agricultural education in Primary and Secondary schools, but excluding agricultural education allotted to the Agriculture and Co‐operation Department. (See also entry No. 1 under A&CD).\n1‐A   Pharmacy  Education. (Date09/04/1991)\n2    Deleted. [(Modify Date 17/12/1990) Date21/03/1997]\n3. Copy‐right.\n4.    Books and journals (see also entry No. 28 under I&MD and entry No. 1 under I&BD).\n5.    Literacy and scientific associations and universities. (Date23/04/2003)\n6. Deleted. [(Modify Date 17/12/1990) Date21/03/1997]\n7.    Schools and colleges competitionsin histrionics and dramatics.\n8.    Scheme for the training of primary schools teachers in the dramatics.\n9    Grant‐in‐aid to schools imparting instructionsin music, dance and dramatics.\n9‐A. Auxiliary and National Cadet Corps((N.C.C.) (Date01/12/1993)\n10.    Deleted.(Date17/12/1990).\n11. Deleted. (Date 17/12/1990).\n12. Deleted. (Date 17/12/1990).\n12‐A.   Mahila Samakhya.(Date23/05/2003)\n13. (i) All matters pertaining to appointments, postings transfers, conduct, grant of leave, pension etc; in respect of all Gazetted Officers (other than those covered under entry No. 45 in the subject allotted to the GAD) and Non‐Gazetted Government Servants under the administrative control of the Department;\n(ii) all matters pertaining to grant of pension in respect of Class I and II Officers of the Secretariat Cadre under the administrative control of the department; and\n(iii) all matters pertaining to grant of leaves to impose penalties as specified at serial numbers I and 2 of rule 6 of the Gujarat Civil Services (Discipline and appeal) rules, 1971, and to institute disciplinary proceedings for imposing penalties as specified at serial number 3 to 8 of the said rule 6 in respect of Class‐II Officers of the secretariat cadre under the administrative control of the Department (See also entry No. 45 under G.A.D.)\n14. Works, land and buildings vested, in or in the possession of Government, for purposes of the State and assigned to the education Department.\n15. Inquiries and statistics for purposes of any of the matters in thislist.  \n16. Fees in respect of any of the matters in this list but not including fees taken in any court.\n\nIf you have any other questions or needs, feel free to let me know. I'm here to help."]
        },
        {
            "tag": "finance_department",
            "patterns": ["What are the subjects allotted to the Finance Department?",
                         "Tell me about the functions of the Finance Department.",
                         "subjects allotted to the Finance Department",
                         "Explain the roles and responsibilities of the Finance Department."],
            "responses": ["Subjects Allotted to the Finance Department:\n\n1. Financial resources.\n2. General principles relating to financing the plans and Central assistance for schemes including in the plan.\n3. Currency, coinage and legal tender.(Mints).\n4. Taxation, Central and State, excluding taxation by local self-governing bodies.\n5. News papers advertisements tax.\n6. Central Government excise duties.\n7. Taxes on the sale or purchase of goods.\n8. Tax on Urban Immovable property.\n9. Taxes on Railway fares and freights (See also entry no. 11 under PRH&RDD & entry No. 7 under UD & UHD)\n10. Taxes on profession, traders, calling and employments.\n11. Debt including public debts of the State public and other securities investment of deposits.\n12. Small Savings.\n13. State budget, preparation of estimates and grants money bills, Appropriation Bills and law relating to the Consolidated and Contingency Funds of the State.\n14. General Account questions.\n15. Audits.\n16. Appropriation Reports.\n17. Pay allowances, pension, other financial conditions of services and cadre strengths, subject to entries Nos. 38 and 39 in the list of General Administration department.\n18. Rules of Family Pension Funds (including Indian Civil Services Family Pension Funds and Superior Services (India) Family Pension Fund).\n19. Rules of Provident Fund (including those relating to Indian Services).\n20. Discretionary and quinquennial contract grants.\n21. Open Market loans to be raised by Municipal Corporation.\n22. Government Insurance Funds.\n23. Toshakhana.\n24. (i) All matters pertaining to appointments, posting transfers, promotions, conduct, grant of leave, pension etc. in respect of all gazetted Officers (Others than those covered under entry No. 45 in the subject allotted to the GAD) and Non-Gazetted government Servant under the administrative control of the departments.\n(ii) all matters pertaining to grant of pension of in respect of Class I and II Officers of the Secretariat cadre under the administrative control of the department: and\n(iii) all matters pertaining to grant of leave and to impose penalties as specified at serial number 1 and 2 of Rule 6 of the Gujarat Civil Services (Discipline and Appeal) Rules, 1971 and to institute disciplinary proceedings for imposing penalties as specified at serial numbers 3 to 8 of the said rule 6 in respect of Class II Officers of the Secretarial cadre under 18 the administrative control of the Department (See also entry No. 45 under G.A.D).\n25. Treasuries.\n26. Stock Exchange and future Markets\n27. Import and export across customs frontiers as defined by union Government.\n28. Incorporations regulation and Winding up of corporations specified in list‐I.\n29. Companies and Corporation excluding Co‐operatives Societies.\n30. Trade and commercial and training association (financial aspects)\n31. Banking.\n32. Registration of firms.\n33. Delegation of financial powers.\n34. Any other matters affecting the finances of the state.\n35 Works, lands and buildings vested in or in the possession of Government for the purposes of the State and assigned to the Finance Department.\n36. Inquiries and statistics for the purpose of any of the mattersin this list.\n37. Fees in respect of any of the matters in this list, but not including fees taken in any court.\n\n I trust this information is beneficial. Is there anything additional you need assistance with?"]
        },
        {
            "tag": "food_department",
            "patterns": ["What are the subjects allotted to the Food, Civil Supplies and Consumer Affairs Department?",
                         "Tell me about the functions of the Food Department.",
                         "Subjects allotted to the Food Department",
                         "subjects allotted to the Civil Supplies Department",
                         "subjects allotted to the Consumer Affairs Department",
                         "Explain the roles and responsibilities of the Food, Civil Supplies, and Consumer Affairs Department.",
                         "What areas are covered by the Food, Civil Supplies, and Consumer Affairs Department?"],
            "responses": [
                "Subjects Allotted to the Food, Civil Supplies and Consumer Affairs Department:\n\n1. The Bombay Essential Commodities and Cattle (Control) Act, 1958 (See also entry No. 9 under A & CD).\n2. Prevention of Black Marketing and Maintenance of Supplies of Essential Commodities Act, 1980 (Act No. 7 of 1980) (See also entry No. 4 under HD).\n3. (a) Supplies and distribution of foodstuff including edible oil seeds and oils and price control thereof under the Essential Commodities Act, 1955 (No. X of 1955) for domestic purpose to consumers.\n(b) Supplies and distribution of petroleum and its products (Viz, Kerosene, light, diesel oil, high-speed diesel oil, liquid petroleum gas, charcoal and firewood coal and coke with its derivatives under the Essential Commodities Act, 1955 (No. X of 1955) for domestic purpose to consumers.\n(c) Supplies and distribution of soap, matches, tyres and tubes hurricane lanterns under the Essential Commodities Act, 1955 (No. X of 1955) for the domestic purpose to consumers. (Date28/06/2000)\n(d) Supply and Distribution of iron, steel and cement for domestic purpose to consumers.\n(e) Distribution of other essential commodities and price control thereof under the Essential Commodities Act, 1955 (No. X of 1955) not falling within the list of subject allotted to other departments.\n(f) The Cotton Textile Control Order, 1948 in so far as it relates to the distribution of controlled cloth (see entry No. 9 under H & FWD entry No. 12 and 19 under I & MD and entry No. 9 under A & CD).\n4. Support prices of food grains (See also entry No. 15 under A & CD).\n5. Administration of the Sugar (Control) order, 1966 and Sugarcane (control) Order, 1966 issued under the Essential Commodities Act, 1955 (No. X of 1955).\n6. Matters (Including establishment matters) pertaining to the former Civil Supplies Department.\n7. Rice Milling Industry (Regulation Act, 1958 Wheat Roller Flour Mills (Licensing and Control) Order, 1957 and the Roller Mills Wheat Products (Price Control) Order, 1962.\n8. Consumer’s movement, education and protection.\n9. Weights and measures.\n10. (i) All matters pertaining to appointments, posting transfers, promotions, conduct, grant of leave, pension etc. in respect of all Gazetted Officers (Other than those covered under entry No. 45 in the subjects allotted to the GAD) and Non‐Gazetted Government Servants under the administrative control of the Department;\n(ii) all matters pertaining to grant of pension in respect of Class I and II Officers of the Secretariat cadre under the administrative control of the department; and\n(iii) all matters pertaining to grant of leave and to impose penalties as specified at serial numbers 1 and 2 of rule 6 of the Gujarat Civil Services (discipline and Appeal) Rules, 1971, and to institute disciplinary proceedings for imposing penalties as specified at serial numbers 3 to 8 of the said rule 6 in respect of Class II Officers of the Secretariat cadre under the administrative control of the Department (See also entry No. 45 under GAD).\n11. Works, lands and buildings vested in or in possession of government for the purpose of the State and assigned to the Food, Civil Supplies and Consumer Affairs Department. (Date21/03/1997)\n12. Inquiries and statistics for the purposes of any of the matters in this list.\n13. Fees in respect of any of the matters in this list but not including fees taken in any court\n\nI hope this helps. Is there anything else I can help you with?"
            ]
        },
        {
            "tag": "forest_environment_department",
            "patterns": ["What are the subjects allotted to the Forest and Environment Department?",
                         "Tell me about the functions of the Forest and Environment Department.",
                         "Subjects allotted to the Forest Department",
                         "Subjects allotted to the Environment Department",
                         "Explain the roles and responsibilities of the Forest and Environment Department."],
            "responses": ["Subjects Allotted to the Forest and Environment Department:\n\n 1. Forests (See also entry No. 8 under NWRWS & KD)\n2. Protection of Wild Life.\n3. National Parks.\n4. Botanical Survey of India.\n5. Zoological Survey of India.\n6. Forest Ecology.\n7. Marine Parks.\n8. Marine Ecology System and Pollution of Environment.\n9. Statutory actions for prevention of pollution (See also entry No. 15 under L & ED).\n10. Industrial pollution (See also entry No. 15 under L & ED).\n11. Air and Water pollution (see also entry No. 15 under L & ED).\n12. Environment aspects of new human settlement (See also entry No. 15 under L & ED).\n13. Ecology.\n14. (i) All matters pertaining to appointments, postings, transfers, promotions, conduct, grant of leave, pension etc. in respect of Officers of the India Forests service.\n(ii) all matters pertaining to appointments, postings, transfers, promotions, conduct, grant of leave, pension etc. in respect of all Gazetted Officers (Other than those covered under entry No. 45 in the subjects allotted to the GAD) and Non‐Gazetted Government Servants under the administrative control of the department.\n(iii) all matters pertaining to grant of pension in respect of Class‐I and II Officers of the Secretariat cadre under the administrative control of the Department, and\n(iv) all matters pertaining to grant of leave to impose penalties as specified at serial numbers 1 and 2 of rule 6 of the Gujarat Civil Services Discipline and Appeal) rulei5, 1971 and to institute disciplinary proceedings for imposing penalties as specified at serial numbers 3 to 8 of the said rule 6 in respect of class‐II Officers of the Secretariat cadre under the administrative control of the Department (see also entry No. 45 under G.A.D.)\n15. Works, Lands and Buildings vested in, or in the possession of government for the purpose of the State and assigned to Forest and environment Department.\n16. Inquiries and statistics for the purpose of any of the matters in this list.\n17. Fees in respect of any of the matters in this list but not including fees taken in any court\n\nI hope this helps. Is there anything else I can help you with?"
            ]
        },
        {
            "tag": "health_family_welfare_department",
            "patterns": ["What are the subjects allotted to the Health and Family Welfare Department?",
                         "subjects allotted to the Health Department.",
                         "Explain the roles and responsibilities of the Health and Family Welfare Department.",
                         "subjects allotted to the Family Welfare Department",
                         "What areas are covered by the Health and Family Welfare Department?"],
            "responses": [
                "Subjects Allotted to the Health and Family Welfare Department:\n\n1. Public Health and Sanitation, Hospital and Dispensaries (including medical education). Registration of births death and marriages (See also entry No.11 under LD and entry No. 12‐B under S J &ED and entry No. 15 under L & ED).(Date21/03/1997, Date25/06/1997)\n2. Deleted. (Date21/03/1997)\n2‐A. Deleted. (Date25/061997, Date31/12/2001)\n2‐B. Maternity benefit. (Date25/06/1997)\n3. Adulteration of food stuffs and other goods.\n4. Medical (Nursing) and dental professions.\n4‐A. Deleted. (Date21/03/1997)\n5. Relief of the disable and unemployable lunacy and mental deficiency including laces for the reception for treatment of lunatic and mentally deficient persons\n6. The prevention of the extension from one unit to another of infections or contagious diseases or pests affecting men (See also entry No. 5 under A & CD).\n7. (a), (b), (c) Deleted.. (Date21/03/1997)\n8. Port quarantine, seamen's and marine hospital connected with port quarantine.\n9. Drugs and Cosmetics Act, 1940, Drugs Control Administration and Distribution of Drugs and Price Control there of under the Essential Commodities Act, 1955 (No. X of 1955) for consumer's purpose. (See entry No. 19 under I & MD, entry No. 9 under A & CD and entry No. 3 under FCS & CAD).\n10. The Poisons Act, 1919 (See also entry No. 12C under SJ & ED entry No. 6A under HD and entry No. 15 under L & ED). (Date21/03/1997, Date25/06/1997, Date25/08/1997)\n11. Registration of Pharmacists and matters pertaining to Gujarat State Pharmacy Council. (Date09/04/1991)\n12. Employees State Insurance (Medical Institutions) (See entry No. 7 under L & Ed).\n13. (i) All matters pertaining to appointments, postings, transfers promotions, conduct, grant of leave, pensions etc. in respect of all Gazetted Officers (Other than those covered under entry No. 45 in the subjects allotted to the GAD) and non‐Gazetted Government Servants under the administration control of the department.\n(ii) all matters pertaining to grant of pension in respect of Class‐I and II Officers of the Secretariat cadre under the administrative control of the department; and\n(iii) all matters pertaining to grant of leave and to impose penalties as specified at serial numbers 1 and 2 of the rule 6 of the Gujarat Civil Services (Discipline and Appeal) Rules, 1971 and to institute disciplinary proceedings for imposing penalties as specified at serial numbers 3 to 8 of the said rule 6 in respect of Class‐II Officers of the Secretariat cadre under the administrative control of the Department (See also entry No. 45 under GAD).\n14. Works, lands and buildings vested in or in the possession of Government for the purpose of the State and assigned to the Health and Family Welfare Department.\n15. Inquiries and statistics for purpose of any of the matters in thislist.\n16. Fees in respect of any of the matters in this list but not including feestaken in any court.\n\nI hope this helps. Is there anything else I can help you with?",
            "Subjects Allotted to the Health and Family Welfare Department:\n\n1. Public Health and Sanitation, Hospital and Dispensaries (including medical education). Registration of births, deaths, and marriages (Refer also to entry No. 11 under LD and entry No. 12‐B under S J &ED, and entry No. 15 under L & ED). (Dates: 21/03/1997, 25/06/1997)\n2. Maternity benefit. (Date: 25/06/1997)\n3. Adulteration of foodstuffs and other goods.\n4. Medical (Nursing) and dental professions.\n5. Relief of the disabled and unemployable lunacy and mental deficiency, including places for the reception for the treatment of lunatic and mentally deficient persons.\n6. The prevention of the extension from one unit to another of infections or contagious diseases or pests affecting humans (Refer also to entry No. 5 under A & CD).\n7. Port quarantine, seamen's and marine hospitals connected with port quarantine.\n8. Drugs and Cosmetics Act, 1940, Drugs Control Administration, and Distribution of Drugs and Price Control thereof under the Essential Commodities Act, 1955 (No. X of 1955) for consumer purposes. (Refer to entry No. 19 under I & MD, entry No. 9 under A & CD, and entry No. 3 under FCS & CAD).\n9. The Poisons Act, 1919 (Refer also to entry No. 12C under SJ & ED, entry No. 6A under HD, and entry No. 15 under L & ED). (Dates: 21/03/1997, 25/06/1997, 25/08/1997)\n10. Registration of Pharmacists and matters pertaining to the Gujarat State Pharmacy Council. (Date: 09/04/1991)\n11. Employees State Insurance (Medical Institutions) (Refer to entry No. 7 under L & Ed).\n12. All matters pertaining to appointments, postings, transfers, promotions, conduct, grant of leave, pensions, etc., in respect of all Gazetted Officers (other than those covered under entry No. 45 in the subjects allotted to the GAD) and non‐Gazetted Government Servants under the administrative control of the department.\n13. Works, lands, and buildings vested in or in the possession of the Government for the purpose of the State and assigned to the Health and Family Welfare Department.\n14. Inquiries and statistics for the purpose of any of the matters in this list.\n15. Fees in respect of any of the matters in this list but not including fees taken in any court.\n\n I hope this information is helpful. If you have any further questions, feel free to ask."]
        },
        {
            "tag": "home_department",
            "patterns": ["What are the subjects allotted to the Home Department?",
                         "Tell me about the functions of the Home Department.",
                         "What areas are covered by the Home Department?"],
            "responses": [
                "Subjects Allotted to the Home Department:\n\n1. Removal from one State to another State of prisoners, accused persons and persons subject to preventive detention for reasons connected with the security of the State, the maintenance of public orders of the maintenance of supplies and services essential to the community.\n2. Naval, Military and Air Forces and any other armed forces, the Union, Central Bureau of Intelligence and Investigation including:\n(i) Internal Security and defence of India (Naval, Military or Air) matters bearing on internal security (Including the use of Naval Military or Air Forces and aid of Civil Powers);\n(ii) Auxiliary and Indian Territorial Forces.\n(iii) Promotion of Officers of the Indian Land forces.\n(iv) Recruitment and transport of troops;\n(v) Other miscellaneous military matters.\n3. Confidential and Secret codes;\n4. Public order including:\n(i) Preventive detention for reasons connected with the security of State maintenance of public order or the conservation of foreign exchange or prevention of smuggling activities or prevention of illicit traffic in narcotic drugs and psychotropic substances or defence or foreign affairs or security of Indian persons, subject to such detention (See entry No.2 under the FCS &CAD).\n(ii) All offences against the State including those under prevention of Seditious Meeting Act, 1911 and Criminal Law Amendment Act, 1908.\n(iii) Political intelligence;\n(iv) Political and communal agitations and subversive movement and preventive measuresto deal with them;\n(v) Unusual occurrences, inter communal relations, riotous disturbances.\n4‐A. Passports and Visas. (Date02/04/1996)\n4‐B. Naturalisation. (Date20/05/1996)\n4‐C. Extradition of foreigners. (Date20/05/1996)\n4‐D. Admission into and immigration and expulsion from India, foreign missionaries in India. (Date20/05/1996)\n4‐E. Certificate of age and nationality. (Date20/05/1996)\n5. Matters pertaining to appointment to Executive Magistrates, Special Executive, Magistrates Sub‐Divisional Magistrates and District Magistrate under the Code of Criminal Procedure, 1973 and conferment of special powers on them and withdrawal of such powers from them under the said code (See also entry No.8 under LD and entry No. 15 under L&ED).\n6. Censorship:‐ (Postal), (Telegraph), (Telephone).\n6‐A. Intoxicating liquors, that is to say, the production, manufacture, possession, transport, purchase and sale of intoxicating liquors (including dangerous drugs) and poisons subject to the provisions of entry No.59 in List I of the Seventh Schedule to the Constitution of India with respect to opium prohibition of intoxicating liquors and drugs for purpose of consumption (See also entry No. 10 under H & FWD and entry No. 15 under L & ED). (Date05/08/1997)\n6‐B. Duties of excise on the following goods manufactured or produced in the State and countervailing duties at the same of lower rates on similar goods manufactured or produced elsewhere in India:\n(i) Alcoholic liquors for human consumption.\n(ii) Opium, Indian hemp and other narcotic drugs and narcotics but not including medicinal and toilet preparations containing alcohol or any substance included in sub‐entry. (Date05/08/1997)\n6‐C. Opium in respect of cultivation and manufacture for sale for export. (Date05/08/1997)\n6‐D. Power alcohol (See also entry No. 18 under I & MD). (Date05/08/1997)\n6‐E. Excise agreement with any other State of India so far as Gujarat State is concerned. (Date05/08/1997)\n7. Wireless and other like forms of communications (See also entry No.34 under GAD and entry No.5 under R & BD).\n8. (i) All matters pertaining to appointments, posting, transfers, promotions, conduct, grant of leave, pension, etc. in respect of officers of Indian Police Service;\n(ii) all matters pertaining to appointments, posting, transfers, promotions, conduct, grant of leave, pension, etc. in respect of all Gazetted Officers (other than those covered under entry No.45 of the subject allotted to the GAD) and non‐Gazetted Government servants under the administration control of the Department.\n(iii) all matters pertaining to grant of pension in respect of class‐I & II Officers of the Secretariat Cadre under the Administrative Control of the Department.\n(iv) all matters pertaining to grant of leave and to impose penalties as specified at serial numbers 1 and 2 of rule 6 of the Gujarat Civil Services (Discipline and Appeal) rules, 1971 and to institute disciplinary proceedings for imposing penalties as specified at serial numbers 3 to 8 of the said rule 6 in respect of Class‐II officers of the secretariat cadre under the administrative control of the Department (See also entry No.45 under GAD).\n9. Anti‐corruption.\n10. Vigilance Commission.\n11. National Integration.\n12. Withdrawal of prosecution.\n13. Home Guards Organisations.\n14. State Reserve Police.\n15. Civil Defence.\n16. Gram Rakhsak Dal.\n17. Police including Railway and Village Police.\n18. Bombay Lotteries (Control and Tax) and Prize Competition (Tax) Act, 1958.\n19. Betting and gambling.\n20. Offences against, laws which respect to any of the matters in the list.\n21. Prevention of cruelty to animals.\n22. Vagrancy, nomadic and migratory tribes.\n23. General work relating to the administration of the Cattle Tress pass Act, 1871.\n24. A protection of cropsfrom wild animals and human sources.\n25. Explosives.\n26. Exhumation, missing persons, estate deceased persons.\n27. Arms, fire arms and ammunition.\n28. Bills and Acts other than those pertaining to subjects dealt within other department.\n29. Field firing and artillery practise.\n30. Resettlement of ex‐serviceman.\n31. Prisons and Persons detained therein, arrangement with other states for the use of prison, deportation of ex‐military convicts.\n32. Criminal Lunatics.\n33. Process serving on convicts and lunatics.\n34. Sainik fund and other civil activities relating to defence.\n35. Deleted (Date03/09/2005)\n36. Deleted. (Date03/09/2005)\n36‐A. Prohibition on selling, letting on hiring of obscene advertisements, photographs and posters for the purpose of publication or exhibition. (Date28/10/2004)\n37. Works lands and buildings vested in or in possession of Government purposes of the State and assigned to the Home Department.\n38. Inquiries and statisticsfor the purposes of any of the mattersin thislist.\n39. Fees in respect of any of the matters in this list but not including fees taken in any court.\n\nI hope this information is helpful. If you have any further questions, feel free to ask.",
            "Subjects Allotted to the Home Department:\n\n1. Removal from one State to another State of prisoners, accused persons, and persons subject to preventive detention for reasons connected with the security of the State, the maintenance of public order, or the maintenance of supplies and services essential to the community.\n2. Naval, Military and Air Forces and any other armed forces, the Union, Central Bureau of Intelligence and Investigation including:\n(i) Internal Security and defense of India (Naval, Military, or Air) matters bearing on internal security (Including the use of Naval, Military, or Air Forces and aid of Civil Powers);\n(ii) Auxiliary and Indian Territorial Forces.\n(iii) Promotion of Officers of the Indian Land forces.\n(iv) Recruitment and transport of troops;\n(v) Other miscellaneous military matters.\n3. Confidential and Secret codes;\n4. Public order including:\n(i) Preventive detention for reasons connected with the security of State maintenance of public order or the conservation of foreign exchange or prevention of smuggling activities or prevention of illicit traffic in narcotic drugs and psychotropic substances or defense or foreign affairs or security of Indian persons, subject to such detention (See entry No.2 under the FCS &CAD).\n(ii) All offenses against the State including those under prevention of Seditious Meeting Act, 1911 and Criminal Law Amendment Act, 1908.\n(iii) Political intelligence;\n(iv) Political and communal agitations and subversive movement and preventive measures to deal with them;\n(v) Unusual occurrences, inter-communal relations, riotous disturbances.\n4-A. Passports and Visas. (Date: 02/04/1996)\n4-B. Naturalization. (Date: 20/05/1996)\n4-C. Extradition of foreigners. (Date: 20/05/1996)\n4-D. Admission into and immigration and expulsion from India, foreign missionaries in India. (Date: 20/05/1996)\n4-E. Certificate of age and nationality. (Date: 20/05/1996)\n5. Matters pertaining to appointment to Executive Magistrates, Special Executive Magistrates, Sub-Divisional Magistrates, and District Magistrate under the Code of Criminal Procedure, 1973 and conferment of special powers on them and withdrawal of such powers from them under the said code (See also entry No.8 under LD and entry No. 15 under L&ED).\n6. Censorship:‐ (Postal), (Telegraph), (Telephone).\n6-A. Intoxicating liquors, that is to say, the production, manufacture, possession, transport, purchase and sale of intoxicating liquors (including dangerous drugs) and poisons subject to the provisions of entry No.59 in List I of the Seventh Schedule to the Constitution of India with respect to opium prohibition of intoxicating liquors and drugs for the purpose of consumption (See also entry No. 10 under H & FWD and entry No. 15 under L & ED). (Date: 05/08/1997)\n6-B. Duties of excise on the following goods manufactured or produced in the State and countervailing duties at the same of lower rates on similar goods manufactured or produced elsewhere in India:\n(i) Alcoholic liquors for human consumption.\n(ii) Opium, Indian hemp and other narcotic drugs and narcotics but not including medicinal and toilet preparations containing alcohol or any substance included in sub-entry. (Date: 05/08/1997)\n6-C. Opium in respect of cultivation and manufacture for sale for export. (Date: 05/08/1997)\n6-D. Power alcohol (See also entry No. 18 under I & MD). (Date: 05/08/1997)\n6-E. Excise agreement with any other State of India so far as Gujarat State is concerned. (Date: 05/08/1997)\n7. Wireless and other like forms of communications (See also entry No.34 under GAD and entry No.5 under R & BD).\n8. (i) All matters pertaining to appointments, posting, transfers, promotions, conduct, grant of leave, pension, etc. in respect of officers of the Indian Police Service;\n(ii) all matters pertaining to appointments, posting, transfers, promotions, conduct, grant of leave, pension, etc. in respect of all Gazetted Officers (other than those covered under entry No.45 of the subject allotted to the GAD) and non-Gazetted Government servants under the administrative control of the Department.\n(iii) all matters pertaining to grant of pension in respect of class-I & II Officers of the Secretariat Cadre under the Administrative Control of the Department.\n(iv) all matters pertaining to grant of leave and to impose penalties as specified at serial numbers 1 and 2 of rule 6 of the Gujarat Civil Services (Discipline and Appeal) rules, 1971 and to institute disciplinary proceedings for imposing penalties as specified at serial numbers 3 to 8 of the said rule 6 in respect of Class-II officers of the secretariat cadre under the administrative control of the Department (See also entry No.45 under GAD).\n9. Anti-corruption.\n10. Vigilance Commission.\n11. National Integration.\n12. Withdrawal of prosecution.\n13. Home Guards Organizations.\n14. State Reserve Police.\n15. Civil Defence.\n16. Gram Rakhsak Dal.\n17. Police including Railway and Village Police.\n18. Bombay Lotteries (Control and Tax) and Prize Competition (Tax) Act, 1958.\n19. Betting and gambling.\n20. Offences against, laws with respect to any of the matters in the list.\n21. Prevention of cruelty to animals.\n22. Vagrancy, nomadic and migratory tribes.\n23. General work relating to the administration of the Cattle Trespass Act, 1871.\n24. Protection of crops from wild animals and human sources.\n25. Explosives.\n26. Exhumation, missing persons, estate deceased persons.\n27. Arms, firearms, and ammunition.\n28. Bills and Acts other than those pertaining to subjects dealt with in other departments.\n29. Field firing and artillery practice.\n30. Resettlement of ex-servicemen.\n31. Prisons and persons detained therein, arrangement with other states for the use of prison, deportation of ex-military convicts.\n32. Criminal Lunatics.\n33. Process serving on convicts and lunatics.\n34. Sainik fund and other civil activities relating to defense.\n35. Deleted (Date: 03/09/2005)\n36. Deleted. (Date: 03/09/2005)\n36-A. Prohibition on selling, letting on hiring of obscene advertisements, photographs, and posters for the purpose of publication or exhibition. (Date: 28/10/2004)\n37. Works, lands, and buildings vested in or in possession of Government purposes of the State and assigned to the Home Department.\n38. Inquiries and statistics for the purposes of any of the matters in this list.\n39. Fees for any of the items in this list, excluding those incurred for any tribunal.\n\n I trust this information is helpful. If you have any further inquiries, feel free to ask."]
        },
        {
            "tag": "industries_and_mines_department",
            "patterns": ["What subjects are allotted to the Industries and Mines Department?",
                         "Explain the roles of the Industries and Mines Department.",
                         "List the functions of the Industries and Mines Department.",
                         "Tell me about the Industries and Mines Department's responsibilities."],
            "responses": [
                "Subjects Allotted to the Industries and Mines Department: \n\n 1. Industries including Village Industries, Khadi, Handicraft and Hand‐loom Industries (See also entry No. 15 under L & ED).\n2. Industrial Co‐operatives and cottage industries subject to the provision of  List‐I\n3. Procurement and distribution of indigenous and imported scare raw materials including iron and steel items and non‐ferrous metalsfor industrial purposes.\n4. Trade and commerce and production and supply and distribution of goods and products of industries other than rural industries subject to the provision of List‐III.\n5. Trade promotion, publicity and research (See also entry No. 2 under I and BD and entry No. 51 under GAD).\n6. Industrial fairs, exhibition, and Government show rooms.\n7. Commercial intelligence and statistics within the State (Subject to provision of List‐I and III).\n8. Commercial publications including periodicals (See also entry No. 1 under I & BD and entry No. 51 under GAD).\n9. Protection of interests of traders within the State (Subject to provision of List I & III).\n10. Promotion of export of industrial goods (Subject to provision of List I & III).\n11. Procurement of Railway wagons, steamers, etc. for commercial and industrial units(See also entry No. 8 under R&BD).\n12. Administration of the Cotton Textile Control Order, 1948, issue and renewal of licences of yarn dealers, installation etc. of power‐loom running on cotton yarn and non‐cotton yarn (See also entry No. 3(f) under FCS & CAD).\n13. Administration of Cotton Textile Order, 1955 and issue and renewal of licences there under.\n14. Regulation of mines and mineral development to the extent to which such regulation and development under the control of the Central Government is declared by Parliament by law to be expedient in the public interest. (Date17/12/1990)\n15. Administration of the Gujarat Minor Mineral Rules, 1966.\n16. Taxes of mineral rights, subject to any limitation imposed by, Parliament by law relating to mineral development.\n17. Works in connection with industrial scheme.(Except Agricultural Industry policy) (Date14/06/2006)\n18. Manufacture and use power alcohol for industrial purposes (See also entry No. 6D under HD) (Date21/03/1997, Date05/08/1997)\n19. Distribution of coal and coke with its derivative and price control thereof under the Essential Commodities Act, 1955 (No. X of 1955) for industrial purposes, Manufacture and distribution of other essential commodities and price control there of under the Essential Commodities Acts (No. X Of 1955) for industrial purposes in so far as that relate to subject allotted to the department (See also entry No. 9 under H & FWD, entry No. 9 under A & CD and entry No. 3 F under FCS&CAD).\n20. Geological surveys.\n21. Deleted. (Date17/12/1990)\n22. Establishment of sugar factories.\n23. Salt.\n24. Stores. .\n25. Inventions, patents, designs and merchandise marks.\n26 Deleted, (Date17/12/1990)\n27. Deleted.(Date17/12/1990)\n28. Government printing presses, stationery and official publications (See also entry No. 1 under I & BD and entry No. 4 under ED).\n29. State undertaking and Government Corporations relating to subjects specified in this list including Gujarat industrial Development Corporation, Gujarat Industrial Investment Corporation, Gujarat State Textile Corporation, Gujarat Export Corporation, Gujarat Khadi and Gramodyog Board, Gujarat Mineral Development Corporation and Gujarat State Financial Corporation. (Date17/12/1990)\n29‐A Deleted. (Date08/02/1993, Date21/03/1997)\n30. Issue of notifications under the Gujarat Municipalities Act, 1963 in regard to matters relating to area notified as Industrial areas under section 16 of the Gujarat Industrial Development Act, 1962 (See also entry No. 1 under UD & UHD).\n30-A. Provision for budget and planning of Airways, aircrafts regulation and organisation of air traffic and of aerodromes, provisions for aeronautical education and training and regulation of such education and training provided by the State and other agencies. (Date11/11/1998, Date25/08/2004)\n30-B. Tourism including establishments, administration and development of Holidays Homes, Hotels and Hills Stations. (Date11/11/1998)\n31. (i) All matters pertaining to appointments, postings transfers, promotions, conduct, grant of leave, pension etc. in respect of all Gazetted Officers (other than those covered under entry No. 45 in the subjects allotted to the  GAD),  and non‐gazetted Government servants   under the administrative control of the department.\n(ii) all matters pertaining to grant of pension in respect of Class‐I and Class‐II Officers of the Secretariat Cadre under the administrative control of the department; and\n(iii) all matters pertaining grant of leave and to impose penalties as specified at serial numbers 1 and 2 of the rules 6 of the Gujarat Civil Services (Discipline and Appeal) Rules, 1971 and to institute Disciplinary proceedings for imposing penalties as specified at serial numbers 3 to 8 of the said rule 6 in respect of Class‐II Officers of the Department (See also entry 45 under GAD).\n32. Works lands and buildings vested in or in the possession of Government for the purposes of the State and assigned to the industries and Mines Department. (Date17/12/1990)\n33. Inquiries and statisticsforthe purposes of any ofthemattersin thislist.\n34. Fees in respect of any of the matters in this list but not including fees taken in any court.\n35. (a) Devsthan Management and pilgrimage development\n(b) The trusts registered under 'A' category as such under the administration of the Bombay Public Trust Act, 1950 and the Societies Registration Act, 1860, other than those mentioned in entry No. 32(e) under A&CD.\n(c) Trusts Registered under 'E' category as such under the Bombay Public Trusts Act, 1950 or under the Societies Registration Act, 1860 for the purpose of Religion and Dharamshalas, other than Panjarapole under A&D (Seeentry 32 (d)\n (d) Administration under the Bombay Public Trust Act, 1950 and the Societies Registration Act, 1860 So far asthey relate to the Trusts referred to in the aforesaid clauses (b) and (c) (See also entries Nos. 28 and 30 under (LD)\n (e) Pilgrimage other that the Pilgrimage to places out side India (a to e(Date03/09/2005))\n\n I hope this information is helpful. If you have any further questions, feel free to ask."]
        },
        {
            "tag": "legal_department",
            "patterns": ["What subjects are allotted to the Legal Department?",
                         "Explain the roles of the Legal Department.",
                         "List the functions of the Legal Department."],
            "responses": [
                "Subjects Allotted to the Legal Department:\n\n1 Deleted. (Date08/02/1993)\n2 Deleted. (Date08/02/1993)\n3 Deleted. (Date08/02/1993)\n4. (i to xi) Deleted. (Date08/02/1993)\n5. Deleted. (Date08/02/1993)\n6. Deleted. (Date08/02/1993)\n7. Criminal Law, including all matters included in the Indian Penal Code at the commencement of the Constitution but excluding offences against laws with respect to any of the matters specified in List I or II and excluding the use of Naval, Military and Air force and any other armed forces of the Union in aid of the Civil Power.\n8. Criminal procedure, including all matters included in the Code of Criminal procedure 1973 but excluding (i) appointment of Executive Magistrates, Special Magistrates, Sub Divisional Magistrates and District Magistrates under the said code and (ii) conferment of special powers on them, and withdrawal of such powers from them, under the said code (See also entry No. 5 under HD).\n9. Civil Procedure, including all matters included in the Code of Civil Procedure at the date of the commencement of constitution, the recovery in a State, of claims in respect of taxes and other public demands, including arrears of land revenue and sums recoverable as such arising outside the State.\n10. Evidence and oaths, recognition of law, public acts and records and judicial proceedings, State Law Reports.\n11. Marriage and divorce, infants and minors, adaptation (except) Registration of Marriage and the Child Marriage Restraint Act, 1929 (See also entry No. 1 under H and FWD and entry No. 12B under SJ & ED). (Date21/03/1997, Date25/06/1997)\n12. Wills, intestacy and successions save as regards agricultural lands, joint family and partition, all matters in respect of which parties in judicial proceedings were immediately before the commencement of the Constitution subject to their personal law.\n13. Contract, including partnerships, agency contracts of carriage and other special forms and contract but not including contracts relating to agricultural land.\n14. Arbitration.\n15. Bankruptcy and insolvency, Administrator General and official Trustee.\n16. Actionable wrongs.\n17. Examination of clauses of all bills relating to imposition by legislation of punishments by the fine, penalty or imprisonment, for enforcing any law of the State.\n18. Admiralty jurisdiction.\n19. Legal profession.\n19‐A. National Law University (Date23/04/2003)\n20. The Administration of Justice, constitution and organisation of all courts except the Supreme Court and the High Court, Officers and servants of the High Courts, fees taken in all Courts except Supreme Courts (See also entries Nos. 34 13 and 20 under the RD).\n21. Jurisdiction and powers of all courts except the Supreme Court.\n22. Pauper costs.\n23. Appointments, remuneration etc., of Public Prosecution, including Assistant Public Prosecutors, and the organisation of Directorate of Public Prosecution with all its affiliated Functions (Date28/10/2004)\n24. Conduct of Civil Litigation to which Government is a Party and appointment and remuneration of State Law Officers, Government Pleaders and Special counsels.\n25. Writing off of any decretal dues.\n26. Appeals against acquittals and applications to enhance sentences.\n27. Suits and summons including notices and execution of decrees etc.\n28. Administration of the Societies, Registration Act, 1860 Literary, Scientific, religious and other societies and associations. (Date14/06/1999, Date03/09/2005)\n29. Administration of Notaries Act, 1952.\n30. Trusts and trustees, administration of the Bombay Public Trust Act and the Charitable Endowment Act, Charities Charitable and religious institutions and endowments (including wakfs). (Date14/06/1999, Date03/09/2005)\n31. Administration for the Commissions of Inquiry Act, 1952 and matters arising there form.\n32. Deleted. (Date08/02/1993)\n33. (i) All matters pertaining to appointments, posting, transfers, promotions, conduct, grant of leave, pensions etc. in respect of all gazetted officers (other than those covered under entry No. 45 in the subjects allotted to the GAD) and non‐Gazetted Government servants  under the  administrative  control  of the Department;\n(ii) all matters pertaining to grant of pension in respect of Class‐1 and II Officers of the Secretariat Cadre under the administrative control of the department; and\n(iii) all matters pertaining to grant of leave and to impose penalties as specified at serial numbers‐1 and 2 of the rule 6 of the Gujarat Civil Service (Discipline and Appeal) Rules, 1971 and to institute disciplinary proceedings or imposing penalties as specified at serial numbers 3. to 8 of the said rule 6 in respect of Class‐U Officers of the Secretariat cadre under the administrative control of the Department (See also entry No. 45 under GAD).\n34. Works, lands and building vested in or in the possession of Government for purposes of the State and assigned to the Legal Department.\n35. Inquiries and statistics for the purpose of any of the matters in this list.\n36. Fees in respect of any of the matters in this list.",
                "Subjects Allotted to the Legal Department:\n\n1. Criminal Law, encompassing all matters within the Indian Penal Code at the commencement of the Constitution, excluding offenses against laws with respect to List I or II, and excluding the use of Naval, Military, and Air force and any other armed forces of the Union in aid of the Civil Power.\n2. Criminal procedure, covering all aspects of the Code of Criminal Procedure 1973, excluding the appointment of Executive Magistrates, Special Magistrates, Sub Divisional Magistrates and District Magistrates under the said code, and excluding the conferment of special powers on them, and withdrawal of such powers from them, under the said code (See also entry No. 5 under HD).\n3. Civil Procedure, including all matters within the Code of Civil Procedure at the date of the commencement of the constitution, the recovery in a State of claims in respect of taxes and other public demands, including arrears of land revenue and sums recoverable as such arising outside the State.\n4. Evidence and oaths, recognition of law, public acts and records and judicial proceedings, State Law Reports.\n5. Marriage and divorce, infants and minors, adaptation (except) Registration of Marriage and the Child Marriage Restraint Act, 1929 (See also entry No. 1 under H and FWD and entry No. 12B under SJ & ED). (Date: 21/03/1997, Date: 25/06/1997)\n6. Wills, intestacy and successions save as regards agricultural lands, joint family and partition, all matters in respect of which parties in judicial proceedings were immediately before the commencement of the Constitution subject to their personal law.\n7. Contract, including partnerships, agency contracts of carriage and other special forms and contract but not including contracts relating to agricultural land.\n8. Arbitration.\n9. Bankruptcy and insolvency, Administrator General and official Trustee.\n10. Actionable wrongs.\n11. Examination of clauses of all bills relating to imposition by legislation of punishments by the fine, penalty, or imprisonment, for enforcing any law of the State.\n12. Admiralty jurisdiction.\n13. Legal profession.\n14. National Law University (Date: 23/04/2003)\n15. The Administration of Justice, constitution, and organization of all courts except the Supreme Court and the High Court, Officers and servants of the High Courts, fees taken in all Courts except Supreme Courts (See also entries Nos. 34 13 and 20 under the RD).\n16. Jurisdiction and powers of all courts except the Supreme Court.\n17. Pauper costs.\n18. Appointments, remuneration, etc., of Public Prosecution, including Assistant Public Prosecutors, and the organization of Directorate of Public Prosecution with all its affiliated Functions (Date: 28/10/2004)\n19. Conduct of Civil Litigation to which Government is a Party and appointment and remuneration of State Law Officers, Government Pleaders and Special counsels.\n20. Writing off of any decretal dues.\n21. Appeals against acquittals and applications to enhance sentences.\n22. Suits and summons including notices and execution of decrees etc.\n23. Administration of the Societies, Registration Act, 1860 Literary, Scientific, religious and other societies and associations. (Date: 14/06/1999, Date: 03/09/2005)\n24. Administration of Notaries Act, 1952.\n25. Trusts and trustees, administration of the Bombay Public Trust Act and the Charitable Endowment Act, Charities Charitable and religious institutions and endowments (including wakfs). (Date: 14/06/1999, Date: 03/09/2005)\n26. Administration for the Commissions of Inquiry Act, 1952 and matters arising therefrom.\n27. Deleted. (Date: 08/02/1993)\n28. (i) All matters pertaining to appointments, posting, transfers, promotions, conduct, grant of leave, pensions etc. in respect of all gazetted officers (other than those covered under entry No. 45 in the subjects allotted to the GAD) and non‐Gazetted Government servants under the administrative control of the Department;\n29. all matters pertaining to grant of pension in respect of Class‐1 and II Officers of the Secretariat Cadre under the administrative control of the department; and\n30. all matters pertaining to grant of leave and to impose penalties as specified at serial numbers‐1 and 2 of the rule 6 of the Gujarat Civil Service (Discipline and Appeal) Rules, 1971 and to institute disciplinary proceedings or imposing penalties as specified at serial numbers 3. to 8 of the said rule 6 in respect of Class‐U Officers of the Secretariat cadre under the administrative control of the Department (See also entry No. 45 under GAD).\n31. Works, lands and building vested in or in the possession of Government for purposes of the State and assigned to the Legal Department.\n32. Inquiries and statistics for the purpose of any of the matters in this list.\n33. Fees in respect of any of the matters in this list"
            ]
        },
        {
            "tag": "labour_and_employment_department",
            "patterns": ["What subjects are allotted to the Labour and Employment Department?",
                         "Explain the roles of the Labour Department.",
                         "List the functions of the Employment Department.",
                         "Tell me about the Labour and Employment Department's responsibilities."],
            "responses": [
                "Subjects Allotted to the Labour and Employment Department:\n\n 1. Welfare of labour including conditions of labour provident funds and amenities for labour.\n2. Workmen's compensation, employer's liability invalid and old age pensions.\n3. Industrial and labour disputes including conciliation and adjudication and arbitration strike and lockouts.\n4. Administration of the Bombay Relief Undertakings (Special Provisions) Act, 1958.\n5. Registration of Trade Unions.\n6. Minimum Wages and Payments of wages.\n7. Employee's State Insurance (Except medical institutions) (See also entry No. 12 under H & FWD).\n8. Employment and unemployment (See also entry No. 25 under RD and entries Nos. 19 and 23 under SJ & ED).\n9. Conditions of services etc. in shops and commercial establishments.\n10. Jurisdictions and powers of Wages Boards. (Date24/12/2002)\n11. Employment exchange organisation.\n12. Vocational and Technical Training of Labour including training for physically handicapped (See also entries Nos. 19 and 23 under SJ & ED).\n13. Factories.\n14. Boilers and smoke nuisances.\n15. Industrial safety and health industrial accident; and the prevention of hazardous to the community arising from the handling manufacture and storage of materials and substances in existing industrial units (See also entries No. 5 and 6A under HD, entry No. 1 under I & MD, entries Nos. 1, and 10 under H & FWD and entries Nos. 9, 10, 11 and 12 under F & ED). (Date21/03/1997, Date05/08/1997)\n16. (i) All matters pertaining to appointments, postings, transfers, promotions, conducts, grant of leave, pension etc. in respect of all Gazetted Officers (other than those covered under entry No. 45 in the subjects allotted to the GAD) and non‐Gazetted Government Servants under the administrative control of the Department.\n(ii) all matters pertaining to grant of pension in respect of class‐I and II officers of the secretariat Cadre under the administrative control of the Department; and\n(iii) all matters pertaining to grant of leave and to impose penalties as specified at serial numbers 1 and 2 of rule 6 of the Gujarat Civil Services, (Disciplinary and Appeals) Rules, 1971, and to institute disciplinary proceedings for imposing penalties as specified at serial numbers 3 to 8 of the said rule 6 in respect in Class‐U Officers of the Secretariat Cadre under the administrative control of the Department (See also entry No. 45 under G.A.D.)\n32\n17. Works, lands and buildings vested in or in possession of Government for purposes of the State and assigned to the Labour and Employment Department.\n18. Inquiries and statistics for purposes of any matters in this list.\n19. Fees in respect of any of the matters in this list but not including fees taken in any court."
            ]
        },
        {
            "tag": "information_and_broadcasting_department",
            "patterns": ["What subjects are allotted to the Information and Broadcasting Department?",
                         "Explain the roles of the Broadcasting Department.",
                         "List the functions of the Information Department.",
                         "What areas fall under the Information and Broadcasting Department?"],
            "responses": [
                "Subjects Allotted to the Information and Broadcasting Department: \n\n 1. Newspapers, books and printing presses including the Press and Registration of Books Act, 1967 and other legislation dealing with printed matters and censorship relating thereto (See also entry No. 4 under ED and entry No. 28 under I & MD)\n2. Publicity Directorate of Information and the Office of the Examiner of Books and Publications (See also entry No. 51 under GAD and entry No. 5 and 8 under I & MD)\n3. The sanctioning of cinematograph films for exhibition.\n4. Licensing of theatres, dramatic performances and cinemas encouragement of the productions and distribution of India Film and grant of financial assistance to producers of films on social, cultural, historical and other aspects of Gujarat (See also entry No. 5 under SY & CAD). (Date17/12/1990)\n5. The exhibition and use of educational, scientific and recreational films.\n6. Establishment of film studios and laboratories.\n7. Taxes on luxuries including taxes on entertainments, amusements betting and gambling.\n8. Broadcasting including censorship.\n8‐A. Deleted.[(Date21/03/1997, Modify Date25/06/1997), Date20/03/1998)]\n9. Deleted. (Date11/11/1998)\n10. (i) All matters pertaining to appointments, postings transfers, promotions, conduct, grant of leave, pension etc. in respect of all Gazetted Officers (Other than those covered under entry No. 45 in the subjects allotted to the GAD) and Non‐Gazetted Government Servants under the administrative control of the department.\n(ii) all matters pertaining to grant of pension in respect of Class‐I and II Officers of the Secretariat cadre under the administrative control of the department; and\n(iii) all matters pertaining to grant of leave and to impose penalties as specified at serial numbers 1 and 2 of the rule 6 of the Gujarat Civil Services (Discipline and Appeals) Rules, 1971, and to institute disciplinary proceedings for imposing penalties as specified at serial numbers 3 to 8 of the said rule 6 in respect of Class‐II Officers of the Secretariat Cadre under the administrative control of the department (See also entry No. 45 under GAD).\n11. Works, lands and buildings vested in or in the possession of Government, for purposes of the State and assigned to the information and Broadcasting Department. (Date11/11/1998)\n12. Inquiries and statistics for the purposes of any of the matters in this list.\n13. Fees in respect of any of the matters in this list but not including fees taken in any court."
            ]
        },
        {
            "tag": "narmada_water_resources_department",
            "patterns": ["What subjects are allotted to the Narmada, Water Resources Water Supply Department?",
                         "Explain the roles of the Narmada, Water Resources Water Supply and Kalpsar Department.",
                         "List the functions of the Narmada, Water Resources Water Supply and Kalpsar Department.",
                         "Tell me about the Narmada, Water Resources Water Supply and Kalpsar Department's responsibilities."],
            "responses": [
                "Subjects Allotted to the Narmada, Water Resources Water Supply and Kalpsar Department: \n\n1. Water, that is to say, water supplies, irrigation and canals, drainage and embankment, water storage and water power relating to all projects in the State, including Sardar Sarovar Project and projects connected with diversion of water of enroute rivers the command area of Sardar Sarovar Project. For the purpose of judicious utilization of water administrative budgetary and accounting functions related to advanced irrigation methods like drip/sprinkler and micro irrigation subject to the provisions of list‐I . (Date18/03/2005)\n1‐A. All function related to Gujarat‐'Green Revolution company (Date18/03/2005)\n2. Lift Irrigation (except by societies falling within the mining of that term under the Gujarat Co‐operative Societies Act, 1961 and Persons other than Corporate Bodies) and Tube wells including Tube Wells connected with Sardar Sarovar Project other than lift Irrigation (See also entry No. 16 under A & CD).\n3. Budget and accounts under Irrigation heads including budgets and accounts relating to Sardar Sarovar Project.\n4. Deleted. (Date08/02/1993)\n5. All matters relating to command area development organisation including those relating to Sardar Sarovar Project (See also entry No. 1 under A & CD).\n6. Matters connected with Rehabilitation of People affected by Sardar Sarovar Project.\n7. Matters connected with land acquisition relating to Sardar Sarovar Project (See also entry No. 15 under RD).\n8. Matters connected with planning programmes and monitoring of afforestation activities in the catchment and command area of Sardar Sarovar Project (See also entry No. 1 under F & ED, entry No. 10 under RD and entry No. 6 Under R & BD).\n9. Matters connected with development of fisheries in Sardar Sarovar and Water storage related to Sardar Sarovar Project and other connected projects (See entry No. (3) under (A & CD). (Date30/05/1994, Date03/09/2005)\n10. Execution and maintenance on behalf of the Central Government of such works debitable to Central Revenue as may be entrusted to the Government of Gujarat as the agent of that Government Budgets and Accounts connected with those works if any (See also entry No. 10 under RD and entry No.6under R & BD).\n11. Works, lands and buildings vested in or in the Possession of Government for the purpose of the State and assigned to the Narmada Water Resources Water Supplies and Kalpsar Department. (Date21/03/1997)\n12. Works, lands and buildings Vested in or in the Possession of Government for the purpose of the Union (including Naval, Military and Air Force Works) and be assigned to the Narmada Water Resources, Water Supplies and Kalpsar Department. (See also entry No. 10 under RD and entry No. 6 under R & BD). (Date21/03/1997) 12‐A. Investigation and execution of Hydroelectric Project ( See Entry No.4 under E & P C D) (Date10/05/2007)\n13. Matters relating to registration of Contractors and Suppliers and other ancillary matters.\n13 (a) Village water supply for human beings as well as for cattle and Government water supply schemes and water works. (Date21/03/1997) (a to e)\n(b) Preparation and execution of sanitary projects such as water supply drainage, boring etc. when required to be done by Government agency for municipalities and local bodies and Government.\n(c) Budget and accounts under public health head.\n(d) Water Tanker organisation.\n(e) Accounts and Estimates of Gujarat Water Supply and Sewerage Board and water Tanker organisation.\n(f) Kalpsar Project Division. (Date23/05/2003) (14) (i) All matters pertaining to appointments, postings, transfers, promotions, conduct, grants of leave, pension etc. in respect of all Gazetted Officers (other than those covered under entry No. 45 in the subjects allotted to the GAD) and non‐gazetted Government servants under administrative control of the Department.\n(ii) All matters pertaining to grant of pensions in respect of class‐I and II Officers of the Secretariat Cadre under the administrative control of the Department and\n(iii) All matters pertaining to grant of leave and to impose penalties as specified at serial number 1 and 2 of rule 6 of the Gujarat Civil Services (Discipline and Appeal) rules, 1971 and to institute disciplinary proceedings for imposing penalties as specified at serial numbers 3 to 8 of the said rule‐6 in respect of Class‐II officers of the Secretariat cadre under administrative control of the department (See also entry No. 45 under GAD).\n15. Inquiries and statistics for the purpose of any of the matters in this list.\n16. Fees in respect of any of the matters in this list, but not including Fees taken in any Court.\n\nI hope this helps! ask me if you have more questions."
            ]
        },
        {
            "tag": "panchyats_rural_housing_department",
            "patterns": ["What subjects are allotted to the Panchyats, Rural Housing and Rural Development Department?",
                         "Explain the roles of the Panchyats and Rural Development Department.",
                         "List the functions of the Panchyats, Rural Housing and Rural Development Department.",
                         "Tell me about the Panchyats and Rural Housing responsibilities.",
                         "What areas fall under the Panchyats, Rural Housing and Rural Development Department?"],
            "responses": [
                "Subjects Allotted to the Panchyats, Rural Housing and Rural Development Department:\n\n 1. Community Development Projects.\n2. National Extension Services.\n3. Rural Development including District Development Board, Local Development Works.\n4. Sarvodaya.\n5. The Panchayat Organisation of the State.\n6. All matters connected with local boards (Except roads).\n7. Loans to Local Bodies.\n8. Capitation taxes on professions, trades callings and employment on animals and boats, taxes on the sale or purchase of goods other than newspapers, on advertisements other than advisements published in newspapers, in so far as they are levied by local bodies(See also entry No. 18 Under RD).\n9. Cesses on the entry of goods into local areas for consumption use or sale therein.\n10. Taxes on lands and buildings (so far as they are levied by local self governing bodies).\n11. Terminal taxes on goods, on passengers, carried by Railways Sea or Air (See also entry No. 9 under FD).\n12. Markets and fairs.\n13. Inns and innkeepers.\n14. Village Housing Schemes.\n15. Administration of the Gujarat Rural Housing Board Act, 1972, and matters arising therefrom.\n16. Grant House sites free of charge to the landless laborers in the rural areas both under the Central and the State Governments schemes (See also entry No. 4 under RD).\n16. (a) Block level plans [Date21/03/1997 (a) to (d)] (b) Food for works programmes. (c) Antyoday (See entry No. 3 under SJ & ED). (d) Centrally Sponsored Schemes concerning Rural Development. (e) Rural Sanitation Programme. (Date05/07/2003)\n17. (i) All matters pertaining to appointments, postings, transfers promotions, conduct, grant of leave, Pension etc. in respect of all Gazetted Officers (Other than those covered under entry No. 45 in the subjects allotted to the GAD) and non‐Gazetted Government Servants under the administrative control of the Department. \n(ii) All matters pertaining to grant of pension in respect of Class‐I and II officers of the Secretariat cadre under the administrative control of the departments and \n(iii) All matters pertaining to grants of leave and to impose penalties as specified at serial number 1 and 2 of rules 6 of the Gujarat Civil Services (Discipline and Appeal) Rules, 1971 and to institute disciplinary proceedings for imposing penalties as specified at serial number 3 to 8 of the said rule 6 in respect of Class‐II Officers of the Secretariat cadre under the administrative 38 control of the Department (See also entry No. 45 under GAD).\n18. Works, Lands and buildings vested in the possession of Government for the purposes of the State and assigned to the Panchayats, Rural Housing and Rural Development Department.\n19 Inquiries and statistics for the purpose of any of the matters in this list.\n20. Fees in respect of any of the matters in the list but not including fees taken in any court.\n\n I hope this helps! Let me know if you have more questions."
            ]
        },
        {
            "tag": "revenue_department",
            "patterns": ["What subjects are allotted to the Revenue Department?",
                         "Explain the roles of the Revenue Department.",
                         "List the functions of the Revenue Department.",
                         "Tell me about the Revenue Department's responsibilities."],
            "responses": [
                "Subjects Allotted to the Revenue Department: \n\n1. Territorial changes within the State.\n2. Boundary disputes involving other States.\n3. The Survey of India.\n4. Land that is to say rights in or over land, tenures including the relation of landlord and tenants including loans to tenants in the implementation of tenancy Act, and collection of rent and transfer of land alienation of agricultural land, tagavi loans to Agriculturists and to others who suffer in the natural calamity, treasure trove (see also entry No. 6‐A under A & CD and entry No. 16 under PRH & RDD). (Date08/02/1993)\n5. Land Revenue including the assessment and collection of revenue the maintenance of land records, survey for revenue, purposes and record of right and alienation of revenue.\n6. Taxes on agricultural income.\n7. State taxes on lands, and building excluding taxes levied by local self Governing bodies.\n8. Duties in respect of succession to agricultural lands.\n9. Lands development outside municipal limits.\n10. Lands of the Central Government (See also entries No. 8, 10 & 12 under NWR WS&KD and entry No. 6 under R & BD).\n11. Consolidation of holdings.\n12. Works in connection with landsscheme.\n13. Courts of appeal in revenue cases, procedure in courts of appeal in revenue matters including the procedure in revenue courts (See also entry No. 20 under LD).\n14. Mamlatdar's Court Act.\n15. Acquisition of property, principals on which compensation for property acquired for the purpose of the state or for any other public purposes is to be determined and the form and manner in which such compensation is to be 'given' acquisition of Immovable property for defence purposes under Defence of India [(Requisition and Acquisition of Immovable property Rules, 1971) (See also entry No. 12 under R & BD and entry No. 6 under NWR WS&KD)].\n16. Purchase of surplus military hutments.\n17. Tobacco duty.\n18. Capitation taxes on professions trades, callings and employment on animals and boats, taxes on advertisements other than advertisements published in newspapers (See also entry No. 8 under PRH & RDD).\n19. The rate of stamps duty in respect of documents other than those specified in the provisions of list‐I with regard to rates of stamps duty.\n20. Stamps duties other then duties or fees collected by means of judicial stamps, but not including rates of stamps duty, stamps, judicial and non‐judicial and the duties collected thereby (See also entry No. 20 under LD).\n21. Prevention of forced labour Impressments of carts.\n22. Transfer of property other than agricultural landsregistration deeds and documents.\n23. Famine relief and preventive measure against food scarcity.\n24. Relief on account of fire, flood and other natural or general calamities etc. Emergency Relief Organisation. (See also entry No.20 under A &CD).\n25. Scheme, for providing employment to agricultural labour in rural areas during off season, (See also entry No. 8 under L & ED).\n26. Housing Scheme, township and colonies for displaced persons and their rehabilitation.\n27. Provision of work and training facilities to displaced persons.\n28. Administration of the Evacuee Property Act, Interest (Separation) Act, Bombay Refugee Act, Bombay Displaced persons premises Control and Regulation Act, 1952 and the Enemy Property Act, 1968.\n29. Matters pertaining to grant of compensation to displaced persons and 'Displaced Persons(Compensation and Rehabilitation) Act, 1954.'\n30. Urban Loans Scheme (Refugees) and Burma evacuee advances,\n31. Relief and rehabilitation of India National repatriated from Mozambique, Burma, Zanzibar, East Africa and Ceylon.\n32. (i) Deleted. (Date29/07/2005) \n(ii) All matters pertaining to appointment, postings, transfers, promotions, conduct, grant of leave, pensions etc. in respect of all gazetted officers (other than those covered under entry No. 45 in the subject allotted to the GAD) and non‐gazetted Government servants under the administrative control of the Department; \n(iii) All matters pertaining to grant of pension in respect of Class‐I and II Officers of the Secretariat cadre under the administrative control of the department; and \n(iv) All matters pertaining to grant of leave and to impose penalties as specified at serial numbers 1 and 2 of rule 6 of the Gujarat Civil Services (Discipline and Appeal) Rules, 1971, and to institute disciplinary proceedings for imposing penalties as specified at serial numbers 3 to 8 of the said rule 6 in respect of Class‐II Officers of the secretariat Cadre under the administrative control of the Department ( See also entry No.45 under GAD).\n33. Works, lands and buildings vested in, or in the possession of Government for the purposes of the State and assigned to the Revenue Department.\n34. Inquiries and statistics for the purpose of any of the matters in this list.\n35. Fees in respect of any of the matters in this list but not including fees taken in any court.\n36. Advance planning for Disaster Preparedness and long term planning for Rehabilitation and reconstruction policy and planning & Implementation of schemes thereunder though existing available administration and field network. (Date03/09/2005).\n\nI hope this helps! Let me know if you have more questions."
            ]
        },
        {
            "tag": "roads_building_department",
            "patterns": ["What subjects are allotted to the Roads and Building Department?",
                         "Explain the roles of the Roads and Building Department.",
                         "Tell me about the Roads and Building Department's responsibilities."],
            "responses": [
                "Subjects Allotted to the Roads and Building Department: \n\n 1. Works, lands and buildings vested in or in the possession of Government for purpose of the State other than those assigned to any other department.\n2. Construction and maintenance of electrical installation in Government buildings (See entry No. 4 under E & PCD). (Date17/12/1990, Date10/05/2007)\n3. All works expenditure of the residence of the Governor under '259‐Public Works.'\n4. Execution and maintenance on behalf of the Central Government of such works debitable to Central Revenue as may be entrusted to the Government of Gujarat as the agent of that Government and budget and accounts connected with those works, if any.\n5. Village telephone system (see also entry No. 34 under GAD and entry No. 7 under HD).\n6. Works, lands and buildings vested in or in the possession of Government for the purpose of the Union (including Naval, Military and Air force works) (see also entry No. 10 under RD. Entries Nos. 8 and 10 under NWRWS & KD).\n7. Communications, that is to say roads (including village approach roads (bridges, feries and other means of communications not specified in list I, minor railways, subject to the provision of list‐I with respect to such railways, municipal tramways, ropeways (See also entry No, 35 under HD). (Date03/09/2005)\n8. Transport/Movement of goods/Materials on behalf of Government in under general orders issued by Railway Board (See also entry No. 11 under I & MD).\n9. Tolls.\n10. Accommodation for Government Officers in the City of Ahmedabad.\n11. Residential Accommodation for the Ministers, Deputy Ministers and Parliamentary Secretaries in the city of Gandhinagar.\n11‐A. Parks and gardens. (Date01/12/1993)\n11‐B. Construction and maintenance of airstrips and helipads for the state Government and the work relating to the budget provisions and planning therefore. (Date25/08/2004)\n12. Accommodations, The Bombay Land Requisition Act, 1948 requisitioning of Immovable property. for defence purpose under defence of India (Requisitioning and Acquisition of Immovable Property) Rule, 1971 (See entry No. 15 under RD).\n13. Gujarat Housing Development Corporation Ltd.\n14. Deleted. (Date21/03/1997)\n15. Control of building materials and buildings constructions.\n16. Matters relating to registration of contractors and suppliers and other ancillary matters.\n17. Railways.\n17‐A. Deleted. [(Date25/06/1997, Modify Date20/03/1998), Date11/11/1998]\n18. Deleted. (Date21/03/1997)\n19. Budgets and accounts under roads and buildings heads.\n20 Deleted. (Date30/05/1994)\n21. Deleted. (Date30/05/1994)\n22. Deleted. (Date30/05/1994) \n23. Deleted. (Date30/05/1994) \n24. Deleted. (Date30/05/1994) \n25. Deleted. (Date30/05/1994) \n26. Deleted. (Date30/05/1994) \n27. Deleted. (Date30/05/1994) \n28. (i) All matters pertaining to appointments postings, transfers, promotions, conduct, grant of leave, pension etc. in respect of all Gazetted Officers (Other than those covered under entry No. 45 in the subjects allotted to the (GAD) and non  ‐  Gazetted Government Servants under the administrative control of the department. \n(ii) All matters pertaining to grant of pension in respect of Class‐1 and II Officers of the Secretariat cadre under die administrative control of die Department; and \n(iii) All matters pertaining to grant of leave and to impose penalties as specified at serial number 1 and 2 of rules 6 of the Gujarat Civil Services (Discipline and Appeal) Rules, 1971, and to institute disciplinary proceedings for imposing penalties as specified at Serial, numbers 3 to 8 of the said rule 6 in respect of Class‐II Officers of the Secretariat cadre under the administrative control of the department (See also entry No. 45 under GAD).\n29. Matters (including establishment matters) pertaining to the former Public works Department.\n30. Inquiries and statistics for the purpose of any of the matters in thislist.\n31. Fees in respect of the any of the matters in this list, but not including fees taken in any court.\n\nI hope this helps! Let me know if you have more questions."]
        },
        {
            "tag": "social_justice_empowerment_department",
            "patterns": ["What subjects are allotted to the Social Justice Department?",
                         "What subjects are allotted to the Empowerment Department?",
                         "Explain the roles of the Social Justice and Empowerment Department.",
                         "List the functions of the Social Justice and Empowerment Department."],
            "responses": [
                "Subjects Allotted to the Social Justice and Empowerment Department: \n\n1. Administrative machinery for backward class, special welfare and tribal welfare.\n2. Matters relating to linguistic minorities.\n3. Pension part of the Antyodaya Programme (See also entry No. 16A(c) PRH & RDD). (Date21/03/1997)\n4. Co‐ordination of welfare work relating to the backward classes including the schedule castes, nomadic tribe and other backward classes. (Date18/05/2009)\n5. Deleted  (Date18/05/2009)\n6. Deleted  (Date18/05/2009)\n7. Deleted  (Date18/05/2009)\n8. Deleted  (Date18/05/2009)\n9. Scheduled Castes Welfare Board. (Date21/03/1997)\n10. Administration of the Untouchability (offences) Act, 1955.\n11. Administration of the Hindu Places of Public Worship Entry (Authorisation) Act, 1956.\n12. Backward class hostels other than those for Schedule Tribes.\n12‐A. Maintenance and care of displaced, unattached women and children, the aged and the infants including setting up of homes and infirmaries for them. (Date25/06/1997)\n12‐B. Administration of the Child Marriage Restraint Act, 1929 (See also entry No. 11 under LD and entry No. 1 under H & FWD). (Date25/06/1997)\n12‐C. Juvenile delinquency and after‐care for juveniles (see also entry No. 10 under H & FWD). (Date25/06/1997)\n12‐D. Deleted.  (Date25/06/1997, Date31/12/2001)\n12‐E. The Orphanages and other Charitable Homes (Supervision and Control) Act, 1960. (Date25/06/1997)\n12‐F. Deleted. (Date25/06/1997, Date31/12/2001)\n12‐G. Deleted. (Date25/06/1997, Date31/12/2001)\n12‐H. Deleted. (Date25/06/1997, Date31/12/2001)\n13. Deleted. (Date21/03/1997)  \n14. Deleted. (Date31/12/2001)\n15. Training for, and research in, social work including socio economic surveys.\n16. Co‐ordination of social work activities.\n17. Deleted. (Date21/03/1997)\n18. All work pertaining to social Welfare which is not specifically allotted to any other department.\n19. Institutions of beggars including the administration of the Beggars Act and Rules, release detained beggars, permits for begging etc. (See also entry No. 8 under L & ED).\n20. After   care   programme   for   released   adult   prisoners, workhouses, Salvation Army House (Reformatory), Prisoners and Societies.\n21. Rescue homes and rescue work.\n22. Reformatory Schools. 44 23. Problems relating to the blind, the deaf and the dumb and the mentally retarded (See also entries Nos. 8 and 12 under L & ED.\n24. Deleted.(Date21/03/1997)\n25. Deleted.(Date21/03/1997)\n26. Deleted.(Date21/03/1997)\n27. Bharat Sevak Samaj.\n28. Deleted.Date(21/03/1997) \n29. Deleted.Date(21/03/1997)\n30. Deleted.Date(21/03/1997)\n31. Deleted.Date(21/03/1997)\n32. Deleted.Date(21/03/1997)\n33. (i) All matters pertaining to appointment, transfer, promotions, conduct, grant of leave, pension etc. in respect of all Gazetted Officers (other than those covered under entry No. 45 in the subject allotted to the GAD)   and non‐Gazetted government servants under the   administrative control of the department;\n(ii) all matters pertaining to grant pension in respect of Class I and II Officers of the Secretarial cadre under the administrative control of the department; and\n(iii) all matters pertaining to grant of leave and to impose penalises as specified at serial numbers 1 and 2 of rule 6 of the Gujarat Civil Services (Discipline and Appeal) Rules, 1971, and to institute disciplinary proceedings for imposing penalties as specified at serial numbers 3 to 8 of the said rule 6 in respect of Class‐II Officers of the Secretariat cadre under the administrative Control of the Department (See also entry No. 45 under GAD.)\n34 Works, lands and buildings vested in or in the possession of the Government, for purposes of the State and assigned to the Social Justice and Empowerment Department. (Date11/12/1998)\n35. Inquiries and statistics for purpose of any of the matters in thislist.\n36. Fees in respect of any of the matters in this list but not including fees taken in any court.\n\n I hope this helps! Let me know if you have more questions."
            ]
        },
        {
            "tag": "urban_development_housing_department",
            "patterns": ["What subjects are allotted to the Urban Development Department?",
                         "What subjects are allotted to the Urban Housing Department?",
                         "Explain the roles of the Urban Development and Urban Housing Department.",
                         "Urban Development and Urban Housing Department's responsibilities."],
            "responses": [
                "Subjects Allotted to the Urban Development and Urban Housing Department:\n\n 1. Local Self Government, that is to say, the constitution and powers of Municipal Corporation, Municipalities, Improvements trust, mining settlement authorities and other local authoritiesfor the purposes of Local Self Government (See also entry No. 30 under I & MD).\n2. Local Self Government its cantonment area, the regulation of houses, accommodation (including control of rents) in such areas and within, India, the delimitation of such areas (except appointment of Judicial Officers in Cantonments) (See also entry No. 12 Under R &BD).\n2‐A. Bombay Rent, Hotel and Lodging House Rates Control Act, 1947. (Date21/03/1997)\n3. Administration of the Gujarat Municipal Finance Board Act, 1979 and matters arising therefrom.\n4.  Cesses on the  entry  of goods  into  local  areas  for consumption use or sale therein.\n5.  Taxes on lands and buildings (so far as they are Levied by local self governing bodies.)\n6. Education Cess.\n7. Terminal   taxes   on  goods,   on  passengers  carried  by railways, sea or air (See also entry No. 9 under FD).\n8. Town Planning Schemes.\n9. Town Planning and Valuation Department.\n10. City‐Co‐ordination Council for Ahmedabad, Vadodara and Surat and Co‐ordination Committee for Gandhidham.\n11. Deleted. (Date14/06/1999)\n12. Burials and Burial grounds, cremation and Cremation grounds, including European cemeteries.\n13. Housing Schemes and Sweepers Housing Law Income Group Housing Scheme in  its application to individuals,  Co‐operative Societies, institutions etc.\n14. Housing including industrial housing   and grant of assistance of Co‐operative Societies under the low income group and slum clearance; schemes grant of assistance to local bodies under the low income group.\n15. Subsidies Industrial Housing Schemes so far it relates to Co‐operative Housing Societies of industrial workers and employees.\n16. Administration of the Gujarat Housing Board Act, 1961 and matter arising therefrom.\n17.   Administration of Gujarat Slum Areas (Improvement, Clearance and Redevelopment) Act, 1973 and matters arising therefrom.\n18. (i) All matters pertaining to appointment posting transfers, promotions, conduct, grant of leave, pension etc. in respect of all Gazetted Officers (other than those covered under entry No. 45 in the subjects allotted to the GAD) and non‐Gazetted Governmentservants under the   administrative  control of the Department.\n(ii) all matters pertaining to grant of pension in respect of Class‐I and II Officer of the Secretariat cadre under the Administrative control of the department; and\n(iii) all matters pertaining to grant of leave and to impose penalties as specified at Serial numbers 1 and 2 of rule 6 of the Gujarat Civil Services (Discipline and Appeal), Rules 1971, and to institute, disciplinary proceedings for imposing penalties as specified at serial numbers 3 to 8 of the said rule 6 in respect of Class‐II Officers of Secretariat cadre under the administrative control of the Department (See also entry No. 45 under GAD).\n19. Works, lands and building vested in or in the possession of the Government, for purposes of the State and assigned to the Urban Development and Urban Housing Department.\n20. Inquires and statistics for purpose of any of the matters in this list.\n21. Fees in respect of any of the matters in this but not including fees taken in any court.\n\n I hope this helps. Is there anything else I can help you with?"
            ]
        },
        {
            "tag": "sports_youth_cultural_activities_department",
            "patterns": ["What subjects are allotted to the Sports, Youth and Cultural Activities Department?",
                         "List the functions of the Sports, Youth and Cultural Activities Department.",
                         "Tell me about the Sports, Youth and Cultural Activities Department's responsibilities."],
            "responses": [
                "Subjects Allotted to the Sports, Youth and Cultural Activities Department:\n\n1. Museums.\n2. Ancient and historical monuments and archaeological sites and remains other than those declared by parliament by law to be of national importance.\n3. Deleted. (Date01/12/1993)\n4. Youth Welfare.\n5. Recreation and leisure time activities including cultural activities and sports, cultural delegations etc. visiting the State (See also entry No. 4 under I & BD).\n5‐A. Libraries and other similar institution controlled or financed by the State, registration of libraries. (Date21/03/1997)\n5‐B. Records and manuscripts. (Date21/03/1997)\n5‐C. (a) Centenaries Celebration and Monuments. (Date21/03/1997) \n   (b) Academies. (Date21/03/1997) \n    (c) State Gazetteers, Memoirs (Date20/01/2005) \n   (d) Official Languages (Including all the activities along with establishment of the Directorate (Date02/06/2005)\n6. (i) all matters pertaining to appointments, postings, transfers, conduct, grant of leave, pension, etc. in respect of all Gazetted, Officers (other than those covered under entry No. 45 in the subject allotted to the GAD) and Non‐gazetted Government Servants under the administrative control of the Department; \n(ii) all matters pertaining to grant of pension in respect of Class‐I and II Officers of the Secretariat Cadre under the administrative control of the Department; and \nn(iii) all matters pertaining to grant of leave and to impose penalties as specified at serial numbers 1 and 2 of rule 6 of the Gujarat Civil Services (Discipline and Appeal) Rules, 1971 and to institute disciplinary proceedings for imposing penalties as specified at serial numbers 3 to 8 of the said rule in respect of Class‐II Officers of the Secretariat Cadre under the administrative control of the Department (See also entry No. 45 under GAD).\n7. Works, lands and buildings vested in or in the possession of Government for purposes of the State and assigned to the Sport, Youth and Cultural Activities Department. (Date21/03/1997, Date05/08/1997)\n8. Inquiries and statistics for purposes of any of the matters in this list.\n9. Fees in respect of any of the matters in this list but not including fees taken in any Court.\n\n I hope this helps! & if you have any more questions, feel free to ask me!"
            ]
        },
        {
            "tag": "energy_petro_chemicals_department",
            "patterns": ["What subjects are allotted to the Energy and Petro‐Chemicals Department?",
                        "subjects are allotted under the Energy department",
                        "subjects are allotted under the Petro‐Chemicals department",
                         "Tell me about the Energy and Petro‐Chemicals Department's responsibilities.",
                         "What areas fall under the Energy and Petro‐Chemicals Department?"],
            "responses": [
                "Subjects Allotted to the Energy and Petro‐Chemicals Department:\n\n 1. Regulation of oil and natural gas fields and development to the extent which such regulation and development under the control of the Central Government is declared by Parliament by Law to be expedient in the public interest.\n2. Taxes of Minerals Rights of Crude Oil and Natural Gas Fields subject to any limitation imposed by Parliament by Law relating to crude oil and natural gas development.\n3. Gas and Gas Works.\n3‐A. Coal Bed Methane (C.B.M.) (Date01/09/2003)\n4. Electricity, Electricity Duty, Administration of Indian Electricity Act, 1910, Electricity (Supply) Act, 1948, Bombay Electricity (Special Power) Act, 1946 and Bombay Lift Act, 1939 (See also entry No. 2 under R & BD & entry No. 12‐A under N W R W & K D ). (Date10/05/2007)\n4‐A   Implementation of order of the Government of India under section 3 of the Essential Commodities Act, 1955 in relation to regulation of manufacture, store, sale and distribution of lamps, Electrical accessories for domestic use and prescribing quality thereof, (Date28/06/2000)\n5. Deleted. (Date17/09/2009)\n6. State Undertakings and Government Corporations relating to subjects specified in this list including Gujarat Electricity Board, Gujarat State Petrochemicals Corporation Ltd, Gujarat Power Corporation Ltd ( Except Gujarat Energy Development    Agency (GEDA) ( See also entry No. 17 under CL C D). (Date17/09/2009)\n7. (i) all matters pertaining to appointments, postings, transfers, promotions,   conduct, grant of leave, pension, etc. in respect of all Gazetted Officers (other than those covered under entry No. 45 in the subjects allotted to the GAD) and non‐gazetted Government servants under the  Administrative Control of the Department.\n(ii) all matters pertaining to grant of pension in respect of Class‐I and Class‐II Officers of the Secretariat Cadre under the Administrative Control of the Department; and\n(iii) all matters pertaining to grant of leave and to impose penalties as specified at serial numbers 1 and 2 of rule 6 of the Gujarat Civil Services (Discipline and Appeal) Rules, 1971 and to institute disciplinary proceedings for imposing penalties as specified at serial numbers 3 to 8 of the said rule 6 in respect of Class‐II Officers of the Secretariat cadre under the administrative control of the Department (See also entry 45 under GAD).\n8. Works, lands and buildings vested in or in the possession of Government for the purposes of the State and assigned to the Energy and Petrochemicals Department.\n9. Inquiries and statistics for the purpose, of any of the matters in this list.\n10. Fees in respect of any of the matters in this  list but not including fees taken in any Court.\n\n I hope this helps."
            ]
        },
        {
            "tag": "legislative_parliamentary_affairs_department",
            "patterns": ["What subjects are allotted to the Legislative and Parliamentary Affairs Department?",
                        "subjects are allotted under the Legislative Department",
                        "subjects are allotted to the Parliamentary Affairs Department",
                         "What areas fall under the Legislative and Parliamentary Affairs Department?"],
            "responses": [
                "Subjects Allotted to the Legislative and Parliamentary Affairs Department: \n\n 1. Salaries and allowances of members of the Legislature of the State, the Speaker and Deputy Speaker of the Legislative of the Assembly, Leader of the opposition of the Legislative    Assembly and of the Government Chief whip, powers, privileges and in minutes of the Legislature of (he State and of the Members and committees thereof, enforcement of attendance of persons for giving evidence of producing documents before committee of the Legislature of the State (See also entry No. 3 under GAD).\n2. Removal of disqualifications for membership of the Legislature of the State.\n3. Rules of the procedure of the Legislature of the State.\n4. Other matters pertaining to parliamentary affairs, that is to say‐‐ \n(i) The   summoning   of the   State   Legislature,   and   the prorogation and dissolution thereof;\n(ii) Planning and Co‐ordination of Legislative and other official business in the Legislature of the State;\n(iii) Allocation of government time in the Legislature of the State for discussion on motions notice of which given by members of the Legislature;\n(iv) Examination of vires of private members Bills and Resolutions;\n(v)   Liaison with leaders of parties and chief whip;\n(vi) Lists of members for Select Committees on Bills;\n(vii) Appointments of Members of Legislature of the State on committee and bodies set up by Government;\n(viii) Information of Informal consultative committees of Members of the Legislature of the State for various departments;\n(ix) Implementation of assurance given by Ministers in the Legislature of the State;\n(x) Advice to departments on procedural and other parliamentary matters;\n(xi) Co‐ordination of action by department on the recommendations of general application made by committees of the Legislature of the State;\n(xii) all other matters connected with Legislature of the  State.\n5. Matters connected with Parliament and Parliamentary affairs.\n6. Drafting and Scrutiny of ordinances and Bills falling under State List and concurrent List of the constitution including technical and procedural aspects thereof.\n7. Scrutiny and drafting of statutory rules, regulations, bye‐laws, notifications, orders; etc.\n8. Updating the Laws in force in the State, research work relating to Legislation and Parliamentary Affairs, revision of Acts and compilations of the Legislative and Parliamentary affairs.\n9. Reprinting of Acts.\n10. Translation from English to Gujarati relating to the Official and Non‐official Bills, Ordinances and Amendments thereof, Statutory Rules, Notifications, Orders, Corrigendum and important Legislations of Central Government and other technical matters.\n11. (i) All matters pertaining to appointments, posting, transfers, promotions, conduct, grant of leave, pensions, etc, in respect of all gazetted officers (Other than those covered under entry No. 45 in the subjects allotted to the GAD) and non‐gazetted government servants under the administrative control of the Department;\n(ii) all matters pertaining to grant of pension in respect of class‐I and II Officers of the Secretariat Cadre under the administrative control of the department; and\n(iii) all matters pertaining to grant of leave and to impose penalties as specified at serial numbers 1 and 2 of the rule 6 of the Gujarat Civil Services (discipline and Appeal) Rules, 1971 and to institute disciplinary proceedings for imposing penalties as specified at serial numbers 3 to 8 of the said rule 6 in respect of Class II officers of the Secretariat cadre under the administrative control of the Department (See entry No. 45 under GAD).\n12.   Works, lands and buildings vested in or in the possession of Government for the purposes of the State and assigned to the Legislative and Parliamentary Affairs Department.\n13. Inquiries and statistics for the purpose of any of the matters in thislist.\n14. Fees in respect of any of the matters in this list, but not including fees taken in any court.\n\nI hope this helps! & if you have any more questions, feel free to ask me!"
            ]
        },
        {
            "tag": "ports_transport_department",
            "patterns": ["What subjects are allotted to the Ports and Transport Department?",
                         "Explain the roles of the Ports and Transport Department.",
                         "Subjects under the ports department",
                         "Subjects under the Transport department.",
                         "What areas fall under the Ports and Transport Department?"],
            "responses": [
                "Subjects Allotted to the Ports and Transport Department:\n\n 1. Ports including major ports, that is to say, the declaration and delimitation of such ports and constitution and powers of ports authorities therein.\n2. Inland waterways and traffic thereon subject to the provisions of ' List I and II with regard to such waterways.\n3. Construction of jetties and dredging of inland waterways.\n4. Lighthouses including light ships, beacons, and other provisions for the safety of shipping and aircraft.\n5. Shipping and navigation on inland waterways as regards mechanically propelled vessels and the rule of the road on such waterways, carriage of passengers and goods on inland waterways subject to the provisions of List‐I with respect to National Waterways.\n6. Maritime shipping and navigation, including shipping and navigation on tidal waters, provisions of education and training for the merchantile, marine and regulation of such education and training provided by the State Inland Steam vessels Act.\n7. Dues of passengers and goods carried out on inland waterways.\n8. The Gujarat Maritime Board Act, 1981.\n9. Deleted. (Date03/09/2005)\n10. (i) All matters pertaining to appointment, posting, transfers, promotions, conduct, grant of leave, pension etc. in respect of all Gazetted Officers (Other than those covered under entry No. 45 in the subject allotted to the GAD) and non‐Gazetted government Servants under the administrative control of the department.\n(ii) all matters pertaining to grant of pension in respect of class I and II Officers of the Secretariat cadre under the administrative control of the department; and\n(iii) all matters pertaining to grant of leave and to impose penalties as specified all serial numbers 1 and 2 of rule 6 of the Gujarat Civil Services (Discipline and Appeal) Rules, 1971 and to institute disciplinary proceedings for imposing penalties as specified at serial numbers 3 to 8 of the said rule 6 in respect of Class‐II officers of the Secretariat Cadre under the administrative control of the Department (See also entry No. 45 under GAD).\n11. Works, lands, and buildings vested in or in the possession of the Government for the purpose of the State and assigned to the Ports and Transport Department.\n12. Inquiries and statistics for purposes of any of the matters in this list.\n13. Fees in respect of any of the matters in this list but not including fees taken in any court.\n14. Vehicles including mechanically propelled vehicles (See also entry No. 7 under R.&.B.D.), motor vehicles, and public conveyances, State road Transport Corporation's Services, including Government Transport Services. (Date03/09/2005)\n15. Taxes on Vehicles suitable for use on road whether mechanically propelled or not; the Bombay Motor Vehicles (taxation of Passengers) Act, 1958. (Date03/09/2005).\n\n I hope this helps! & if you have any more questions, feel free to ask me!"
            ]
        },
        {
            "tag": "women_child_development_department",
            "patterns": ["What subjects are allotted to the Women and Child Development Department?",
                         "Explain the roles of the Women and Child Development Department.",
                         "roles of the Women department",
                         "roles of the child development department",
                         "List the functions of the Women and Child Development Department.",
                         "Tell me about the Women and Child Development Department's responsibilities."],
            "responses": [
                "Subjects Allotted to the Women and Child Development Department:\n\n 1. Nutrition Programme.\n2. The Prevention of Immoral Traffic Act, 1986.\n3. Gujarat Women Economic Development Corporation Limited.\n4. Financial Assistance to Organization for Women Empowerment.\n5. Documentation and Advocacy for women's empowerment.\n6. All matters connected with the activities of Central and State Social Welfare Boards.\n7. Anti Dowry Act, 1961.\n8. Women and child welfare and Co‐ordination of Women and Child welfare Activities pertaining to other departments.\n9. Correspondence with Government of India and other organisations in respect of immoral behaviour with women and children.\n10. Activities like planning, Research, Evaluation, Regulation, Project formulation, training and statistical information, pertaining to women and children.\n11. Correspondence with United Nations International Children's Emergency Fund (UNICEF) and such other organisations working for the welfare of women and Child development.\n12. Matter pertaining to the Gujarat State Women Commission.\n13. Balika Samruddhy Yoj ana.\n14. Prevention of sexual harassment to the women.\n15. Swayamsiddha Yojana.\n16. Deleted. (Date23/05/2003)\n17. Matters pertaining to pension for widows.\n18. (i) All matters pertaining to appointments, postings, transfers, promotions, conduct, grant of leave, pension in respect of all Gazetted Officers (other than those covered under entry No.45 in the subjects allotted to the GAD) and Non‐Gazetted Government servants under the administrative control of the department;\n(ii) All matters pertaining to grant of pension in respect of Class I and II Officers of the Secretariat cadre under the administrative control of the department; and\n(iii) All matters pertaining to grant of leave and to impose penalties as specified at serial numbers 1 and 2 of rule 6 of the Gujarat Civil Services (Discipline and Appeal) Rules, 1971, and to institute disciplinary proceedings for imposing penalties as specified at serial numbers 3 to 8 of the said rule 6 in respect of class II Officers of the Secretariat cadre under the administrative Control of the Department (See also entry No.45 under G.A.D.)\n19. Works, lands and buildings vested in or in the possession of Government, for the purposes of the State and assigned to the Women and child Development Department.\n20. Inquiries and statistics for the purpose of any of the matters in this list.\n21. Fees in respect of any of the matters in this list but not including fees taken in any court.\n\nI hope this helps.",
                "Subjects Allotted to the Women and Child Development Department:\n1. Nutrition Programme.\n2. The Prevention of Immoral Traffic Act, 1986.\n3. Gujarat Women Economic Development Corporation Limited.\n4. Financial Assistance to Organization for Women Empowerment.\n5. Documentation and Advocacy for women's empowerment.\n6. All matters connected with the activities of Central and State Social Welfare Boards.\n7. Anti Dowry Act, 1961.\n8. Women and child welfare and Co‐ordination of Women and Child welfare Activities pertaining to other departments.\n9. Correspondence with Government of India and other organisations in respect of immoral behaviour with women and children.\n10. Activities like planning, Research, Evaluation, Regulation, Project formulation, training and statistical information, pertaining to women and children.\n11. Correspondence with United Nations International Children's Emergency Fund (UNICEF) and such other organisations working for the welfare of women and Child development.\n12. Matter pertaining to the Gujarat State Women Commission.\n13. Balika Samruddhy Yoj ana.\n14. Prevention of sexual harassment to the women.\n15. Swayamsiddha Yojana.\n16. Deleted. (Date23/05/2003)\n17. Matters pertaining to pension for widows.\n18. (i) All matters pertaining to appointments, postings, transfers, promotions, conduct, grant of leave, pension in respect of all Gazetted Officers (other than those covered under entry No.45 in the subjects allotted to the GAD) and Non‐Gazetted Government servants under the administrative control of the department;\n(ii) All matters pertaining to grant of pension in respect of Class I and II Officers of the Secretariat cadre under the administrative control of the department; and\n(iii) All matters pertaining to grant of leave and to impose penalties as specified at serial numbers 1 and 2 of rule 6 of the Gujarat Civil Services (Discipline and Appeal) Rules, 1971, and to institute disciplinary proceedings for imposing penalties as specified at serial numbers 3 to 8 of the said rule 6 in respect of class II Officers of the Secretariat cadre under the administrative Control of the Department (See also entry No.45 under G.A.D.)\n19. Works, lands, and buildings vested in or in the possession of Government, for the purposes of the State and assigned to the Women and Child Development Department.\n20. Inquiries and statistics for the purpose of any of the matters in this list.\n21. Fees in respect of any of the matters in this list but not including fees taken in any court.\n\nI hope this information is helpful. If you have any further questions, feel free to ask."
            ]
        },
        {
            "tag": "science_technology_department",
            "patterns": ["What subjects are allotted to the Science and Technology Department?",
                         "Explain the roles of the Science and Technology Department.",
                         "Tell me about the Science and Technology Department's responsibilities.",
                         "Subjects alloted under Bio‐ Technology Division",
                         "Subjects alloted under Science and Technology Division.",
                         "What areas fall under the Science and Technology Department?"],
            "responses": [
                "Subjects Allotted to the Science and Technology Department:\n\n [A] Science and Technology Division :\n1. Information Technology.\n2. The Gujarat Council of Science City.\n3. The Gujarat Council of Science and Technology.\n4. The Gujarat Informatics Limited.\n5. Remote Sensing and Communication Centre (RESECO) (Date15/02/2003)\n\n[B] Bio‐ Technology Division:\n5. To give guidance on policy matters to all Departments on subjects related to Bio‐ Technology, to search the areas where Bio‐Technology can be used for the development of the State, to provide technical co‐operation to all Government Departments connected with Bio‐ Technology and to regulate its all schemes and projects.\n6. To regulate the research work carried out in the field of Bio‐ Technology and maintain information of high level knowledge available in this field.\n7. Preparation and Implementation of such schemes and projects as may be helpful to use Bio‐ Technology with a view to creating new opportunities of employment in the course of aggregate development of the State.\n8. To undertake Research Projects and to make finance available for that purpose.\n9. To prescribe the methods for promoting Research Projects and activities.\n10. To take up field demonstration and documentary study for promoting bio‐technology and subjects related thereto.\n11. To maintain documentary centres.\n12. To promote skill development in the field of Bio‐technology and to initiate necessary proceeding therefor.\n13. Co‐ ordination of Bio‐Technology and matters pertaining thereto with the Government of India, foreign agencies, other State Governments, Universities, expert institutions and persons.\n14. To take up Environmental Problems related to Bio‐ Technology.\n15. To prevent unauthorised use of Bio‐Tech Products and to undertake the matters relating thereto.\n16. To establish and to promote facilities relating to testing\n17. The Gujarat Council of Bio‐Technology.\n18. All Co‐ordination work in respect of Bio‐technology with all the departments of Secretariat.\n19. (i) All matters pertaining to appointments, postings, transfers, promotions, conduct, grant of leave, pension etc. in respect of all Gazetted Officers (other than those covered under entry at Serial No. 45 in the Subjects allotted to General Administration Department) and non‐Gazetted Government Employees who are under the administrative control of the Department.;\n(ii) All matters pertaining to grant of pension in respect of Class I and II Officers of the Secretariat cadre under the administrative control of the department; and\n(iii) All matters pertaining to grant of leave and to impose penalties as specified at serial numbers 1 and 2 of rule 6 of the Gujarat Civil Services (Discipline and Appeal) Rules, 1971, and to institute disciplinary proceedings for imposing penalties as specified at serial numbers 3 to 8 of the said rule 6 in respect of class II Officers of the secretariat cadre under the administrative control of the department (see also entry No. 45 under G.A.D.)\n20. Works, lands and buildings vested in or in the possession of the Government for the purposes of the State and assigned to the Science and Technology Department.\n21. Inquiries and statistics for the purposes of any of the matters in this list.\n22. Fees in respect of any of the matters in this list but not including fees taken in any court.\n\n I'm glad if this information is of help. Is there anything more you'd like assistance on?"
            ]
        },
        {
            "tag": "tribal_development_department",
            "patterns": ["What subjects are allotted to the Tribal Development Department?",
                         "Explain the roles of the Tribal Development Department.",
                         "Tell me about the Tribal Development Department's responsibilities.",
                         "areas fall under the Tribal Development Department?"],
            "responses": [
                "Subjects Allotted to the Tribal Development Department:\n\n 1. Co‐ordination of welfare work relating to scheduled tribes.\n2. Co‐ordination of work relating to the administration of the Tribal areas.\n3. Tribal Advisory Council.\n4. Hostels and Ashramshalas for Scheduled Tribes.\n5. Correspondence with the Government of India in respect of grant under Article 275(1) of the Constitution and other grants sanctioned by the Central Government for Scheduled Tribes.\n6. Scheme of economic, social and educational amelioration of tribal people.\n7. Work of the prevention of Atrocities Act, 1989 in respect of tribes.\n8. Work of implementation of 10‐points of the Hon. Chief Minister as well as monitoring and review work under the Vanbandhu Welfare Scheme in integrated tribal area.\n9. Work relating to Gujarat Pattern.\n10. Work as a Central Sector of the Scheduled Tribes and Traditional forest dwellers (Reorganization of forest Rights) Act, 2006 and Rules 2007.\n11. Caste Certificates limited to tribes declared as tribes under the notification of the Government of India, and Certificates of additional tribes declared by the Government of Gujarat.\n12. Project of the development of villages of forest area, (work of the Special Central Assistance)\n13. Budget work of Tribal Area Sub‐Plan.\n14. Work relating to the administrative report of Tribal Area Sub‐Plan.\n15. (i) All matters pertaining to appointment, posting, transfer, promotions, conduct, grant of leave, pension etc. in respect of all Gazetted Officers (other than those covered under entry No. 45 in the subject allotted to the General Administration Department) and non‐Gazetted Government servants under the administrative control of the department;\n(ii) All matters pertaining to grant of pension in respect of Class I and II Officers of the Secretariat cadre under the administrative control of the department; and\n(iii) all matters pertaining to grant of leave and to impose penalties as specified at serial numbers 1and 2 of Rule 6 of the Gujarat civil Services (Discipline and Appeal) Rules, 1971, and to institute disciplinary proceedings for imposing penalties as specified at serial numbers 3 to 8 of the said rule 6 in respect of Class‐II Officers of the Secretariat cadre under the administrative control of the department(See also entry No.45 under General Administration Department)\n16. Works, lands and buildings vested in or in the possession of the Government, for purposes of the State and assigned to the Tribal Development Department.\n17. Inquiries and statistics for purposes of any of the matters in this list.\n18. Fees in respect of any of the matters in this list but not including fees taken in any court.\n\n I hope this help, if you have more questions, then feel free to ask."
            ]
        },{
            "tag": "climate_change_department",
            "patterns": ["What subjects are allotted to the Climate Change Department?",
                         "Explain the roles of the Climate Change Department.",
                         "List the functions of the Climate Change Department.",
                         "Tell me about the Climate Change Department's responsibilities."],
            "responses": [
                "Subjects Allotted to the Climate Change Department:\n\n 1. To develop biogas produced from cow dung, agriculture and biological waste as an alternative source of energy and to adopt a new international technology for the purpose.\n2. Issues related to promulgated policies for non-conventional alternative sources of energy like solar energy and wind energy along with necessary research and developmental work and publicity to encourage the use of such sources.\n3. To avail (earn) carbon credit through public and private Sectors.\n4. To keep the city and rural areas clean, to associate Sakhi‐Mandals with activities such as awareness development among people, to remove filth and to create hygienic environment\n5. To coordinate with various departments such as Energy and Petrochemicals Department, Forests and Environment Department, Industries & Mines Department, Narmada, Water Resources, Water Supply and Kalpsar Department, Urban Development and Urban Housing Department, Pranchayat, Rural Housing and Rural Development Department, Ports and Transport Department, Education Department, Health and Family Welfare Department etc. and to provide advice and guidance to them in the context of climate change and to prepare a holistic climate change policy for the Government of Gujarat with the support of these departments.\n6. To co‐ordinate with the Government of India, National Clean Development Mechanism Authority, United Nations Framework Convention on Climate Change and other national and international agencies on the issues related to climate change.\n7. To study the effect of climate change in terms of the rising of the sea level, agro‐ productivity, problems of coastal population and coastal infrastructural facilities and assets and to impart guidance on its mitigation.\n8. To act as nodal department for the purpose of maximum utilization of Green Technology and to create new employment opportunities so as to convert green technology into a new vehicle to boost economy.\n9. To evolve new strategies for Environmental conservation with regard to air, water and land.\n10. To provide guidance on developing various courses and curricula for educational purpose in the context of climate change and also to encourage and Research and Development on climate change in the universities, organize training for professors and planning thereof.\n11. To develop new technology and suggest measures for mitigation of Green House Gases (Carbon Dioxide and Methane etc.) in the atmosphere.\n12. While also dealing with Policy issues related to Green Technology and clean technology to generate revolving fund for the purpose and to administer the same.\n13. To suggest measures to ward off expansion of desert and to increase forests cover.\n14. To establish new 'Gujarat Institute of Research and climate Change (GIRCC)' affiliated with The Pandit Deendayal Petroleum University and other ancillary work related thereto.\n15 To suggest measures to promote wide acceptance of CNG or other alternative fuel resources for transportation so as to control air pollution.\n16. To make suggestions and to provide guidance on disposal of solid waste, sewage waste and medical waste in the context of climate change.\n17. Gujarat Energy Development Agency (GEDA). ( See also entry No.6 under E&PCD)\n18. (i) all matters pertaining to appointment, posting, transfer, promotions, conduct, grant of leave, pension etc. in respect of all Gazetted Officers (other than those covered under entry No. 45 in the subject allotted to the GAD) and non‐Gazetted Government servants under the administrative control of the department;\n(ii) all maters pertaining to grant of pension in respect of Class I & II Officers of the Secretariat cadre under the administrative control of the department; and\n(iii) all matters pertaining to grant of leave and to impose penalties as specified at serial numbers 1 and 2 of Rule 6 of the Gujarat Civil Services (Discipline and Appeal) Rules, 1971, and to institute disciplinary proceedings for imposing penalties as  specified at serial numbers 3 to 8 of the said rule 6 in respect of Class‐II Officers of the Secretariat cadre under the administrative control of the department (See also entry No. 45 under G.A.D.)\n19. Works, lands and buildings vested in or in the possession of the Government, for purposes of the State and assigned to the Climate Change Department.\n20. Inquiries and statistics for purposes of any of the matters in this list.\n21. Fees in respect of any of the matters in this list but not including fees taken in any court.\n\n I'm glad if this information is of help. Is there anything more you'd like assistance on?"
            ]
        },
        {
            "tag": "second_schedule_of_The_Gujarat_Government_rules_of_Business_1990",
            "patterns": ["What is in the Second Schedule of rule 9 of THE GUJARAT GOVERNMENT RULES OF BUSINESS, 1990?",
                         "Explain the Second Schedule in Business rules.",
                         "List the proposals covered in the Second Schedule of business rule"],
            "responses": [
                "SECOND SCHEDULE (rule 9 of The Gujarat Government rules of Business_1990):\n\n 1. Proposals for Advocate‐General appointment/removal or varying remuneration.\n2. Proposals to summon, prorogue, or dissolve the Legislature.\n3. Decisions on disqualification of members, penalty recovery, and Election Commission referrals.\n4. Annual financial statements, supplementary/additional/excess grants.\n5. Proposals for rules under Article 208, clause (3).\n6. Actions on dismissal, removal, or suspension of a Public Service Commission member.\n7. Legislation proposals, including ordinances under Article 213.\n8. Government's stance on resolutions/bills in the Legislature.\n9. Tax imposition/assessment changes, land revenue, irrigation rates, or loans without Finance Minister's consent.\n10. Finance Minister's unapproved proposals affecting state finances.\n11. Re-appropriation proposals with withheld Finance Minister's consent.\n12. Proposals on alienation/sale/lease of govt. property over Rs.1,00,00,000 value or annual income of Rs.10,00,000 or more.\n13. Annual audit reviews, Public Accounts Committee, and Public Undertakings Committee reports.\n14. Proposals with important policy/practice changes.\n15. Proposals against Central Government policy.\n16. Proposals to vary/reverse a previous decision by the council/cabinet.\n17. Proposals for prosecution withdrawal against Legal Department advice.\n18. Reports of Inquiry Committees appointed by the Government.\n19. Cases affecting good governance of Scheduled Areas.\n20. Proposals for Government Company formation or conversion.\n21. Cases Chief Minister directs to be brought before the Cabinet/Council.\n\n I hope this helps."]
        },
        {
            "tag": "GAD",
            "patterns": ["What is the full form of GAD?"],
            "responses": ["General Administration Department"]
          },
          {
            "tag": "A&CD",
            "patterns": ["What is the full form of A & CD?"],
            "responses": ["Agriculture & Co‐operation Department"]
          },
          {
            "tag": "GEDA",
            "patterns": ["What is the full form of GEDA?",
                         "Full form of GEDA"],
            "responses": ["Gujarat Energy Development Agency"]
          },
          {
            "tag": "ED",
            "patterns": ["What is the full form of ED?"],
            "responses": ["Education Department"]
          },
          {
            "tag": "FD",
            "patterns": ["What is the full form of FD?"],
            "responses": ["Finance Department"]
          },
          {
            "tag": "FCS&CAD",
            "patterns": ["What is the full form of FCS & CAD?"],
            "responses": ["Food, Civil Supplies & Consumers' Affairs Department"]
          },
          {
            "tag": "F&ED",
            "patterns": ["What is the full form of F & ED?"],
            "responses": ["Forest & Environment Department"]
          },
          {
            "tag": "H&FWD",
            "patterns": ["What is the full form of H & FWD?"],
            "responses": ["Health & Family Welfare Department"]
          },
          {
            "tag": "HD",
            "patterns": ["What is the full form of HD?"],
            "responses": ["Home Department"]
          },
          {
            "tag": "I&MD",
            "patterns": ["What is the full form of I & MD?"],
            "responses": ["Industries & Mines Department"]
          },
          {
            "tag": "I&BD",
            "patterns": ["What is the full form of I & BD?"],
            "responses": ["Information & Broadcasting Department"]
          },
          {
            "tag": "L&ED",
            "patterns": ["What is the full form of L & ED?"],
            "responses": ["Labour & Employment Department"]
          },
          {
            "tag": "LD",
            "patterns": ["What is the full form of LD?"],
            "responses": ["Legal Department"]
          },
          {
            "tag": "NWRWS&KD",
            "patterns": ["What is the full form of NWRWS & KD?"],
            "responses": ["Narmada, Water Resources, Water Supply and Kalpsar Department"]
          },
          {
            "tag": "PRH&RDD",
            "patterns": ["What is the full form of PRH & RDD?"],
            "responses": ["Panchayat, Rural Housing & Rural Development Department"]
          },
          {
            "tag": "RD",
            "patterns": ["What is the full form of RD?"],
            "responses": ["Revenue Department"]
          },
          {
            "tag": "R&BD",
            "patterns": ["What is the full form of R & BD?"],
            "responses": ["Road & Building Department"]
          },
          {
            "tag": "SJ&ED",
            "patterns": ["What is the full form of SJ & ED?"],
            "responses": ["Social Justice & Empowerment Department"]
          },
          {
            "tag": "UD&UHD",
            "patterns": ["What is the full form of UD & UHD?"],
            "responses": ["Urban Development & Urban Housing Department"]
          },
          {
            "tag": "SY&CAD",
            "patterns": ["What is the full form of SY & CAD?"],
            "responses": ["Sports, Youth & Cultural Activities Department"]
          },
          {
            "tag": "E&PCD",
            "patterns": ["What is the full form of E & PCD?"],
            "responses": ["Energy and Petro‐Chemicals Department"]
          },
          {
            "tag": "L&PAD",
            "patterns": ["What is the full form of L & PAD?"],
            "responses": ["Legislative and Parliamentary Affairs Department"]
          },
          {
            "tag": "P&TD",
            "patterns": ["What is the full form of P & TD?"],
            "responses": ["Ports and Transport Department"]
          },
          {
            "tag": "W&CDD",
            "patterns": ["What is the full form of W & CDD?"],
            "responses": ["Women and Child Development Department"]
          },
          {
            "tag": "S&TD",
            "patterns": ["What is the full form of S & TD?"],
            "responses": ["Science and Technology Department"]
          },
          {
            "tag": "TDD",
            "patterns": ["What is the full form of TDD?"],
            "responses": ["Tribal Development Department"]
          },
          {
            "tag": "CLCD",
            "patterns": ["What is the full form of CLCD?"],
            "responses": ["Climate Change Department"]
          }
    ]
}
