{
    
    "intends": [
        {
            "tag": "greeting",
            "patterns": [
              "Hi",
              "Hey",
              "Hello"
            ],
            "responses": [
              "Hello! thanks for visiting what can I do for you?",
              "Hi there! what can I do for you?",
              "Hi there! how can I help?",
              "Hello! Welcome to the rule expert chatbot 'ğ‘ğ®ğ¥ğ à¤®à¤¿à¤¤à¥à¤°'. What can I do for you today?",
              "Hi! Need guidance on rules or regulations? I'm here to provide information",
              "Hello! How can I assist you with rules or regulations today?",
              "Hello! I'm here to help with any questions you may have about rules and regulations.",
              "Greetings! Feel free to ask about any specific rules or seek clarification on regulations.",
              "Greetings! Feel free to start a conversation about rules, and I'll do my best to assist you.",
              "Hi there! Ready to discuss any specific rules or topics you have in mind."
            ]
          },
          {
            "tag": "items",
            "patterns": [
              "Who are you",
              "What is your purpose?",
              "what are you?"
            ],
            "responses": [
              "I'm ğ‘ğ®ğ¥ğ à¤®à¤¿à¤¤à¥à¤°, your rule expert friend :) i can give you all the details on GAD Act and Rule but i'm still training so please pardon my mistakes if any.",
              "Myself ğ‘ğ®ğ¥ğ à¤®à¤¿à¤¤à¥à¤°, your rule expert friend :)",
              "I am ğ‘ğ®ğ¥ğ à¤®à¤¿à¤¤à¥à¤° :), your rule expert companion. How can I assist you today?",
              "Greetings! I'm ğ‘ğ®ğ¥ğ à¤®à¤¿à¤¤à¥à¤° :), ready to share insights on rules. Ask me anything!",
              "Hi there! I'm ğ‘ğ®ğ¥ğ à¤®à¤¿à¤¤à¥à¤° :), your go-to rule expert. What do you want to know?",
              "Hi there! ğ‘ğ®ğ¥ğ à¤®à¤¿à¤¤à¥à¤° at your service. Ask away about the GAD Act and Rule",
              "Hello! I'm ğ‘ğ®ğ¥ğ à¤®à¤¿à¤¤à¥à¤° :), your guide to the world of rules and regulations",
              "Hi! I'm ğ‘ğ®ğ¥ğ à¤®à¤¿à¤¤à¥à¤° :), your virtual companion for all things related to rules."
            ]
          },
          {
            "tag": "bye",
            "patterns": [
              "bye",
              "goodbye"
            ],
            "responses": [
                "Bye for now! If you have more questions about rules or anything else, feel free to return. Have a great day!",
                "Bye for now! If you ever find yourself pondering over rules or have more questions, don't hesitate to drop by. Take care!",
                "Goodbye! If you ever need assistance with rules or any other queries, don't hesitate to reach out. Take care!",
                "Goodbye! Should you have more rule-related inquiries or anything else on your mind, feel free to return. Wishing you a wonderful day!",
                "Bye for now! If you ever have more questions about rules or need guidance, you know where to find me. Until next time!",
                "Goodbye! Remember, the door is always open for your questions, whether they're about rules or anything else. Take care!",
                "Farewell for now! If you ever need more insights into rules or assistance with anything else, feel free to drop by. See you later!"
            ]
          }
    ]
}