{
    "intents": [
      {
        "tag": "gujarat civil servicis classification and recruitment (general) rules - 1967",
        "patterns": [
          "What is Short title, commencement and application of gujarat civil servicis classification and recruitment (general) rules - 1967?",
          "Explain Short title, commencement and application of gujarat civil servicis classification and recruitment (general) rules - 1967",
          "Define Short title, commencement and application of gujarat civil servicis classification and recruitment (general) rules - 1967"
        ],
        "responses": [
          "1) These rules may be called the Gujarat Civil Services Classificationand Recruitment (General) Rules, 1967.\n2) They shall come into force at once.\n3) Subject to sub-rule (4) they shall apply to services and posts, the recruitment to which is regulated in accordance with the rules made under article - 309 of the Constitution.\n4) Nothing in these rules shall apply to member of the subordinate ranks of the police force.\n Explanation :- For the purposes of sub-rule (4), the expression “subordinate ranks” shall have the meaning assigned to it as in the [ Gujarat ] Police Act, 1951.\n Definition :- In these rules, unless the context otherwise requires\n (i) “Commission” means the Gujarat Public Service Commission;\n (i-a) “Economically Weaker Sections ” means such castes, classes and groups as are determined by the State Government as Economically Weaker Sections by the Government Resolution, Social Justice and Empowerment Department, No: EWS/122019/45903/A,dated: the 23rd January, 2019.\n (ii) “Inferior services” means the Services and posts specified as such in sub-rule (3) of rule (4);\n (iii) “Post” means a post under the State Government included in the State Services or Subordinate Service;\n (iv) “Scheduled Castes” means such castes, races or tribes or parts of or groups within such castes, races or tribes as are deemed to be Scheduled Castes in relation to the State of Gujarat under Article 341 of the Constitution of India;\n (v) “Scheduled Tribes” means such tribes or tribal communities or parts of or groups within such tribes or tribal communities as are deemed to be Scheduled Tribes in relation to the State of Gujarat under Article 342 of the Constitution of India;\n (vi) “Service” means any service under the State Government included in the State Service or Subordinate Services;\n  (vi-a) “Socially and Educationally Backward Class” means such castes, classes and groups as are determined by the State Government as Socially and Educationally Backward Class by Government Resolution, Labour, Social Welfare and Tribal Development Department, No.BCR/1078/13734/H, dated 1st April, 1978;\n (vii) “State Government” means the Government of Gujarat;\n (viii) “State Services” means the services and posts specified as such in sub rule(1) of rule 4;\n (ix) “Subordinate Services” means the services and posts specified as such in sub-rule (2) of rule 4;\n (x) Words and expressions used but not defined in these rules shall have the meaning assigned to them in the [Gujarat Civil Services Rules, 2002]."
        ]
      },
      {
        "tag": "Classification of services and posts",
        "patterns": [
          "What is Classification of services and posts?",
          "Explain Classification of services and posts",
          "Define Classification of services and posts"
        ],
        "responses": [
          "\n(1) The Civil Services of State of Gujarat shall under orders of the State Government be classified as follows :-\n  (i) Class - I\n (ii) Class - II \n iii) Class - III ; and\n (iv) Class - IV\n(2) If a Service consists of more than one grade, different grade may be included invdifferent Classes.\n(3) Civil posts under the State Government other than those to which these rules do not apply shall by a general or special order of the State Government be classified as follows :\n (i) Class - I\n (ii) Class - II\n (iii) Class - III ; and\n (iv) Class - IV\n(4) Any order made by the competent authority and in force immediately before the commencement, of these rules relating to classification of the Civil Services of the State of Gujarat and Civil posts under the State Government shall continue in force until modified or rescinded by an order of the State Government under this rule or unless it is in any way inconsistent with the provisions of these rules.\n(4) Any service or post shall unless otherwise directed by the State Government by a general or special order made in that behalf be deemed to belong -\n (a) to Class - II if it is of a gazetted rank ; and\n (b) to Class - III in any other case."
        ]
      },
      {
        "tag": "State services, Subordinate Services and Inferior Services",
        "patterns": [
          "What is State services, Subordinate Services and Inferior Services?",
          "Explain State services, Subordinate Services and Inferior Services",
          "Define State services, Subordinate Services and Inferior Services"
        ],
        "responses": [
          "(1) The Services and posts classified as Class-I or Class - II shall be known as State Services.\n(2) The services and posts classified as Class - III shall be known as Subordinate Services.\n(3) The Services and posts classified as Class - IV shall be known as Inferior Services."
        ]
      },
      {
        "tag": "Physical fitness in general provisions regarding recruitment to any service or post",
        "patterns": [
          "What is Physical fitness in general provisions regarding recruitment to any service or post?",
          "Explain Physical fitness in general provisions regarding recruitment to any service or post",
          "Define Physical fitness in general provisions regarding recruitment to any service or post"
        ],
        "responses": [
          "\n Subject to the provisions of rules 11, 12, 13, 14 and 15 of the Gujarat Civil Services (General Conditions of Services) Rules, 2002, no person shall be appointed to any service or post, if he has failed to pass such medical test of physical fitness as may be prescribed by the State Government;\n Provided that where an appointment is made by promotion or transfer of a person who is already in service of the Government of Gujarat, no medical test shall ordinarily be required."
        ]
      },
      {
        "tag": "Evidence of good character in general provisions regarding recruitment to any service or post",
        "patterns": [
          "What is Evidence of good character in general provisions regarding recruitment to any service or post?",
          "Explain Evidence of good character in general provisions regarding recruitment to any service or post",
          "Define Evidence of good character in general provisions regarding recruitment to any service or post"
        ],
        "responses": [
          " An appointment to any service or post, otherwise than by promotion or transfer of a person already in service, shall be subject to the production of such evidence of good character as may be required:-\n (a) by the Commission, if the appointment is to be made after consulting the Commission, or\n (b) by the appointing authority, in any other cases."
        ]
      },
      {
        "tag": "Condition as to Citizenship of India in general provisions regarding recruitment to any service or post",
        "patterns": [
          "What is Condition as to Citizenship of India in general provisions regarding recruitment to any service or post",
          "Explain Condition as to Citizenship of India in general provisions regarding recruitment to any service or post",
          "Define Condition as to Citizenship of India in general provisions regarding recruitment to any service or post"
        ],
        "responses": [
          "(1) Subject to the provisions of these rules, no person shall be appointed to any service or post unless he is -\n (a) a citizen of India, or\n (b) a subject of Nepal, or\n (c) a subject of Bhutan, or\n (d) a Tibetan refugee who came over to India, before the 1st January, 1962, with the intention of permanently settling in India, or\n (e) a person of India origin who has migrated from Pakistan, Burma, Sri Lanka, East African countries of Kenya, Uganda the United Republic of Tanzania  (formerly Tanganyika and Zanzibar) Zambia, Malawi, Zaire, Ethiopia and Vietnam with the intention of permanently settling in India.\n Provided that a candidate belonging to categories (b), (c), (d) and (e) shall be person in whose favour a certificate of eligibility has been issued by the State Government.\n(2) A candidate in whose case a certificate of eligibility is necessary may be admitted to an examination or interview conducted by the Commission or other recruiting authority, but the offer of appointment may be given only after the necessary eligibility certificate has been issued to him by the State Government."
        ]
      },
      {
        "tag": "Condition as to Prescribed qualifications in general provisions regarding recruitment to any service or post",
        "patterns": [
          "What is Condition as to Prescribed qualifications in general provisions regarding recruitment to any service or post",
          "Explain Condition as to Prescribed qualifications in general provisions regarding recruitment to any service or post",
          "Define Condition as to Prescribed qualifications in general provisions regarding recruitment to any service or post"
        ],
        "responses": [
          "(1) Subject to the provisions of these rules, no person shall be appointed to any service or post, unless he possesses the qualification, if any, prescribed in the rules relating to the recruitment to such service or post (hereinafter referred to as “the prescribed qualifications”).\n “(1A) Notwithstanding anything contained in any other rule and subject to the provisions of these rules, no person shall be appointed to service, or post, except class-IV, inferior service, unless at the time of appointment he possesses a certificate of basic knowledge of computer applications of any Institute”.(2) Where the prescribed qualification include a qualification as to age limit the appointing authority may relax the age limit in favour of candidates belonging to the [Scheduled Castes, Scheduled Tribes]+ , [Socially and Educationally Backward Classes] ++ [and Economically Weaker Sections]#  [and in favour of candidate who are women]$  to the following extent, that is to say:-\n (a) in the case of a service or post in a subordinate service or of a State service in respect of which the prescribed age limit does not exceed forty years, the age limit may be relaxed to the extent of five years.\n (b) in the case of service or post in the State Service in respect of which the prescribed age limit exceeds forty years, the age limit may be relaxed to the extent of maximum five years, so as to provide that upper age limit for entry in the service does not exceed forty five years.\n (c) substituted as clause (b) above.\n(3) If in any case it is considered essential by the appointing authority to appoint to any post a candidate who has crossed the age limit prescribed for the service or post or in the case of any post a candidate possessing the prescribed qualification be not available and it is considered by the appointing authority that it is necessary to appoint to such post a candidate who does not possess the prescribed qualifications, the appointing authority shall not appoint such candidate to any such post except with the previous approval of the state Government where approval is sought, the appointing authority shall state fully the reasons for making the appointment.\n(4) If for the purpose of recruitment to any post, applications for appointment to such post are invited by means of a notification or advertisement published in a news paper or in any other manner than save as otherwise provided in such notification or advertisement, the question whether a candidate applying for such post has crossed the age limit prescribed for such post shall be determined with reference to the first day of the month immediately following the month in which a period of ninety days from the date of the first publication of the notification or as the case may be advertisement expires and accordingly a candidate shall be deemed to have crossed the age limit if he has attained the age limit before the aforesaid first day of the month.\n(5) “Notwithstanding any thing to the contrary contained in any rules for the time beinin force relating to recruitment to any service or post a candidate who is alreadin Gujarat Government Service, either as a permanent or a temporary servanofficiating continuously for six months or more in a substantive or leave vacancor in a vacancy caused as a result of deputation of other servant applied thereafterfor the post under advertisement (hereinafter referred to as “the concerned post”the upper age limit prescribed for the purpose of recruitment in such rules, shalnot apply to him provided he had not crossed the age limit prescribed for thconcerned post at the time of his previous appointments;\n Provided that the upper age limit shall apply to a candidate whose recruitment to a post or service is made through competitive examination or by direct selection for which experience has not been prescribed as one of the qualification for concerned post;\n Provided also that where a Government Servant appointed to a post requiring a Medical Engineering, Veterinary or Agriculture degree or diploma as one of the qualifications, he shall be entitled to relaxation of the upper age limit prescribed for the concerned post provided he had not crossed the age limit prescribed for the concerned post at the time of his previous appointments even if experience has not been prescribed as one of the qualifications for such post.”\n(5-A) (1) Government servants may be allowed on a uniform basis, relaxation of a maximum period of 5 years or to the extent equal number of years for which service has been put in by him, whichever is less, in the upper age limit for recruitment to Class-I or Class-II posts or service, which is to be filled in by direct selection through the Commission for which experience has not been prescribed as one of the qualifications for such post.\n      (2) The age relaxation shall be admissible to such Government servants who are working in posts which are in the same line and where a relationship could be established that the service already rendered in a particular post shall be useful for the efficient discharge of the duties of the post(s) recruitment to which has been advertised. The decision of the Commission in this regard shall be final.\n      Provided that a post in the same line means such next lower post from which an employee can be promoted to the post so advertised.\n      (3) The relaxation admissible in upper age limit under sub-rule (1) above, shall be in addition to the relaxation in upper age limit admissible to the candidates belonging to Scheduled Castes, Scheduled Tribes, Socially and Educationally Backward Classes [and Economically Weaker Sections.]\n(6) Sub-rule (6) deleted\n(7) In the case of a service or post, if under the regulations made under the proviso to clause (3) of the Article 320 of the Constitution of India it is not necessary to consult the Commission and no special academic qualification relating to age have been prescribed, it shall be in the discretion of the Heads of the Department to recruit to such service or post such person as may appear to him to be suitable for the duties attached to such service or post for a period of six months or till the recruitment rules for the post or service are framed, whichever is earlier.\n(8) Where the qualifications prescribed for any service or post include a qualification as to practical experience of a given period and applications are invited for such service or post *3  “the period of practical experience shall be computed-\n (a) Unless otherwise provided in recruitment rule from the date on which requisite qualifications are obtained.\n (b) With reference to the last date fixed for receipt of such application.\n(9) (a) Notwithstanding anything contained in any rules for the time being in force relating to recruitment to any service or post requiring a Bachelor's degree of a recognised University or an equivalent qualification recognised by the Government as an essential qualification [and for which no experience is prescribed], the upper age limit for the purpose of recruitment to such service or post shall be [35 years], except where the upper age limit prescribed in such rule is more than [35 years].\n    (b) Notwithstanding anything contained in any rules for the time being in· force relating to recruitment to any service or post requiring minimum a Bachelor's degree or above of a recognised University or an equivalent qualification recognised by the Government along with which experience is also an essential qualification, the upper” age limit prescribed in the relevant rules for the purpose of recruitment to such service or post shall be relaxed by five years subject to the condition that such upper age limit shall not exceed 45 years in any case.\n(10) Notwithstanding anything contained in any rules for the time being in force relating to recruitment to any service or post requiring qualification less than Bachelor's degree as an essential qualification, the upper age limit for the purpose of recruitment to such service or post shall be [33 years], except where the upper age limit prescribed in such rules is more than [33 years]."
        ]
      },
      {
        "tag": "Appointment to service or post in State Service in general provisions regarding recruitment to any service or post",
        "patterns": [
          "What is Appointment to service or post in State Service in general provisions regarding recruitment to any service or post",
          "Explain Appointment to service or post in State Service in general provisions regarding recruitment to any service or post",
          "Define Appointment to service or post in State Service in general provisions regarding recruitment to any service or post"
        ],
        "responses": [
          "(1) An appointment to any service or post included in the State service shall be made by the State Government or by an authority duly empowered in that behalf by the State Government either:-\n (a) on the result of a competitive examination held for the purpose,\n (b) by direct selection, or\n (c) by promotion, or\n (d) by transfer.\nfrom amongst the persons satisfying the conditions prescribed in these rules and other rules, if any, relating to the recruitment to such service or post.\nRule-9:\n (i) :- Notwithstanding anything contained in these rules or orders relating to recruitment to any service or post included in the State Services or Subordinate Services, if and when the services and posts reserved for the Scheduled Castes and Scheduled Tribes in appointment by promotion are not filed up even after three recruitment occasions for the reasons of non-availability of eligible persons satisfying the minimum experience in service or post requisite for appointment by promotion laid down in these rules or rules or orders relating to recruitment or total non-availability of Scheduled Castes and Scheduled Tribes in the feeder services or posts, the State Government or the authority empowered in that behalf, shall make appointment even against the service or post meant for appointment by promotion either:\n  (a) on the result of competitive examination held for the purpose, or\n  (b) by direct selection. irrespective of whether or not the recruitment rules prescribed for the service or post provide for appointment by direct selection.\n  (ii) Where in any rules or orders relating to recruitment to any service or post, some proportion for appointment by direct selection is laid down, the appointment made under clause (i) above against the service or post meant for appointment by promotion shall be treated as in addition to the proportion laid down for appointment by direct selection in such rules or orders and the seniority of such appointees shall be fixed on the same basis as the seniority of other.\n (iii) Where in any rules or order relating to recruitment to any service or post, the provision for appointment by direct selection has not been made, the appointment under clause (i) above, shall resorted to only after prescribing the qualifications as to age, educational qualifications and experience in consultation with the Commission, if the service or post is within the purview of the Commission and with the approval of the State Government, if the service or post is not within the purview of the Commission, wherever necessary even by issuing executive orders:-\n Provided that the qualifications regarding age limit and educational qualifications shall not be lower than those prescribed for analogous service or post in the State or Subordinate Services.\n (iv) Where in any rules or orders relating to recruitment to any service or post, the provision for appointment by direct selection has not been made, the seniority or persons appointed under clause (i) above, shall be fixed on the basis of continuous date of joining the appointment.\n (v) The corresponding number of services and posts reserved for the Scheduled Castes and Scheduled Tribes in appointments by promotion for which the appointments are resorted to under the clause (i) above, shall be treated as utilized and diminished from the backlog in promotion for the above categories.\n(2) Every such appointment shall be made after consultation with the Commission, unless under a regulation made under proviso to clause (3) of Article 320 of the Constitution of India, such consultation is not necessary.  "
        ]
      },
      {
        "tag": "Appointment to service or post in Subordinate Services or Inferior Services",
        "patterns": [
          "What is Appointment to service or post in Subordinate Services or Inferior Services?",
          "Explain Appointment to service or post in Subordinate Services or Inferior Services",
          "Define Appointment to service or post in Subordinate Services or Inferior Services"
        ],
        "responses": [
          "Notwithstanding anything contained in these rules or any rules or orders relating to selection of a person by direct recruitment in the Subordinate Services or Inferior Services,\n (1) a candidate selected by direct selection or on the result of a competitive examination shall be appointed on contractual basis in accordance with and on such terms and conditions as prescribed by the Government from time to time.\n (2) a candidate appointed in accordance with sub-rule(1) shall be given, at the end of contractual period, the pay scale prescribed for the concerned post on his performance being found satisfactory during the stipulated period of service on contractual basis;\n (3) such candidate shall, during the stipulated period of service on contractual basis [or within a period of two years thereafter], be required to pass the CCC examination for Computer Knowledge as prescribed in Gujarat Civil Services Computer Competency Training and Examination Rules, 2006;\n (4) such candidate shall, during the stipulated period of service on contractual basis [or within a period of two years thereafter], be required to undergo pre-service training and pass the post-training examination in accordance with the rules prescribed or as may be prescribed by the Government from time to time;\n (5) such candidate shall, after regular appointment, pass an examination in Hindi or Gujarati or both, as the case may be, in accordance with the rules prescribed by the Government from time to time.\n Provided that sub-rules (3), (4) and (5) shall not apply to the appointments made to the Inferior Services on fixed pay on contractual basis. "
        ]
      },
      {
        "tag": "Appointment of service or post in Subordinate Services",
        "patterns": [
          "What is Appointment of service or post in Subordinate Services?",
          "Explain Appointment of service or post in Subordinate Services",
          "Define Appointment of service or post in Subordinate Services"
        ],
        "responses": [
          "(1) Subject to the provisions of these rules and other rules if any, relating to therecruitment to service and post and the general control of the State Governmentan appointment to any service or post included in the Subordinate Services andInferior Services shall be made by the Head of Department concerned or, wherethe Head of Office concerned is empowered by the State Government by a generalor special order to make such appointment by such Head of Office.\n(2) Every such appointment shall be made after consultation with the Commissionunless under a regulation made under proviso to clause (3) of Article 320 of theConstitution of India such consultation is not necessary,\n(3) In the case of an appointment for which consultation with the Commission isnot necessary the appointment shall if the State Government, so directs be madewith the assistance of such Advisory Committee as the State Government may begeneral or special order specify. "
        ]
      },
      {
        "tag": "Period of Probation in State Service in general provisions regarding recruitment to any service or post",
        "patterns": [
          "What is Period of Probation in State Service in general provisions regarding recruitment to any service or post?",
          "Explain Period of Probation in State Service in general provisions regarding recruitment to any service or post",
          "Define Period of Probation in State Service in general provisions regarding recruitment to any service or post"
        ],
        "responses": [
          " Notwithstanding anything contained in these rules or any rules or orders relating to the recruitment to any service or post included in the State Service or Subordinate Service, a candidate appointed to Class- I or Class- II service or post by direct selection, shall be on probation for a period of two years and in case of his appointment to Class - III service or post for a period of one year: \n Provided that the appointing authority may, if it thinks fit in any case, extend the period of probation for a further period not exceeding two years in case of Class-I and Class - II service or post and one year in case of Class - III service or post:\n Provided further that if in any case passing of a departmental examination during the period of probation is stipulated as a prerequisite condition for completion of such probation period and where the probationer could not pass the same within the prescribed chances admissible to him under the rules reasons beyond his control the above ceiling on the period of probation shall not be applicable.\n Provided also that nothing in this rule shall apply to the appointments made to the Subordinate Services on contractual basis under rule 9A."
        ]
      },
      {
        "tag": "Appointment by promotion in State Service in general provisions regarding recruitment to any service or post",
        "patterns": [
          "What is Appointment by promotion in State Service in general provisions regarding recruitment to any service or post?",
          "Explain Appointment by promotion in State Service in general provisions regarding recruitment to any service or post",
          "Define Appointment by promotion in State Service in general provisions regarding recruitment to any service or post"
        ],
        "responses": [
          "(1) Where an appointment to any post is to be made by promotion, no servant shall be entitled to such promotion on the ground of seniority. No such appointment shall be made unless in addition to seniority, the servant to be appointed is found to be fit for such promotion.\n (1A) Notwithstanding anything contained in any other rule, with effect from [01/10/2006+] no servant shall be appointed to any post under sub rule (1) unless he has passed the qualifying examination for computer knowledge, as may be determined by the Government from time to time.\n Provided that in case where the appointment has been by promotion to any post subject to passing of such examination on or before the 30th June, 2013 the concerned Government Servant shall pass such examination on or before the 31st December, 2013 or before the retirement of the concerned Government Servant from Government Service, whichever is earlier.\n Provided further that a servant who has already attained the age of [50 years] 65 or who attains the age of [50 years] 6 hereafter shall be exempted from passing such examination.\n Provided also that the concerned Government servant who has expired or retired on superannuation or voluntary on or before the * {31st March, 2013}, shall be deemed to have been exempted from passing such examination.\n Provided further that a servant who has passed such examination either at the time of direct recruitment or at the time of his earlier promotion shall be exempted from passing such examination.\n(2) In making an appointment to any post by promotion, the appointing authority may supersede a servant who is apparently not fit to discharge the duties and responsibilities of the post and whose appointment is likely to affect adversely the efficiency of work assigned to that post.\n(3) (a) Notwithstanding anything contained in any rules as in force relating to the promotion to a Class-I post and anything contained in sub-rules (1) and (2), appointment by promotion to Class-I post, except the lowest level of Class-I post in a hierarchy, “Very Good” shall be the benchmark for being considered fit for promotion in a hierarchy.\n        Provided that the provision for preparation of a Select List as prescribed above, shall not be applicable, for the promotion of such officers, in respect of whom the Select List(s) have already been approved by the Government on or before the 23rd August, 2019;\n    (b) The zone of consideration for the purpose of clause (a) above shall be such as the State Government may from time to time determine;\n    (c) The State Government shall form a Selection Committee for selection of persons to the post mentioned in clause (a) above.\n(4) (a) Notwithstanding anything contained in sub-rules (1) and (2), “Good” shall be the bench mark for being considered fit for promotion from Class-IV to ClassIII post, Class-III to Class-III post, Class-III to Class-II post, Class-II to ClassII post and Class-II to lowest level of Class-I post in a hierarchy:\n       Provided that where the lowest level of Class-I post having a status of Head of the Department, sub-rule (3) above shall be applicable to such post:\n       Provided further that the provisions for preparation of a Select List as prescribed above, shall not be applicable, for the promotion of such officers/ employees, in respect of whom the Select List(s) have already been approved by the Government on or before the 23rd August, 2019;\n    (b) The zone of consideration for the purpose of clause (a) shall be such as the State Government may from time to time determine;\n    (c) The State Government shall form a Selection Committee for selection of persons to the post mentioned in clause (a) above."
        ]
      },
      {
        "tag": "Minimum Experience in Service or Post requisite for Promotion",
        "patterns": [
          "What is Minimum Experience in Service or Post requisite for Promotion?",
          "Explain Minimum Experience in Service or Post requisite for Promotion",
          "Define Minimum Experience in Service or Post requisite for Promotion"
        ],
        "responses": [
          "1.Where in any rules or orders relating to recruitment in or promotion to any service or post included in the State Services or Subordinate Service, possession of experience in a lower service or post for a specified period is not prescribed as a condition precedent to promotion to a higher service or post the provisions of subrul shall apply. 2. (a) No person shall be promoted from a lower post in Class - III service to a higher post in the same service unless he has an experience of five years in the post from which he is to be promoted.\n   (b) No person shall be promoted from Class - III service to Class - II service unless he has an experience of seven years in Class-III service from which he is to be promoted.\n   (c) No person shall be promoted from a lower post in Class - II service to a higher post in the same service unless he has an experience of five years in the post from which he is to be promoted and\n   (d) No person shall be promoted from Class - II service to Class-I service unless he has an experience of eight years in Class- II from which he is to be promoted.\n   (e) No person shall be promoted from a lower post in Class - I service to the higher post in the same service unless he has an experience of five years in the post from which he is to be promoted.\n   Provided that where an appointing authority is satisfied that a person having an experience specified in clause (a), (b), *** “[(c), (d) or as the case may be, (e)]” is not available for promotion and that it is in public interest to fill up the post or service by promotion of a person having experience for a lesser period, it may for reasons to be recorded in writing promote such person who has experience for a period not less than two thirds of the period specified in clause (a), (b), ***[(c), (d) or (e)] which applies to him."
        ]
      },
      {
        "tag": "Refusal to accept promotion by Government Servant.",
        "patterns": [
          "What is Refusal to accept promotion by Government Servant?",
          "Explain Refusal to accept promotion by Government Servant.",
          "Define Refusal to accept promotion by Government Servant."
        ],
        "responses": [
          "(1) Where a Government Servant refuses to accept the promotion, he shall make an application to that effect to the appointing authority showing the reasons for refusing the promotion. The appointing authority, thereafter, may promote the next eligible person and such Government Servant shall lose his seniority vis-a-vis his juniors who have been promoted after his refusal.\n(2) Where the Government Servant has refused to accept the promotion, his case shall not be considered for promotion for a period of one year from the date of refusal of promotion or till next vacancy arises, whichever is later.\n    Provided that the provisions of sub-rules(1) and (2) shall not apply where adhoc prom against short term vacancy is refused by the Government Servant.\nExplanation:- The act of not joining the new assignment within the joining time as admissible, shall amount to refusal of promotion for the purpose of this rule unless such Government Servant makes written request in time and has been considered by the appointing authority. "
        ]
      },
      {
        "tag": "Previous consent of employer",
        "patterns": [
          "What is Previous consent of employer?",
          "Explain Previous consent of employer",
          "Define Previous consent of employer"
        ],
        "responses": [
          "(1) Any application for appointment to a post in the State Service or Subordinate Service, made by a candidate, who is already in the employment of the State Government or the Government of any other State or the Central Government or a local authority or a Corporation owned or controlled by any such Government shall be rejected, if it has been made without the consent of the respective Government or the local authority or, as the case may be the Corporation concerned.\nExplanation :- In the case of an application employed under the Government of any other State or the Central Government the consent of such Government shall be presumed if the appointing authority is satisfied from the endorsement of the officer forwarding the application or otherwise that the application has been made in accordance with the rules made by the Government concerned.\n(2) Where a Government servant employed in a State Service or Subordinate Service desires to apply for a post or for appearing for an examination for a post or for transfer to a post in another office or Department of the Government of Gujarat or under the Government of any other State or the Central Government, he shall submit his application through his appointing authority, which shall decided whether or not the Government servant shall be permitted to apply.\n(3) No person in the employment of the Central Government or the Government of any other State shall be accepted as a candidate at an examination for admission to service under the Government of Gujarat save with the permission of the Government under which he is employed."
        ]
      },
      {
        "tag": "Disqualification for bigamous marriage",
        "patterns": [
          "What is Disqualification for bigamous marriage?",
          "Explain Disqualification for bigamous marriage",
          "Define Disqualification for bigamous marriage"
        ],
        "responses": [
          "(1) No person, who\n  (a) If male, has more than one wife living, and\n  (b) If female has married a man who has already another wife living, shall be\n eligible for appointment to any service under the State Government.\n  Provided that, subject to the provisions of any law for the time being in force the State Government, may if satisfied that there are special grounds for so doing exempt any person from the operation of this rule.\n(2) Every applicant for appointment to a service or post under the State Government shall declare whether he or she as the case may be is married and, in the case of an applicant, who is a male whether he has more than one wife living and in the case of an applicant who is a female, whether she is married to a man who has already another wife living"
        ]
      },
      {
        "tag": "Disqualification for enlisting support",
        "patterns": [
          "What is Disqualification for enlisting support?",
          "Explain Disqualification for enlisting support",
          "Define Disqualification for enlisting support"
        ],
        "responses": [
          "  An endeavour on the part of a candidate for service or of any relation of the candidate to enlist support by direct or indirect methods for his application for appointment to Government service or for promotion to higher appointment shall be held to disqualify the candidate for the appointment or promotion. "
        ]
      },
      {
        "tag": "Passing of examination after appointment",
        "patterns": [
          "What is Passing of examination after appointment?",
          "Explain Passing of examination after appointment",
          "Define Passing of examination after appointment"
        ],
        "responses": [
          "  A person on appointment to any service or posts shall be required to pass an examination in Hindi and in Gujarati and such other departmental examination as may be prescribed by rules made in that behalf. "
        ]
      },
      {
        "tag": "Mode of certain Examinations",
        "patterns": [
          "What is Mode of certain Examinations?",
          "Explain Mode of certain Examinations",
          "Define Mode of certain Examinations"
        ],
        "responses": [
          "  Notwithstanding anything contained in these rules or in any other rules relating to certain examinations which are held for the persons appointed to any service or post, the concerned authority may conduct such examinations in online mode or 0.M.R. based or in written mode or in such other mode as may be decided by it. "
        ]
      },
      {
        "tag": "",
        "patterns": [
          "What is ",
          "Explain ",
          "Define "
        ],
        "responses": [
          ""
        ]
      },
      {
        "tag": "",
        "patterns": [
          "What is ",
          "Explain ",
          "Define "
        ],
        "responses": [
          ""
        ]
      },
      {
        "tag": "",
        "patterns": [
          "What is ",
          "Explain ",
          "Define "
        ],
        "responses": [
          ""
        ]
      },
      {
        "tag": "",
        "patterns": [
          "What is ",
          "Explain ",
          "Define "
        ],
        "responses": [
          ""
        ]
      },
      {
        "tag": "",
        "patterns": [
          "What is ",
          "Explain ",
          "Define "
        ],
        "responses": [
          ""
        ]
      },
      {
        "tag": "",
        "patterns": [
          "What is ",
          "Explain ",
          "Define "
        ],
        "responses": [
          ""
        ]
      },
      {
        "tag": "",
        "patterns": [
          "What is ",
          "Explain ",
          "Define "
        ],
        "responses": [
          ""
        ]
      }
    ]
}