{
    "intents": [
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Short title, commencement and application",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Short title, commencement and application?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 Short title, commencement and application?",
          "Please provide information about the Gujarat Civil Services (Conduct) Rules, 1971, including its short title and the categories of civil servants it applies to.",
          "How do the Gujarat Civil Services (Conduct) Rules, 1971, define their short title, commencement, and scope of application?",
          "Describe the commencement date and the extent of applicability of the Gujarat Civil Services (Conduct) Rules, 1971."
        ],
        "responses": [
          "(1)   These rules may be called the Gujarat Civil Services (Conduct) Rules,1971.\n(2)   They shall come into force from 15th August, 1971.\n(3)   They shall apply to all persons appointed to Civil Services and posts in connection with the affairs of the State of Gujarat, whose conditions of Service are regulated in accordance with the rules made under Article 309 of the Constitution.\n Provided that nothing in these rules shall apply to members of the  All India Services.\n Provided further that nothing in these rules except rules 2, 3, 5, 6, 12, 15 and 19 shall apply to persons appointed as Police Patels under the Bombay Village Police Act, 1867.\n\nIn other words\n\n 'These rules may be called the Gujarat Civil Services (Conduct) Rules, 1971.' This part simply states the title or name of the rules, which are officially known as the 'Gujarat Civil Services (Conduct) Rules, 1971'.\n 'They shall come into force from 15th August 1971.' This line specifies the date on which these rules become effective, which is August 15, 1971. This is the date from which these rules will be applicable and enforced.\n 'They shall apply to all persons appointed to Civil Services and posts in connection with the affairs of the State of Gujarat, whose conditions of Service are regulated in accordance with the rules made under Article 309 of the Constitution.' This part indicates the scope of applicability of these rules. They are meant to govern the conduct of individuals who are appointed to civil services and posts related to the state of Gujarat, and whose terms of service are determined based on rules established under Article 309 of the Indian Constitution. In other words, these rules apply to state government employees in Gujarat whose conditions of service are subject to constitutional regulations.\n 'Provided that nothing in these rules shall apply to members of the All India Services.'This provision specifies an exception. The rules do not apply to members of the All India Services. All India Services are services that operate at the central level, such as the Indian Administrative Service (IAS), Indian Police Service (IPS), and Indian Forest Service (IFS).\n 'Provided further that nothing in these rules except rules 2, 3, 5, 6, 12, 15, and 19 shall apply to persons appointed as Police Patels under the Bombay Village Police Act, 1867.' This provision adds another exception. While most of these rules do not apply to persons appointed as Police Patels under the Bombay Village Police Act, 1867, specific rules mentioned (2, 3, 5, 6, 12, 15, and 19) still apply to them. These specific rules likely contain general conduct and disciplinary provisions that apply to Police Patels. ",
          "(1)   These rules may be called the Gujarat Civil Services (Conduct) Rules,1971.\n(2)   They shall come into force from 15th August, 1971.\n(3)   They shall apply to all persons appointed to Civil Services and posts in connection with the affairs of the State of Gujarat, whose conditions of Service are regulated in accordance with the rules made under Article 309 of the Constitution.\n Provided that nothing in these rules shall apply to members of the  All India Services.\n Provided further that nothing in these rules except rules 2, 3, 5, 6, 12, 15 and 19 shall apply to persons appointed as Police Patels under the Bombay Village Police Act, 1867.\n\nIn other words\n\n(1) These rules may be called the Gujarat Civil Services (Conduct) Rules, 1971.\n This means that the title of the rules is 'Gujarat Civil Services (Conduct) Rules, 1971.'\n(2) They shall come into force from 15th August, 1971.\n This means that the rules came into effect on August 15, 1971.\n(3) They shall apply to all persons appointed to Civil Services and posts in connection with the affairs of the State of Gujarat, whose conditions of Service are regulated in accordance with the rules made under Article 309 of the Constitution.\n This means that the rules apply to all government servants in the state of Gujarat, whose conditions of service are regulated by the rules made under Article 309 of the Constitution of India.\n Provided that nothing in these rules shall apply to members of the  All India Services.\n This means that the rules do not apply to members of the All India Services, which are the Indian Administrative Service (IAS), the Indian Police Service (IPS), and the Indian Forest Service (IFS).\n Provided further that nothing in these rules except rules 2, 3, 5, 6, 12, 15 and 19 shall apply to persons appointed as Police Patels under the Bombay Village Police Act, 1867.\n This means that the rules do not apply to Police Patels, who are village police officers appointed under the Bombay Village Police Act, 1867, except for rules 2, 3, 5, 6, 12, 15, and 19.\n In summary, the Gujarat Civil Services (Conduct) Rules, 1971 apply to all government servants in the state of Gujarat, except for members of the All India Services and Police Patels, except for rules 2, 3, 5, 6, 12, 15, and 19.\n Here is a brief explanation of each of the rules mentioned in the proviso:\n  Rule 2: Requires government servants to maintain absolute integrity and devotion to duty.\n  Rule 3: Prohibits government servants from engaging in any activity that may be prejudicial to the interests of the government or the public interest.\n  Rule 5: Prohibits government servants from taking part in politics or elections.\n  Rule 6: Prohibits government servants from accepting gifts or favors from people with whom they have official dealings.\n  Rule 12: Prohibits government servants from disclosing confidential information.\n  Rule 15: Requires government servants to report any corruption or other wrongdoing that they come across.\n  Rule 19: Prohibits government servants from engaging in any activity that is unbecoming of their position."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Definitions",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Definitions?",
          "Explain Gujarat Civil Services (Conduct) Rules,1971 Definitions?",
          "Can you elaborate on the terminology used in the Gujarat Civil Services (Conduct) Rules, 1971?",
          "How do the Gujarat Civil Services (Conduct) Rules, 1971 clarify key terms and phrases?",
          "What are the specific terms defined in the Gujarat Civil Services (Conduct) Rules, 1971?"
        ],
        "responses": [
          "(a)  “the Government” means the Government of Gujarat.\n (b)  'Government Servant' means any person appointed to any civil service or post in connection with the affairs of the State of Gujarat, and includes also the following -\n(i)  a Government servant on deputation to other Government of India.\n(ii)  Government servant on foreign Service. \n (c)  'Members of Family' in relation to a Government servant includes -\n(i)  the wife of husband as the case may be, of the Government servant whether residing with the Government servant or not but does not include a wife or husband as the case may be,separated from the Government servant by a decree or order of a competent court, or in accordance with the personal law applicable to the Government servant.\n(ii)  son or daughter or step son or step daughter of the Government servant and wholly dependent on him or her but does not include a child or step child who is no longer in any way dependent on the Government servant or of whose custody, the Government servant has been deprived of by or under any law.\n(iii)  any other person related, whether by blood or marriage, to the Government Servant or to the Government servant's wife or husband, and wholly dependent on the Government servant.\n(d)  words and expression used but not defined in these rules shall have the meaning assigned to them in the Gujarat Civil Services (General Conditions of Services) Rules, 2002, or in the Gujarat Civil Services Classification and Recruitment (General) Rules, 1967.\n\nIn other words\n\n(a) 'the Government' means the Government of Gujarat: This part clarifies that in these rules, when it refers to 'the Government,' it specifically means the Government of Gujarat. This definition is necessary to specify the scope of the rules.\n(b) 'Government Servant' means any person appointed to any civil service or post in connection with the affairs of the State of Gujarat, and includes also the following:\n (i) a Government servant on deputation to other Government of India.\n (ii) Government servant on foreign Service: This part provides the definition of a 'Government Servant.' It encompasses any person appointed to civil services or posts related to the State of Gujarat. It also includes individuals who are on deputation to other parts of the Government of India or on foreign service. In other words, it covers government employees in various service arrangements.\n(c) 'Members of Family' in relation to a Government servant includes:\n (i) the wife or husband of the Government servant, whether residing with the Government servant or not but with exceptions mentioned for spouses separated by legal decree\n (ii) son, daughter, step-son, or step-daughter of the Government servant who is wholly dependent on the Government servant, with exceptions for children who are no longer dependent on the Government servant or have lost custody under any applicable law.\n (iii) any other person related by blood or marriage to the Government servant, the spouse of the Government servant, and wholly dependent on the Government servant: This part defines the scope of 'Members of Family' concerning a Government servant. It includes spouses, children (or step-children), and other individuals who are financially dependent on the Government servant.\n(d) 'words and expression used but not defined in these rules shall have the meaning assigned to them in the Gujarat Civil Services (General Conditions of Services) Rules, 2002, or in the Gujarat Civil Services Classification and Recruitment (General) Rules, 1967': This section clarifies that if any terms or expressions are used within these rules but are not explicitly defined, their meanings are to be interpreted based on the definitions provided in the Gujarat Civil Services (General Conditions of Services) Rules, 2002, or the Gujarat Civil Services Classification and Recruitment (General) Rules, 1967. This ensures consistency in interpretation and application of terms across different sets of rules. ",
          "(a)  “the Government” means the Government of Gujarat.\n (b)  'Government Servant' means any person appointed to any civil service or post in connection with the affairs of the State of Gujarat, and includes also the following -\n(i)  a Government servant on deputation to other Government of India.\n(ii)  Government servant on foreign Service. \n (c)  'Members of Family' in relation to a Government servant includes -\n(i)  the wife of husband as the case may be, of the Government servant whether residing with the Government servant or not but does not include a wife or husband as the case may be,separated from the Government servant by a decree or order of a competent court, or in accordance with the personal law applicable to the Government servant.\n(ii)  son or daughter or step son or step daughter of the Government servant and wholly dependent on him or her but does not include a child or step child who is no longer in any way dependent on the Government servant or of whose custody, the Government servant has been deprived of by or under any law.\n(iii)  any other person related, whether by blood or marriage, to the Government Servant or to the Government servant's wife or husband, and wholly dependent on the Government servant.\n(d)  words and expression used but not defined in these rules shall have the meaning assigned to them in the Gujarat Civil Services (General Conditions of Services) Rules, 2002, or in the Gujarat Civil Services Classification and Recruitment (General) Rules, 1967.\n\nIn other words\n\nSure. Here is an explanation of the definitions you provided:\n(a)  “the Government” means the Government of Gujarat.\n  This means that the term 'the Government' in the Gujarat Civil Services (Conduct) Rules, 1971 refers to the Government of the State of Gujarat.\n(b)  'Government Servant' means any person appointed to any civil service or post in connection with the affairs of the State of Gujarat, and includes also the following -\n (i)  a Government servant on deputation to other Government of India.\n (ii)  Government servant on foreign Service.\n This means that the term 'Government Servant' in the Gujarat Civil Services (Conduct) Rules, 1971 refers to any person who is appointed to any civil service or post in connection with the affairs of the State of Gujarat, including government servants who are on deputation to other government departments or who are on foreign service.\n(c)  'Members of Family' in relation to a Government servant includes -\n (i)  the wife of husband as the case may be, of the Government servant whether residing with the Government servant or not but does not include a wife or husband as the case may be,separated from the Government servant by a decree or order of a competent court, or in accordance with the personal law applicable to the Government servant.\n (ii)  son or daughter or step son or step daughter of the Government servant and wholly dependent on him or her but does not include a child or step child who is no longer in any way dependent on the Government servant or of whose custody, the Government servant has been deprived of by or under any law.\n (iii)  any other person related, whether by blood or marriage, to the Government Servant or to the Government servant's wife or husband, and wholly dependent on the Government servant.\n This means that the term 'Members of Family' in relation to a Government Servant includes the following:\n The Government Servant's wife or husband, whether residing with the Government Servant or not, but does not include a wife or husband who is separated from the Government Servant by a decree or order of a competent court, or in accordance with the personal law applicable to the Government Servant.\n The Government Servant's son or daughter, or step-son or step-daughter, who is wholly dependent on the Government Servant, but does not include a child or step-child who is no longer in any way dependent on the Government Servant or of whose custody the Government Servant has been deprived of by or under any law.\n Any other person related to the Government Servant, whether by blood or marriage, or to the Government Servant's wife or husband, who is wholly dependent on the Government Servant.\n(d)  words and expression used but not defined in these rules shall have the meaning assigned to them in the Gujarat Civil Services (General Conditions of Services) Rules, 2002, or in the Gujarat Civil Services Classification and Recruitment (General) Rules, 1967.\n This means that any words and expressions used in the Gujarat Civil Services (Conduct) Rules, 1971 that are not defined in the rules themselves will have the meaning assigned to them in the Gujarat Civil Services (General Conditions of Services) Rules, 2002, or in the Gujarat Civil Services Classification and Recruitment (General) Rules, 1967."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 General",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 General?",
          "Explain Gujarat Civil Services (Conduct) Rules,1971 General?",
          "How do the Gujarat Civil Services (Conduct) Rules, 1971 promote ethical conduct among government employees?",
          "What is the process for reporting a violation of the Gujarat Civil Services (Conduct) Rules, 1971?",
          "What are the consequences of violating the Gujarat Civil Services (Conduct) Rules, 1971?"
        ],
        "responses": [
          "(1) Every Government servant shall at all times - \n (i) maintain absolute integrity.\n (ii) maintain devotion to duty,and\n (iii) do nothing which is unbecoming of a Government servant.\n Explaination of clause(ii)-\n  A Government servant, who habitually fails to perform a task assigned to him within the time set for the purpose and with the quality of performance expected of him, shall be deemed to be lacking in devotion to duty.(2) No Government servant shall, in the performance of his official duties or in exercise of the powers conferred on him, act otherwise than in his best judgement except when he is acting under the direction of his official superior and shall, where he is acting under such direction, obtain the direction in writing, wherever practicable, and where it is not practicable to obtain the direction in writing, he shall obtain written confirmation of the direction as soon thereafter as possible.\n (3) All departmental rules and orders in respect of the subject dealt with in these rules which have been approved or may hereafter be approved by Government shall in so far as they are not inconsistent with any provisions of these rules, apply to Government servants to whom they relate.\n Explanation :- Nothing in sub-rule (2) shall be construed as empowering a Government servant to evade his responsibility by seeking instructions from or approval of a superior officer or authority when such instructions are not necessary under the scheme of districution of powers and responsibilities.\n (3-A) Promptness and Courtesy-\n  No Government servant shall\n (a) in the performance of his official duties, act in a discourteous manner.\n (b) in his official dealings with the public or otherwise adopt dilatory tactics or willfully cause delays in disposal of the work assigned to him.\n (3-B) Prohibition of sexual harassment of working women\n  (1) No Government servant shall indulge in any act of sexual harassment of any woman at her work place.(2) Every Government servant who is in charge of a work place shall take appropriate steps to prevent sexual harassment to any woman at such work place.Explanation :- \n For the purpose of this rule “Sexual harassment” includes such unwelcome sexually determined behaviour, whether directly or otherwise such as - \n (a) Physical contact and advances ;\n(b) demand or request for sexual favours ;\n (c) sexually coloured remarks ;\n (d) showing any pornography ; or\n (e) any other unwelcome physical, verbal or non-verbal conduct of a sexual nature\n (3-C) Prohibition regarding employment of children below 14 years of age-\n No Government servant shall employ to work any child below the age of 14 years.\n\nIn other words\n\n1.Every Government Servant shall at all times:\n (i) maintain absolute integrity: This means that a government servant must always be honest and ethical in their actions and behavior. They should not engage in any form of corruption or dishonesty.\n (ii) maintain devotion to duty:\nExplanation of clause (ii): This clause specifies that a government servant must perform their duties diligently and with a strong commitment to their responsibilities. If a government servant habitually fails to complete assigned tasks within the designated time and with the expected quality of performance, they are considered lacking in devotion to duty.\n (iii) do nothing which is unbecoming of a Government servant: This requires government servants to maintain a high standard of conduct and not engage in any actions that are inappropriate or unprofessional for their role.\n2.No Government servant shall, in the performance of his official duties:\n act otherwise than in his best judgment: Government servants are expected to use their own judgment and discretion when carrying out their official duties.\n except when he is acting under the direction of his official superior:\n  and shall, where he is acting under such direction, obtain the direction in writing, wherever practicable:\n  and where it is not practicable to obtain the direction in writing, he shall obtain written confirmation of the direction as soon thereafter as possible: This part emphasizes that government servants should act independently when performing their duties, except when they receive directions from their superiors. When following such directions, they should, whenever possible, get them in writing and, if not possible, obtain written confirmation as soon as they can.\n3.All departmental rules and orders in respect of the subject dealt with in these rules:\n which have been approved or may hereafter be approved by Government shall apply to Government servants to whom they relate:\n  Explanation: This means that any departmental rules and orders related to the subject matter covered by these rules, and that have been approved or may be approved by the government, will be applicable to the government servants they pertain to. This ensures that government servants are bound by the relevant departmental rules.\n3-A. Promptness and Courtesy:\n No Government servant shall:\n  (a) in the performance of his official duties, act in a discourteous manner.\n  (b) in his official dealings with the public or otherwise adopt dilatory tactics or willfully cause delays in the disposal of the work assigned to him: This section emphasizes the importance of being courteous and prompt in the performance of official duties and interactions with the public.\n3-B. Prohibition of sexual harassment of working women:\n (1) No Government servant shall indulge in any act of sexual harassment of any woman at her workplace.\n (2) Every Government servant who is in charge of a workplace shall take appropriate steps to prevent sexual harassment of any woman at such workplace.\n Explanation: This rule prohibits any form of sexual harassment in the workplace. It provides a definition of sexual harassment, which includes unwelcome sexually determined behavior, and places an obligation on those in charge of workplaces to prevent such harassment.\n3-C. Prohibition regarding employment of children below 14 years of age:\n No Government servant shall employ any child below the age of 14 years for work: This rule prohibits the employment of children under the age of 14, aligning with child labor laws.\n These rules are designed to ensure the integrity, efficiency, and ethical conduct of government servants in the state of Gujarat while also promoting courteous and responsible behavior in the workplace and addressing important issues like sexual harassment and child labor.",
          "(1) Every Government servant shall at all times - \n (i) maintain absolute integrity.\n (ii) maintain devotion to duty,and\n (iii) do nothing which is unbecoming of a Government servant.\n Explaination of clause(ii)-\n  A Government servant, who habitually fails to perform a task assigned to him within the time set for the purpose and with the quality of performance expected of him, shall be deemed to be lacking in devotion to duty.(2) No Government servant shall, in the performance of his official duties or in exercise of the powers conferred on him, act otherwise than in his best judgement except when he is acting under the direction of his official superior and shall, where he is acting under such direction, obtain the direction in writing, wherever practicable, and where it is not practicable to obtain the direction in writing, he shall obtain written confirmation of the direction as soon thereafter as possible.\n (3) All departmental rules and orders in respect of the subject dealt with in these rules which have been approved or may hereafter be approved by Government shall in so far as they are not inconsistent with any provisions of these rules, apply to Government servants to whom they relate.\n Explanation :- Nothing in sub-rule (2) shall be construed as empowering a Government servant to evade his responsibility by seeking instructions from or approval of a superior officer or authority when such instructions are not necessary under the scheme of districution of powers and responsibilities.\n (3-A) Promptness and Courtesy-\n  No Government servant shall\n (a) in the performance of his official duties, act in a discourteous manner.\n (b) in his official dealings with the public or otherwise adopt dilatory tactics or willfully cause delays in disposal of the work assigned to him.\n (3-B) Prohibition of sexual harassment of working women\n  (1) No Government servant shall indulge in any act of sexual harassment of any woman at her work place.(2) Every Government servant who is in charge of a work place shall take appropriate steps to prevent sexual harassment to any woman at such work place.Explanation :- \n For the purpose of this rule “Sexual harassment” includes such unwelcome sexually determined behaviour, whether directly or otherwise such as - \n (a) Physical contact and advances ;\n(b) demand or request for sexual favours ;\n (c) sexually coloured remarks ;\n (d) showing any pornography ; or\n (e) any other unwelcome physical, verbal or non-verbal conduct of a sexual nature\n (3-C) Prohibition regarding employment of children below 14 years of age-\n No Government servant shall employ to work any child below the age of 14 years.\n\nIn other words\n\nthese rules are the Gujarat Civil Services (Conduct) Rules, 1971. These rules are designed to ensure that government servants maintain high standards of integrity, devotion to duty, and conduct.\n Here is a summary of the rules you have provided:\n  Rule 1: Every government servant must maintain absolute integrity, devotion to duty, and avoid doing anything unbecoming of a government servant.\n  Rule 2: No government servant shall act otherwise than in their best judgment, except when acting under the direction of a superior officer. Where the government servant is acting under the direction of a superior officer, they must obtain the direction in writing, wherever practicable. If it is not practicable to obtain the direction in writing, the government servant must obtain written confirmation of the direction as soon as possible.\n  Rule 3: All departmental rules and orders in respect of the subject dealt with in the Gujarat Civil Services (Conduct) Rules, 1971 shall apply to government servants to whom they relate.\n  Rule 3-A: No government servant shall act in a discourteous manner or adopt dilatory tactics in the performance of their official duties.\n  Rule 3-B: No government servant shall indulge in any act of sexual harassment of any woman at her work place. Every government servant who is in charge of a work place shall take appropriate steps to prevent sexual harassment to any woman at such work place.\n  Rule 3-C: No government servant shall employ to work any child below the age of 14 years.\nThese rules are important because they help to ensure that government servants are accountable for their actions and that they maintain high standards of conduct. When government servants uphold these rules, it helps to build public trust in government and to ensure that the government is run in a fair and efficient manner."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Employment of near relatives of Government servants in company or firm enjoying Government patronage",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Employment of near relatives of Government servants in company or firm enjoying Government patronage?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 Employment of near relatives of Government servants in company or firm enjoying Government patronage?",
          "How does the Gujarat Civil Services (Conduct) Rules, 1971 address situations where government servants' near relatives are employed in firms that have a close association with the government?",
          "What are the restrictions for government employees in Gujarat when it comes to their near relatives' employment in companies benefiting from government patronage?",
          "tell me about Gujarat Civil Services (Conduct) Rules,1971 Employment of near relatives of Government servants in company or firm enjoying Government patronage"
        ],
        "responses": [
          "(1)   No Government servant shall use his position or influence directly or indirectly to secure employment for any member of his family in any 1(company or firm) except in relation to persons or bodies with whom he is personally or socially connected otherwise than by virtue of any office held by him during his service.\n (2)   (i) No class I or II officer shall, except with the previous sanction of the Government permit his son or any member of his family to accept employment in any 1 (company or firm) with which he has official dealing or in any other 1 (company or firm) having official dealings with the Government.\n   Provided that where the acceptance of the employment cannot await prior permission of the Government or is otherwise considered urgent, the matter shall be reported to the Government forthwith and the employment may be accepted provisionally subject to the permission of the Government.\n(ii)  A Government servant shall, as soon as he becomes aware of the acceptance by a member of his family of an employment in any 1(company or firm), intimate such acceptance to the prescribed authority and shall also intimate whether he has or has any official dealing with that 1 (company or firm).\n  Provided, that no such intimation shall be necessary in case of a class I or II officer if he has already obtained the sanction of or sent a report to, the Government under clause (i).\n(3)  No Government servant shall in the discharge of his official duties deal with any matter or give sanction any contract to any 1 (company or firm) or any other person if any member of his family is employed in that 1 (company or firm) or under that person or if he or any member of his family is interested in such matter or contract in any other manner and the Government servant shall refer every such matter or contract to his official superior and the matter or contract shall thereafter be disposed of according to the instruction of the authority to whom the reference is made.\n\nIn other words\n\n1.No Government servant shall use his position or influence directly or indirectly to secure employment for any member of his family in any company or firm, except in relation to persons or bodies with whom he is personally or socially connected otherwise than by virtue of any office held by him during his service:\n This rule prohibits government servants from using their official position or influence to help secure employment for their family members in any company or firm. However, there may be exceptions for persons or bodies with whom they have personal or social connections unrelated to their official position.\n2.(i) No class I or II officer shall, except with the previous sanction of the Government, permit his son or any member of his family to accept employment in any company or firm with which he has official dealings or in any other company or firm having official dealings with the Government:\n This provision imposes specific restrictions on Class I or Class II officers. They are required to seek prior permission from the government before allowing their family members (sons or other eligible family members) to accept employment in a company or firm with which they have official dealings or in any other company or firm having official dealings with the government.\n Provided that where the acceptance of the employment cannot await prior permission of the Government or is otherwise considered urgent, the matter shall be reported to the Government forthwith, and the employment may be accepted provisionally subject to the permission of the Government:\n  In urgent situations, where obtaining prior permission is not feasible, the officer can provisionally allow their family member to accept employment but must promptly report this to the government. The final acceptance of employment is subject to the government's permission.\n (ii) A Government servant shall, as soon as he becomes aware of the acceptance by a member of his family of an employment in any company or firm, intimate such acceptance to the prescribed authority and shall also intimate whether he has or has any official dealing with that company or firm:\n  When a government servant becomes aware that a family member has accepted employment in a company or firm, they must promptly inform the relevant authority. Additionally, they should disclose whether they have official dealings with that specific company or firm.\n  Provided, that no such intimation shall be necessary in case of a class I or II officer if he has already obtained the sanction of or sent a report to the Government under clause (i):\n   Class I or Class II officers who have already received government sanction or reported the matter to the government under clause (i) do not need to make a separate intimation.\n3.No Government servant shall, in the discharge of his official duties, deal with any matter or give sanction to any contract to any company or firm or any other person:\n This rule prevents government servants from participating in matters or approving contracts involving any company, firm, or individual if any member of their family is employed by that company or firm or if the government servant or any family member has an interest in that matter or contract in any other way.\n the Government servant shall refer every such matter or contract to his official superior:\n  In such cases, the government servant must refer the matter or contract to their official superior.\n and the matter or contract shall thereafter be disposed of according to the instruction of the authority to whom the reference is made:\n  The final decision regarding such matters or contracts will be made by the authority to whom the reference is submitted.\n These rules are designed to prevent conflicts of interest, ensure transparency, and maintain the integrity of government servants in their official dealings with companies or firms and in matters related to the employment of their family members. It establishes procedures to seek government permission or report such situations to relevant authorities.",
          "(1)   No Government servant shall use his position or influence directly or indirectly to secure employment for any member of his family in any 1(company or firm) except in relation to persons or bodies with whom he is personally or socially connected otherwise than by virtue of any office held by him during his service.\n (2)   (i) No class I or II officer shall, except with the previous sanction of the Government permit his son or any member of his family to accept employment in any 1 (company or firm) with which he has official dealing or in any other 1 (company or firm) having official dealings with the Government.\n   Provided that where the acceptance of the employment cannot await prior permission of the Government or is otherwise considered urgent, the matter shall be reported to the Government forthwith and the employment may be accepted provisionally subject to the permission of the Government.\n(ii)  A Government servant shall, as soon as he becomes aware of the acceptance by a member of his family of an employment in any 1(company or firm), intimate such acceptance to the prescribed authority and shall also intimate whether he has or has any official dealing with that 1 (company or firm).\n  Provided, that no such intimation shall be necessary in case of a class I or II officer if he has already obtained the sanction of or sent a report to, the Government under clause (i).\n(3)  No Government servant shall in the discharge of his official duties deal with any matter or give sanction any contract to any 1 (company or firm) or any other person if any member of his family is employed in that 1 (company or firm) or under that person or if he or any member of his family is interested in such matter or contract in any other manner and the Government servant shall refer every such matter or contract to his official superior and the matter or contract shall thereafter be disposed of according to the instruction of the authority to whom the reference is made.\n\nIn other words\n\nThe rules are from the Gujarat Civil Services (Conduct) Rules, 1971. These rules are designed to prevent government servants from using their position or influence for personal gain, and to ensure that they act in a fair and impartial manner.\n Rule 1:prohibits government servants from using their position or influence to secure employment for members of their family in any company or firm, except in relation to persons or bodies with whom they are personally or socially connected otherwise than by virtue of any office held by them during their service.\n Rule 2:\n  (i) prohibits Class I and II officers from permitting their sons or any members of their family to accept employment in any company or firm with which the officer has official dealings, or in any other company or firm having official dealings with the government. This rule is designed to prevent conflicts of interest.\n  (ii) requires government servants to intimate the prescribed authority as soon as they become aware of a member of their family accepting employment in any company or firm. This is to ensure that the government is aware of any potential conflicts of interest.\n Rule 3:prohibits government servants from dealing with any matter or giving sanction to any contract to any company or firm or any other person if any member of their family is employed in that company or firm or under that person, or if they or any member of their family is interested in such matter or contract in any other manner. This rule is designed to prevent government servants from using their position for personal gain.\n These rules are important because they help to ensure that government servants act in a fair and impartial manner, and that they do not use their position for personal gain. When government servants uphold these rules, it helps to build public trust in government and to ensure that the government is run in a fair and efficient manner.\n Here are some examples of how the rules above might apply in practice:\n  A government servant should not use their position to try to get their son a job in a company that they have official dealings with.\n  A government servant should not award a contract to a company that their spouse is employed by.\n  A government servant should not make a decision about a matter that they have a personal interest in.\n If a government servant believes that they may have a conflict of interest, they should disclose this to their supervisor and seek guidance."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Taking part in Politics and Elections",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Taking part in Politics and Elections?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 Taking part in Politics and Elections?",
          "tell me about Gujarat Civil Services (Conduct) Rules,1971 Taking part in Politics and Elections?",
          "How do the Gujarat Civil Services (Conduct) Rules, 1971, aim to maintain the political neutrality of civil servants in the state?",
          "What are the consequences for a civil servant in Gujarat who contests elections without resigning from their government job"
        ],
        "responses": [
          "(1)  No Government servant shall be a member of or be otherwise associated with any political party or any organisation which ordinarily takes part in politics nor shall he take part in, subscribe in aid of, or assist, in any other manner any political movement or activity.\n(2)  It shall be the duty of every Government servant to endeavour to prevent any member of his family from taking part in, subscribing in aid of, or assisting in any other manner any movement or activity which is, or trends directly or indirectly to be, subversive of any Government in India as by law established and where a Government servant is unable to prevent a member of his family from taking part in, subscribing in aid of, or assisting in any other manner, any such movement or activity, he shall make a report to that effect to Government.\n(3)  If any question arises whether a party is a political party or whether any organisation takes part in politics or whether any movement or activity falls within the scope of this rule, the decision of the Government thereon shall be final.\n(4)  No Government servant shall drectly or indirectly canvass or otherwise interfere or in any manner whatsoever use his influence in connection with, or take part in any form, in an election to any legislature or local authority.\nProvided that -\n (i)  A Government servant qualified to vote at such election may exercise his right to vote, but where he does so, he shall give no indication of the manner in which he proposes to vote or has voted.\n (ii)  A Government servant shall not be deemed to have contravened the provisions of this rule by reason only that he assists in the conduct of an election in the due performance of a duty imposed on him by or under any law for the time being in force, or by an order of Government.\nExplanation :-  The display by a Government servant on his person, vehicle or residence of any electoral symbol, shall amount to using his influence in connection with an election within the meaning of this sub-rule.\n\nIn other words\n\nThe rules are from the Gujarat Civil Services (Conduct) Rules, 1971. These rules are designed to prevent government servants from using their position or influence for personal gain, and to ensure that they act in a fair and impartial manner.\n Rule 1:prohibits government servants from using their position or influence to secure employment for members of their family in any company or firm, except in relation to persons or bodies with whom they are personally or socially connected otherwise than by virtue of any office held by them during their service.\n Rule 2:\n  (i) prohibits Class I and II officers from permitting their sons or any members of their family to accept employment in any company or firm with which the officer has official dealings, or in any other company or firm having official dealings with the government. This rule is designed to prevent conflicts of interest.\n  (ii) requires government servants to intimate the prescribed authority as soon as they become aware of a member of their family accepting employment in any company or firm. This is to ensure that the government is aware of any potential conflicts of interest.\n Rule 3:prohibits government servants from dealing with any matter or giving sanction to any contract to any company or firm or any other person if any member of their family is employed in that company or firm or under that person, or if they or any member of their family is interested in such matter or contract in any other manner. This rule is designed to prevent government servants from using their position for personal gain.\n These rules are important because they help to ensure that government servants act in a fair and impartial manner, and that they do not use their position for personal gain. When government servants uphold these rules, it helps to build public trust in government and to ensure that the government is run in a fair and efficient manner.\n Here are some examples of how the rules above might apply in practice:\n  A government servant should not use their position to try to get their son a job in a company that they have official dealings with.\n  A government servant should not award a contract to a company that their spouse is employed by.\n  A government servant should not make a decision about a matter that they have a personal interest in.\n If a government servant believes that they may have a conflict of interest, they should disclose this to their supervisor and seek guidance.",
          "(1)  No Government servant shall be a member of or be otherwise associated with any political party or any organisation which ordinarily takes part in politics nor shall he take part in, subscribe in aid of, or assist, in any other manner any political movement or activity.\n(2)  It shall be the duty of every Government servant to endeavour to prevent any member of his family from taking part in, subscribing in aid of, or assisting in any other manner any movement or activity which is, or trends directly or indirectly to be, subversive of any Government in India as by law established and where a Government servant is unable to prevent a member of his family from taking part in, subscribing in aid of, or assisting in any other manner, any such movement or activity, he shall make a report to that effect to Government.\n(3)  If any question arises whether a party is a political party or whether any organisation takes part in politics or whether any movement or activity falls within the scope of this rule, the decision of the Government thereon shall be final.\n(4)  No Government servant shall drectly or indirectly canvass or otherwise interfere or in any manner whatsoever use his influence in connection with, or take part in any form, in an election to any legislature or local authority.\nProvided that -\n (i)  A Government servant qualified to vote at such election may exercise his right to vote, but where he does so, he shall give no indication of the manner in which he proposes to vote or has voted.\n (ii)  A Government servant shall not be deemed to have contravened the provisions of this rule by reason only that he assists in the conduct of an election in the due performance of a duty imposed on him by or under any law for the time being in force, or by an order of Government.\nExplanation :-  The display by a Government servant on his person, vehicle or residence of any electoral symbol, shall amount to using his influence in connection with an election within the meaning of this sub-rule.\n\nIn other words\n\nThis is a set of rules and regulations related to the conduct of government servants in India, particularly in their interactions with politics and political activities. Let me break down each of the points mentioned in the passage:\n1.Prohibition of Political Association: This rule states that no government servant (an employee of the government) in India is allowed to be a member of or associated with any political party or any organization that is involved in politics. Furthermore, they are prohibited from actively participating in, supporting, or assisting any political movement or activity.\n2.Duty to Prevent Family Involvement: Government servants have a duty to make an effort to prevent any member of their family from getting involved in or supporting any movement or activity that could be considered subversive to the established government of India. If they are unable to prevent such involvement, they must report it to the government.\n3.Final Decision by the Government: If there is any question or dispute about whether a particular party is a political party, whether an organization is involved in politics, or whether a specific movement or activity falls under these rules, the government's decision on these matters is considered final.\n4.Restrictions on Involvement in Elections: Government servants are prohibited from directly or indirectly engaging in election-related activities. This includes canvassing, using their influence, or participating in any form in elections to legislatures or local authorities. However, there are two exceptions:\n  Qualified Voting: Government servants who are eligible to vote in elections may exercise their right to vote. Still, they must not disclose how they intend to vote or how they have voted.\n  Duties Imposed by Law: Government servants are not considered to have violated these rules if they participate in election-related activities as part of their official duties under the law or by government order. However, this participation should be solely for the proper performance of their official responsibilities.\nExplanation: If a government servant displays an electoral symbol (such as a political party symbol) on their person, vehicle, or residence, it is considered as using their influence in connection with an election, which is not allowed under these rules.\n These rules are in place to maintain the neutrality and impartiality of government servants and ensure that they do not become involved in political activities that could compromise the functioning and integrity of the government of India. Violation of these rules could result in disciplinary actions or other consequences as specified by government regulations."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Demonstrations and strikes",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Demonstrations and strikes?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 Demonstrations and strikes?",
          "How do the Gujarat Civil Services (Conduct) Rules, 1971, address the involvement of government employees in strikes and demonstrations?",
          "What is the stance of the Gujarat government on government employees' involvement in strikes or demonstrations based on the Civil Services (Conduct) Rules?",
          "tell me about Gujarat Civil Services (Conduct) Rules,1971 Demonstrations and strikes?"

        ],
        "responses": [
          "No Government servant shall -\n (i) engage himself, or participate in any demonstration which is prejudicial to the interest or the soverignty and integrity of India, the security of the State, friendly relations with foreign States, Public Order, decency or mortality or which involves contempt of court, defamation or incitement to an offecne, or\n (ii) resort to or in any way abet any form of strike.\nExplanation :- For the purpose of this rule, the expression “strike” means the cessation of work by Government servant in combination or a concerted refusal or refusal under a common understanding of any number of Government servants and includes -\n (i) refusal to work overtime where such work is necessary.\n (ii) any other conduct which is likely to result in, or results in, cessation or substantial retradation of Government work.\n\nIn other words\n\nthis rules are additional rules and regulations for government servants in India, focusing on their conduct in relation to activities that could be prejudicial to the interests of the state and their participation in strikes. Let's break down these rules:\n1.Prohibition of Participation in Demonstrations: Government servants are prohibited from engaging in or participating in any demonstration that is detrimental to various aspects, including:\n Interest of India: Demonstrations that are against the interest of the country.\n Sovereignty and Integrity of India: Demonstrations that threaten the territorial integrity and unity of the nation.\n Security of the State: Demonstrations that pose a threat to the security of the country.\n Friendly Relations with Foreign States: Demonstrations that could harm international relations or diplomatic ties with other nations.\n Public Order: Demonstrations that disrupt public order and safety.\n Decency or Morality: Demonstrations that involve indecency or immorality.\n Contempt of Court: Demonstrations that show contempt or disrespect for the judiciary.\n Defamation: Demonstrations that involve false statements or damage the reputation of individuals or institutions.\n Incitement to an Offense: Demonstrations that encourage or provoke the commission of a criminal offense.\n2.Prohibition of Strikes: Government servants are also not allowed to participate in any form of strike or to support strikes in any way. The term 'strike' is defined as the cessation of work by government servants either individually or collectively under a common understanding. This includes:\n Refusal to Work Overtime: If overtime work is deemed necessary by the government, government servants are not allowed to refuse to work beyond their regular hours.\n Any Other Conduct Affecting Work: Any other conduct that has the potential to lead to or results in a significant delay or cessation of government work is also considered a form of strike.\nExplanation: These rules are in place to ensure that government servants maintain discipline and neutrality in their roles and do not engage in activities or actions that could disrupt the functioning of the government or harm the interests of the state. Participation in demonstrations that threaten national security, sovereignty, and public order, as well as involvement in strikes that disrupt government operations, is strictly prohibited for government servants. Violation of these rules may lead to disciplinary actions or other consequences in accordance with government regulations.",
          "No Government servant shall -\n (i) engage himself, or participate in any demonstration which is prejudicial to the interest or the soverignty and integrity of India, the security of the State, friendly relations with foreign States, Public Order, decency or mortality or which involves contempt of court, defamation or incitement to an offecne, or\n (ii) resort to or in any way abet any form of strike.\nExplanation :- For the purpose of this rule, the expression “strike” means the cessation of work by Government servant in combination or a concerted refusal or refusal under a common understanding of any number of Government servants and includes -\n (i) refusal to work overtime where such work is necessary.\n (ii) any other conduct which is likely to result in, or results in, cessation or substantial retradation of Government work.\n\nIn other words\n\nThe rules are from the Gujarat Civil Services (Conduct) Rules, 1971. These rules are designed to ensure that government servants maintain a high level of professionalism and conduct.\n Rule 1:prohibits government servants from:\n  Engaging in or participating in any demonstration that is prejudicial to the interests or the sovereignty and integrity of India, the security of the State, friendly relations with foreign States, public order, decency, or morality, or which involves contempt of court, defamation, or incitement to an offense.\n  Resorting to or in any way abetting any form of strike.\n The explanation to Rule 1 defines the term 'strike' to mean the cessation of work by government servants in combination, or a concerted refusal or refusal under a common understanding of any number of government servants, and includes:\n  Refusal to work overtime where such work is necessary.\n  Any other conduct which is likely to result in, or results in, cessation or substantial retardation of government work.\n These rules are important because they help to ensure that government servants remain focused on their duties and do not engage in activities that could disrupt government operations or undermine public trust in government.\n Here are some examples of how the rules above might apply in practice:\n  A government servant should not participate in a demonstration that is protesting against the government's policies.\n  A government servant should not refuse to work overtime if they are asked to do so by their supervisor.\n  A government servant should not join a strike organized by other government employees.\n If a government servant believes that they have been asked to do something that is in violation of these rules, they should raise their concerns with their supervisor."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Joining of Association by Government servants",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Joining of Association by Government servants?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 Joining of Association by Government servants?",
          "tell me about Gujarat Civil Services (Conduct) Rules,1971 Joining of Association by Government servants",
          "How do the Gujarat Civil Services (Conduct) Rules, 1971, address the topic of government servants' association memberships?",
          "What are the provisions related to government employees and their involvement in associations outlined in the Gujarat Civil Services (Conduct) Rules, 1971?"

        ],
        "responses": [
          "  No Government servant shall join, or continue to be a member of an association, the objects or activities of which are prejudicial to the interest of the soverignty and integrity of India or Public Order or morality.\n\nIn other words\n\nthis rule that applies to government servants in India, and it prohibits them from joining or remaining members of any association that has objectives or activities that are detrimental to various aspects, including the sovereignty and integrity of India, public order, or morality. Let's break down the key points:\n1.Prohibition on Association Membership: Government servants are not allowed to become members of any association or organization that promotes or engages in activities that are harmful to the following:\n  Sovereignty and Integrity of India: This refers to the territorial unity, independence, and self-governance of the nation. Associations that work against the sovereignty and integrity of India would be considered harmful to the nation's fundamental unity and independence.\n  Public Order: Associations that disrupt public order and safety are not to be joined by government servants. Public order is essential for the smooth functioning of society, and any group that seeks to undermine it is considered prejudicial to the state.\n  Morality: Associations that engage in activities that are morally or ethically questionable or harmful to public decency and ethics are also off-limits for government servants.\n Explanation: This rule is in place to ensure that government servants do not associate themselves with organizations that could undermine the sovereignty, security, and moral fabric of the country. It's essential for government servants to maintain their neutrality and protect the interests of the state. Associations with objectives or activities that run counter to these interests may lead to conflicts of interest or potential harm to the government's image and functionality. Violation of this rule could result in disciplinary actions or other consequences in line with government regulations.",
          "  No Government servant shall join, or continue to be a member of an association, the objects or activities of which are prejudicial to the interest of the soverignty and integrity of India or Public Order or morality.\n\nIn other words\n\nThe rule prohibiting government servants from associating with organizations that are harmful to the sovereignty and integrity of India, public order, or morality is an important one. It helps to ensure that government servants remain impartial and focused on their duties, and that they do not associate themselves with groups that could undermine the public trust in government.\n This rule is also consistent with the principles of good governance and public service. Government servants are entrusted with a high degree of responsibility and power, and they must use this power ethically and in the best interests of the public. Associating with groups that are harmful to the sovereignty and integrity of India, public order, or morality could compromise their ability to do so.\n Here are some specific examples of how this rule might apply in practice:\n  A government servant should not join a political party or organization that advocates for the secession of a particular region from India.\n  A government servant should not join a religious organization that is known to engage in violence or intolerance.\n  A government servant should not join a social media group that spreads misinformation or hate speech.\n If a government servant is unsure whether a particular association is harmful to the sovereignty and integrity of India, public order, or morality, they should consult with their supervisor or another trusted source."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Conncetion with Press or Radio",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Conncetion with Press or Radio?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 Conncetion with Press or Radio?",
          "How do the Gujarat Civil Services (Conduct) Rules, 1971, regulate civil servants' engagement with the media?",
          "How do the rules ensure that government employees maintain ethical standards when communicating with the press or participating in radio broadcasts?",
          "What are the provisions in the Gujarat Civil Services (Conduct) Rules, 1971, regarding interactions with the media, including newspapers and broadcasting?"
        ],
        "responses": [
          " (1) No Government servant shall, except with the previous sanction of the Government own wholly or in part, or conduct or participate in editing or management or, any newspaper or other periodical publication.\n (2) No Government servant shall, except with the previous sanction of the Government or of the prescribed authority or except in the bonafide discharge of his duties -\n  (a) publish a book himself or through a publisher, or contribute an article to a book or a complilation of articles, or \n  (b) participate in a radio broadcast or contribute an article or write a letter to news-paper or periodical.\n either in his own name of anonymously, or pseudonymously or in the name or any other person :\nProvided that no such sanction shall be required -\n  (i) if such publication is through a publisher and is of a purely literary, artistic or scientific character, or\n  (ii) if such contribution, broadcast, or writing is of a purely literary, artistic or scientific character.\n\nIn other words\n\nthese rules and regulations pertaining to government servants in India and their involvement in owning, editing, or participating in various forms of publications, including newspapers, books, radio broadcasts, and written contributions. Let's break down the key points of these rules:\n1.Ownership and Management of Newspapers and Periodicals: \n Ownership Prohibition: Government servants are not allowed to own, wholly or in part, or be involved in the editing or management of any newspaper or other periodical publication without prior permission from the government.\n2.Publication and Contribution to Literary Works, Broadcasts, and Written Content:\n Book Publication: Government servants are prohibited from publishing a book, either on their own or through a publisher, without obtaining prior permission from the government, except when it is in the bona fide discharge of their official duties.\n Contributions to Books: Similarly, they must seek permission to contribute articles to a book or a compilation of articles unless it's part of their official duties.\n Radio Broadcast and Written Content: Government servants need prior permission to participate in a radio broadcast or contribute articles or write letters to newspapers or periodicals, whether under their own name, anonymously, pseudonymously, or in someone else's name. Again, this is unless it's a bona fide discharge of their official duties.\n3.Exceptions to Sanction Requirements:\n Literary, Artistic, or Scientific Works: No prior sanction is required for publications, contributions, broadcasts, or writings that are purely of a literary, artistic, or scientific character. In such cases, government servants are free to engage in these activities without seeking formal permission.\nExplanation: These rules are designed to maintain the integrity, impartiality, and neutrality of government servants in India. By requiring prior permission for certain activities related to publications and broadcasts, the government aims to ensure that government servants do not use their positions to engage in activities that could conflict with their official roles or undermine the interests of the state. While these rules impose restrictions, they also provide exemptions for works of purely literary, artistic, or scientific nature, acknowledging that such activities may not necessarily compromise the public interest or government's functioning. Violation of these rules may result in disciplinary actions or other consequences as per government regulations.",
          "(1) No Government servant shall, except with the previous sanction of the Government own wholly or in part, or conduct or participate in editing or management or, any newspaper or other periodical publication.\n (2) No Government servant shall, except with the previous sanction of the Government or of the prescribed authority or except in the bonafide discharge of his duties -\n  (a) publish a book himself or through a publisher, or contribute an article to a book or a complilation of articles, or \n  (b) participate in a radio broadcast or contribute an article or write a letter to news-paper or periodical.\n either in his own name of anonymously, or pseudonymously or in the name or any other person :\nProvided that no such sanction shall be required -\n  (i) if such publication is through a publisher and is of a purely literary, artistic or scientific character, or\n  (ii) if such contribution, broadcast, or writing is of a purely literary, artistic or scientific character.\n\nIn other words\n\nThe rules are from the Gujarat Civil Services (Conduct) Rules, 1971. These rules are designed to ensure that government servants maintain a high level of professionalism and conduct.\n Rule 1:prohibits government servants from owning, wholly or in part, or conducting or participating in the editing or management of any newspaper or other periodical publication, except with the previous sanction of the Government.\n Rule 2:prohibits government servants from publishing a book themselves or through a publisher, or contributing an article to a book or a compilation of articles, or participating in a radio broadcast or contributing an article or writing a letter to a newspaper or periodical, either in their own name or anonymously, pseudonymously, or in the name of any other person, except with the previous sanction of the Government or of the prescribed authority, or except in the bona fide discharge of their duties.\n However, there is a proviso to Rule 2 which states that no such sanction is required:\n  If such publication is through a publisher and is of a purely literary, artistic, or scientific character.\n  If such contribution, broadcast, or writing is of a purely literary, artistic, or scientific character.\n These rules are important because they help to ensure that government servants do not use their position to influence public opinion or to promote their own personal interests. They also help to protect the government from being associated with the views of individual government servants.\n Here are some examples of how the rules above might apply in practice:\n  A government servant should not write a newspaper article criticizing the government's policies without first obtaining permission from their supervisor.\n  A government servant should not publish a book on politics or current affairs without first obtaining permission from the government.\n  A government servant can write a book on a purely literary, artistic, or scientific topic without obtaining permission from the government.\n  A government servant can give a radio interview on a purely literary, artistic, or scientific topic without obtaining permission from the government.\nIf a government servant is unsure whether a particular activity is covered by these rules, they should consult with their supervisor."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Criticism of Government",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Criticism of Government?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 Criticism of Government?",
          "How have civil society or advocacy groups voiced their criticisms of the government's enforcement of the Gujarat Civil Services (Conduct) Rules, 1971?",
          "What are the areas where the Gujarat government's rules and regulations for civil services have faced criticism or opposition from various stakeholders?",
          "What are the criticisms or drawbacks associated with the Gujarat Civil Services (Conduct) Rules, 1971?"
        ],
        "responses": [
          "  No Government servant shall in any radio broadcast or in any document published in his own name, or anonymously, pseudonymously, or in the name of any other person, or in any communication to the press, or in public utterance, make any statement of facts or opinion -\n (i) which has the effect of an adverse criticism of any current or recent policy, or action of the Central Government, or of State Government :\n  Provided that in the case of any Government servant included any category of Government servants specified in sub-rule (3) or rule 1,nothing contained in this clause shall apply to bonafide expression of views by him as an office bearer of a trade union of such Government servants for the purpose of safeguarding the conditions of service of such Government servants or for securing an improvement thereof.\n (ii) which is capable of embrassing the relations between the Central Government and the Government of any State or\n (iii) which is capable of embrassing the relations between the Central Government and the Government of any foreign state :\n  Provided that nothing in this rule shall apply to any statement made or views expressed by a Government servant in his official capacity or in the due performance of the duties assigned to him. "
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 communication of official information",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 communication of official information?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 communication of official information?",
          "How does the Gujarat Civil Services (Conduct) Rules, 1971, address issues related to confidentiality and official information sharing?",
          "What are the guidelines in the Gujarat Civil Services (Conduct) Rules, 1971, regarding the disclosure of official information?",
          "What does the Gujarat Civil Services (Conduct) Rules, 1971, specify about the handling of official information by civil servants?"
        ],
        "responses": [
          "  Every Government servant shall, in performance of his duties in good faith, communicate information to a person in accordance with the Right of Information Act,2005 (22 of 2005) and the rules made there under:\n  Provided that no Government servant shall, except in accordance with any general or special order of the Government or in performance in good faith of the duties assigned to him, communicate, directly or indirectly, any official document or any part thereof or classified information to any Government servant or any other person to whom he is not authorized to communicate such document or classified information\n\nIn other words\n\nThese rule relates to the communication of information by government servants in India, particularly in the context of the Right to Information Act, 2005. Let's break down the key points of these rules:\n1.Duty to Communicate Information under the Right to Information Act, 2005:\n Every government servant is required to, in good faith, communicate information to a person in accordance with the provisions of the Right to Information Act, 2005, and the rules made under this act.\n2.Restrictions on Communication of Official Documents and Classified Information:\n Government servants are prohibited from communicating, directly or indirectly, any official document or any part thereof, as well as classified information, to any other government servant or any person who is not authorized to receive such documents or classified information.\n3.Exceptions:\n There are two exceptions to the general rule:\n  In accordance with Government Orders: Government servants may communicate official documents or classified information in accordance with general or special orders issued by the government.\n  In the Performance of Assigned Duties: They may also do so when it is necessary for the proper performance of their assigned duties and responsibilities and is done in good faith.\n Explanation: These rules are in place to ensure that government servants follow the provisions of the Right to Information Act, 2005, which allows citizens to access information held by the government, subject to certain restrictions and conditions. Government servants are generally expected to provide information when requested by citizens under this act. However, they must not disclose official documents or classified information to unauthorized individuals unless specifically authorized by government orders or when it is essential for the legitimate performance of their official duties. Unauthorized disclosure of sensitive documents or classified information can have serious legal and security implications, so these rules are designed to ensure responsible handling of such information.",
          "  Every Government servant shall, in performance of his duties in good faith, communicate information to a person in accordance with the Right of Information Act,2005 (22 of 2005) and the rules made there under:\n  Provided that no Government servant shall, except in accordance with any general or special order of the Government or in performance in good faith of the duties assigned to him, communicate, directly or indirectly, any official document or any part thereof or classified information to any Government servant or any other person to whom he is not authorized to communicate such document or classified information.\n\nIn other words\n\nThis rule states that every government servant in India is obligated to communicate information to a person in accordance with the Right of Information Act, 2005 (RTI Act) and the rules made thereunder, in the performance of their duties in good faith. However, there is a proviso to this rule which states that no government servant shall communicate any official document or any part thereof, or any classified information, to any government servant or any other person to whom they are not authorized to communicate such document or classified information, except in accordance with any general or special order of the Government or in the performance in good faith of the duties assigned to them.\n This means that government servants have a duty to provide information to the public under the RTI Act, but they are also prohibited from disclosing confidential or classified information. This is to ensure that the government's ability to function effectively is not compromised.\n Here are some examples of how the rule above might apply in practice:\n  A government servant should provide information to a citizen about the government's policies or programs, unless that information is confidential or classified.\n  A government servant should not disclose the names of government employees who are working on a sensitive project, unless they are authorized to do so by the government.\n  A government servant should not disclose confidential information about a government contract, unless they are authorized to do so by the government.\n If a government servant is unsure whether they are authorized to disclose a particular piece of information, they should consult with their supervisor.\n The RTI Act is an important piece of legislation that promotes transparency and accountability in government. It gives citizens the right to access information held by government agencies, and it helps to ensure that government servants are performing their duties in a responsible manner."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Evidence before a committee or any other authority ",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Evidence before a committee or any other authority ?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 Evidence before a committee or any other authority ?",
          "How do the Gujarat Civil Services (Conduct) Rules, 1971, safeguard the rights of civil servants to submit documents as evidence in their defense during disciplinary proceedings?",
          "What provisions are there in the Gujarat Civil Services (Conduct) Rules, 1971, regarding the cross-examination of witnesses during disciplinary proceedings?",
          "How does the Gujarat Civil Services (Conduct) Rules, 1971, ensure a fair and transparent process for presenting evidence in disciplinary cases?"
        ],
        "responses": [
          " (1) Save as provided in sub-rule (3), no Government servant shall, except with the previous sanction of the Government, give evidence in connection with any enquiry conducted by any person, committee, or authority.\n (2) Where any sanction has been accorded under sub-rule (1), no Government servant giving such evidence, shall criticise the policy or any action of any Government of India :\n   Provided that Government may waive this condition in any particular case.\n (3) Nothing in this rule shall apply to -\n  (a) evidence given at an enquiry before an authority appointed by the Government, by Parliament or by a State Legislature, or\n  (b) evidence given in any judicial inquiry, or\n  (c) evidence given at any departmental enquiry ordered by Government or authorities subordinate to the Government.\n\nIn other words\n\nThis outlines rules and regulations regarding the giving of evidence by government servants in India in connection with various inquiries or investigations. Let's break down the key points of these rules:\n1.Sanction Requirement for Giving Evidence:\n In general, government servants are required to obtain prior permission (previous sanction) from the government before giving evidence in connection with any inquiry conducted by any person, committee, or authority.\n2.Restrictions on Criticizing Government Policies:\n If a government servant is granted permission to give evidence, they are prohibited from criticizing the policy or any action of the Government of India. This means they should not speak negatively about the government's policies or actions in the course of giving their evidence.\n Provision for Waiver: However, the government has the authority to waive this restriction in specific cases if they deem it appropriate.\n3.Exceptions to the Rule:\n There are specific situations where the rules and requirements mentioned above do not apply:\n  Evidence before Government Appointed Authorities: The rule does not apply to evidence given at an inquiry conducted by an authority appointed by the Government, by Parliament, or by a State Legislature. In these cases, government servants are not required to obtain prior sanction to provide evidence.\n  Judicial Inquiry: The rule also doesn't apply to evidence given in any judicial inquiry, where the matter is being examined by a court or a judicial body.\n  Departmental Inquiry: Evidence given at any departmental inquiry ordered by the Government or authorities subordinate to the Government is also exempt from the rule. Departmental inquiries are typically internal investigations within government departments.\n Explanation: These rules are in place to regulate the participation of government servants in various inquiries and investigations. The requirement for prior sanction ensures that government servants do not engage in providing evidence without proper authorization. The prohibition on criticizing government policies aims to maintain discipline and avoid potential conflicts between government servants and their employing authorities. However, there are exceptions to this rule, allowing government servants to give evidence in certain cases without the need for prior approval.",
          " (1) Save as provided in sub-rule (3), no Government servant shall, except with the previous sanction of the Government, give evidence in connection with any enquiry conducted by any person, committee, or authority.\n (2) Where any sanction has been accorded under sub-rule (1), no Government servant giving such evidence, shall criticise the policy or any action of any Government of India :\n   Provided that Government may waive this condition in any particular case.\n (3) Nothing in this rule shall apply to -\n  (a) evidence given at an enquiry before an authority appointed by the Government, by Parliament or by a State Legislature, or\n  (b) evidence given in any judicial inquiry, or\n  (c) evidence given at any departmental enquiry ordered by Government or authorities subordinate to the Government.\n\nIn other words\n\nSub-rule (1):states that, except with the previous sanction of the government, no government servant shall give evidence in connection with any enquiry conducted by any person, committee, or authority. This means that government servants need to get permission from the government before they can testify in any kind of enquiry, whether it is conducted by the government itself or by an external body.\nSub-rule (2):states that even if a government servant has been granted permission to testify in an enquiry, they are not allowed to criticize the policy or any action of any government of India. This is to prevent government servants from using their position to publicly criticize the government, which could undermine public confidence in the government.\nSub-rule (3):exempts government servants from having to get permission from the government before testifying in certain types of enquiries, including:\n Enquiries conducted by authorities appointed by the government, Parliament, or a State Legislature.\n Judicial enquiries Departmental enquiries ordered by the government or authorities subordinate to the government.\n This means that government servants can testify freely in these types of enquiries without having to worry about getting permission from the government.\n Examples:\n A government servant can testify in a departmental enquiry into alleged corruption without having to get permission from the government.\n A government servant can testify in a judicial enquiry into a human rights violation without having to get permission from the government.\n However, a government servant cannot testify in an enquiry conducted by a private news organization into the government's handling of a natural disaster without having to get permission from the government.\nPurpose of the rule:\n The purpose of the rule is to prevent government servants from being used to undermine the government's authority or to embarrass the government. The rule also helps to protect government servants from being harassed or intimidated by external parties.\nConclusion:\n  The rule on government servants giving evidence in enquiries is a complex one, but it is important for government servants to be aware of the rules so that they can avoid getting into trouble. If a government servant is unsure whether or not they need to get permission from the government before testifying in an enquiry, they should consult with their supervisor or the relevant government department."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Subscriptions",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Subscriptions?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 Subscriptions?",
          "How do the Gujarat Civil Services (Conduct) Rules, 1971 address contributions or dues from civil servants?",
          "What is the purpose of subscriptions in the context of the Gujarat Civil Services (Conduct) Rules, 1971?",
          "What are the subscription requirements for civil servants under the Gujarat Civil Services (Conduct) Rules, 1971?"
        ],
        "responses": [
          "  No Government servant shall except with the previous sanction of the Government or of such authority as may be empowered by it in this behalf, ask for or accept contributions to or otherwise associate himself with the raising of any fund in pursuance of any object whatsoever.\n\nIn other words\n\nThis outlines a rule that applies to government servants in India. It establishes certain restrictions on their ability to seek or accept contributions or engage in fundraising activities for any purpose without obtaining prior authorization. Here's an explanation of the key points:\n1.Authorization Requirement:\n Government servants are not allowed to ask for or accept contributions or engage in any fundraising activities for any purpose without first obtaining permission. This permission must come from either the government itself or from an authority empowered by the government to grant such permissions.\nExplanation:\n These rules are put in place to maintain the neutrality, integrity, and impartiality of government servants in the execution of their official duties. By requiring prior authorization for fundraising activities, the government ensures that government servants do not engage in any activities that may lead to conflicts of interest, influence peddling, or any other conduct that could compromise their public roles. It also helps prevent government servants from engaging in fundraising activities that might be perceived as unethical or compromising the integrity of their public service.\n The rule essentially enforces transparency and accountability and ensures that government servants do not exploit their positions for personal gain or to advance external interests without the appropriate permissions from the relevant authorities. Violation of this rule can lead to disciplinary actions or other consequences as specified by government regulations.",
          "  No Government servant shall except with the previous sanction of the Government or of such authority as may be empowered by it in this behalf, ask for or accept contributions to or otherwise associate himself with the raising of any fund in pursuance of any object whatsoever.\n\nIn other words\n\n The rule you quoted is from the Central Civil Services (Conduct) Rules, 1964. It states that no government servant is allowed to raise funds for any purpose without the prior permission of the government or of an authority that has been empowered by the government to grant such permission.\n The purpose of this rule is to prevent government servants from using their position to raise money for personal gain or to promote their own interests. It also helps to protect government servants from being pressured or influenced by external parties.\n The rule applies to all government servants, regardless of their rank or position. It also applies to all types of fundraising activities, including:\n  Organizing fundraisers\n  Participating in crowdfunding campaigns\n  Asking for or accepting donations from individuals, organizations, or businesses\n The only exceptions to the rule are:\n  Fundraising activities that are authorized by the government as part of the government's official duties.\n  Fundraising activities that are conducted on a personal basis, outside of the government servant's official capacity.\n If a government servant violates this rule, they may be subject to disciplinary action, including dismissal from service.\n Here are some examples of how the rule might be applied:\n  A government servant cannot organize a fundraiser to collect money for a local charity without the government's permission.\n  A government servant cannot participate in a crowdfunding campaign to raise money for a new business venture without the government's permission.\n  A government servant cannot accept a donation from a company in exchange for favorable treatment in their official duties.\n  A government servant cannot use their government email address to solicit donations for a charity without the government's permission.\n  A government servant cannot attend a fundraising event in their official capacity without the government's permission.\n It is important to note that the rule is not intended to prevent government servants from supporting charitable causes. However, government servants need to be careful about how they show their support, and they should always seek the government's permission before participating in any fundraising activities. "
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Gifts",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Gifts?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 Gifts?",
          "How are gifts addressed and regulated under the Gujarat Civil Services (Conduct) Rules, 1971?",
          "What are the restrictions and requirements regarding gifts in the Gujarat Civil Services (Conduct) Rules, 1971?",
          "What are the provisions in the Gujarat Civil Services (Conduct) Rules, 1971, pertaining to the acceptance of gifts by civil servants?"
        ],
        "responses": [
          " (1) Save as otherwise provided in these rules, no Government servant shall accept, or permit any member of his family, or any + (other) person acting on his behalf, to accept any gift.Explanation :-\n (i) The expression 'gift' shall, include free transport, boarding lodging or other service or any other pecuniary advantage when provided by any person other than a near relative, or personal friend having no official dealings with the Government servant.\nNote - I :- A casual meal, lift or other social hospitality shall not be deemed to be a gift.\nNote - II :- Government servant shall avoid accepting lavish hospitality or frequent hospitality from any individual having official dealing with him or from industrial or commercial firms, organisations etc.\n (ii) For the purpose of this rule, any trowel, key, other similar articles offered to a Government servant at the laying of the foundation stone or the opening of a public building or any ceremonial function shall be deemed to be a gift.\n (2) On occasion such as weddings, anniversaries, funerals or religious function, when the making of a gift is in confirmity with the prevailing religious or social practice, a Government servant or any member of his family or any person acting on his behalf may accept gift from near relatives or from personal friends having no official dealing with the Government servant but the Government servant shall make a report to the Government if the value of any such gift exceeds -\n (i) Rs. 7,000/- (Rupees seven thousand) in the case of a Government servant holding any Class I post.\n (ii) Rs. 4,000/- (Rupees four thousand) in the case of a Government servant holding any Class II post.\n (iii) Rs. 2,000/- (Rupees two thousand) in the case of a Government servant holding any Class III post.\n (iv) Rs. 1,000/- (Rupees one thousand) in the case of a Government servant holding any Class IV post.\n (3) In any other case, a Government servant shall not accept or permit any member of his family or any other person acting on his behalf to accept any gift without the sanction of the Government if the value thereof exceeds -\n (i) Rs. 1,500/- (Rupees one thousand five hundred) in case of a Government servant holding any Class I or Class II post.\n (ii) Rs. 500/- (Rupees five hundred) in the case of a Government servant holding any Class III or Class IV post.\n13-A.Dowry :-\n No Government servant shall -\n (i) give or take or abet the giving or taking of dowry. or\n (ii) demand, directly or indirectly from the parents or guardian of a bride or bridegroom, as the case may be, any dowry. Explanation :- For the purposes of this rule, 'dowry' has the same meaning as in the Dowry Prohibition Act, 1961 (28 of 1961).\n\nIn other words\n\nThis outlines rules and regulations related to the acceptance of gifts by government servants in India, as well as rules pertaining to dowry. Let's break down each of the key points:\nAcceptance of Gifts:\n 1.General Prohibition on Accepting Gifts:\n  In general, government servants are prohibited from accepting any gift. This rule applies to both the government servant themselves and their family members or anyone acting on their behalf.\n 2.Definition of 'Gift':\n  The term 'gift' includes not only physical items but also other forms of benefits like free transportation, lodging, boarding, services, or any pecuniary advantage when provided by someone other than a near relative or personal friend who has no official dealings with the government servant.\n  Note I clarifies that common social courtesies like a casual meal, ride, or other social hospitality are not considered gifts.\n  Note II emphasizes that government servants should avoid accepting extravagant or frequent hospitality from individuals who have official dealings with them or from industrial or commercial entities.\n 3.Ceremonial Gifts:\n  Certain items like ceremonial trowels, keys, or similar articles given to government servants at events like laying the foundation stone or opening of public buildings are considered gifts.\nExceptions for Accepting Gifts:\n 1.Occasions for Accepting Gifts:\n On specific occasions like weddings, anniversaries, funerals, or religious functions, where giving gifts aligns with prevailing religious or social practices, government servants or their family members or representatives may accept gifts.\n  However, there is a requirement to report the acceptance of such gifts to the government if their value exceeds certain limits.\n 2.Value-Based Reporting:\n  Government servants must report gifts with a value exceeding certain limits based on their post classification:\n   Class I: Rs. 7,000\n   Class II: Rs. 4,000\n   Class III: Rs. 2,000\n   Class IV: Rs. 1,000\nDowry Prohibition:\n 1.Prohibition on Giving or Taking Dowry:\n  Government servants are prohibited from giving or taking dowry, and they are also barred from abetting or demanding dowry.\n  The definition of 'dowry' is the same as that in the Dowry Prohibition Act, 1961 (28 of 1961).\nExplanation:\n  These rules and provisions are designed to ensure the integrity, impartiality, and ethical conduct of government servants. They seek to prevent situations where government servants could be influenced by gifts or engaged in the practice of dowry, which is illegal in India. While there are exceptions for accepting gifts on certain occasions, there are reporting requirements in place to maintain transparency and prevent any undue influence. Violation of these rules may lead to disciplinary actions or other consequences as specified by government regulations.",
          " (1) Save as otherwise provided in these rules, no Government servant shall accept, or permit any member of his family, or any + (other) person acting on his behalf, to accept any gift.Explanation :-\n (i) The expression 'gift' shall, include free transport, boarding lodging or other service or any other pecuniary advantage when provided by any person other than a near relative, or personal friend having no official dealings with the Government servant.\nNote - I :- A casual meal, lift or other social hospitality shall not be deemed to be a gift.\nNote - II :- Government servant shall avoid accepting lavish hospitality or frequent hospitality from any individual having official dealing with him or from industrial or commercial firms, organisations etc.\n (ii) For the purpose of this rule, any trowel, key, other similar articles offered to a Government servant at the laying of the foundation stone or the opening of a public building or any ceremonial function shall be deemed to be a gift.\n (2) On occasion such as weddings, anniversaries, funerals or religious function, when the making of a gift is in confirmity with the prevailing religious or social practice, a Government servant or any member of his family or any person acting on his behalf may accept gift from near relatives or from personal friends having no official dealing with the Government servant but the Government servant shall make a report to the Government if the value of any such gift exceeds -\n (i) Rs. 7,000/- (Rupees seven thousand) in the case of a Government servant holding any Class I post.\n (ii) Rs. 4,000/- (Rupees four thousand) in the case of a Government servant holding any Class II post.\n (iii) Rs. 2,000/- (Rupees two thousand) in the case of a Government servant holding any Class III post.\n (iv) Rs. 1,000/- (Rupees one thousand) in the case of a Government servant holding any Class IV post.\n (3) In any other case, a Government servant shall not accept or permit any member of his family or any other person acting on his behalf to accept any gift without the sanction of the Government if the value thereof exceeds -\n (i) Rs. 1,500/- (Rupees one thousand five hundred) in case of a Government servant holding any Class I or Class II post.\n (ii) Rs. 500/- (Rupees five hundred) in the case of a Government servant holding any Class III or Class IV post.\n13-A.Dowry :-\n No Government servant shall -\n (i) give or take or abet the giving or taking of dowry. or\n (ii) demand, directly or indirectly from the parents or guardian of a bride or bridegroom, as the case may be, any dowry. Explanation :- For the purposes of this rule, 'dowry' has the same meaning as in the Dowry Prohibition Act, 1961 (28 of 1961).\n\nIn other words\n\nRule 13(1):prohibits government servants from accepting any gift, except from near relatives or personal friends having no official dealings with the government servant, or as otherwise provided in the rules. The term 'gift' is defined to include free transport, boarding, lodging, or other service, or any other pecuniary advantage.\nNote 1: A casual meal, lift, or other social hospitality is not deemed to be a gift.\nNote 2: Government servants should avoid accepting lavish hospitality or frequent hospitality from any individual having official dealings with them or from industrial or commercial firms, organizations, etc.\nRule 13(2):provides that on occasions such as weddings, anniversaries, funerals, or religious functions, government servants may accept gifts from near relatives or personal friends having no official dealings with them, even if the value of the gift exceeds the limits specified in Rule 13(3), but they must report such gifts to the government if the value exceeds the following limits:\n  Rs. 7,000/- for government servants holding Class I posts\n  Rs. 4,000/- for government servants holding Class II posts\n  Rs. 2,000/- for government servants holding Class III posts\n  Rs. 1,000/- for government servants holding Class IV posts\nRule 13(3):prohibits government servants from accepting any gift without the sanction of the government if the value of the gift exceeds the following limits:\n  Rs. 1,500/- for government servants holding Class I or Class II posts\n  Rs. 500/- for government servants holding Class III or Class IV posts\nRule 13-A:prohibits government servants from giving, taking, abetting, or demanding dowry. Dowry is defined as any property or valuable security given or agreed to be given either directly or indirectly:\n  As a consideration for the marriage of a person;\n  In connection with the marriage of a person;\n  As an inducement for the marriage of a person; or\n  After the marriage in connection with the marriage of a person.\n Explanation: For the purposes of this rule, 'dowry' has the same meaning as in the Dowry Prohibition Act, 1961 (28 of 1961).\nPurpose of the rules:\n The purpose of the rules on gifts and dowry is to prevent government servants from being influenced or corrupted by external parties. The rules also help to maintain public confidence in the government.\nConclusion:\n Government servants should be aware of the rules on gifts and dowry and should take steps to avoid violating them. If unsure about the rules, government servants should consult with their supervisor or the relevant government department."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Public demonstration or other entertainment in honour of a Government servant",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Public demonstration or other entertainment in honour of a Government servant?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 Public demonstration or other entertainment in honour of a Government servant?",
          "What are the guidelines or limitations set by the Gujarat Civil Services (Conduct) Rules, 1971, regarding events or entertainment held to honor government employees?",
          "What is the purpose of Rule 21 in the Gujarat Civil Services (Conduct) Rules, 1971, which relates to honoring government servants through public events?",
          "What does Rule 21 of the Gujarat Civil Services (Conduct) Rules, 1971, specifically say regarding public demonstrations or entertainment in honor of government servants?"
        ],
        "responses": [
          " (1) Save as otherwise provided in this rule, a Government servant shall not except with the previous sanction of Government -\n (a) receive any complimentary or valedictory address or accept any testimonial presented to him or attend any public meeting or entertainment held in his honour.\n (b) take part in the presentation of any complimentary or valedictory address or a testimonial to any other Government servant or to any person who had recently quitted service of Government or attend any public meeting or entertainment held in honour of such Government servant or person.\n (2) Notwithstanding anything contained in sub-rule (1) but subject to the provisions of any general or special order of Government, a Government servant may -\n (a) at the request of any public body sit for a portrait, bust, or statues not intended for presentation to him.\n (b) attend a farewell entertainment of a substantially private and informal character held as a mark of regard to himself or to some other Government servant, or to a person who has recently quitted the service of Government on the occassion of the retirement from the service or departure from the district or station, of himself or such other Government servant or persons.\n (c) attend a simple and inexpensive entertainment arranged by any public body or institution.\nNote :- Exercise of pressure or influence or any sort on any sort on any Government servant to induce him to subscribe towards any farewell entertainment even if it is of a substantially private or informal character, and the collection of subscriptions from Class III or Class IV employees, under any circumstances for the entertainment of any Government servant not belonging to Class III or Class IV is forbidden.\n\nIn other words\n\nThese rules and regulations pertaining to the participation of government servants in events, entertainment, and testimonials. Let's break down the key points of these rules:\nGeneral Prohibition:\n 1.Receiving Complimentary Addresses and Testimonials:\n  Government servants are generally not allowed to receive any complimentary or valedictory address, accept testimonials presented to them, or attend public meetings or entertainments held in their honor without prior sanction from the government.\n Participation in Presenting Complimentary Addresses and Testimonials:\n  They are also prohibited from taking part in the presentation of complimentary or valedictory addresses or testimonials to other government servants or individuals who have recently left government service. Additionally, attending public meetings or entertainments held in honor of such individuals is not allowed without prior sanction.\nExceptions and Conditions:\n 1.Situations Allowing Participation:\n  There are exceptions to these prohibitions, subject to the provisions of any general or special order of the government.\n  Government servants may participate in the following situations without the need for prior sanction:\n  (a) Sitting for a portrait, bust, or statue at the request of a public body. The portrait or statue is not intended for presentation to the government servant.\n  (b) Attending a farewell entertainment of a substantially private and informal character held as a mark of regard for themselves or another government servant or a person who has recently left government service. This is typically on the occasion of retirement or departure from a district or station.\n  (c) Attending a simple and inexpensive entertainment organized by a public body or institution.\nNote Regarding Pressure and Subscriptions:\n The rule also emphasizes that no pressure or influence should be exerted on any government servant to induce them to subscribe to a farewell entertainment, even if it is a private and informal event. Additionally, the collection of subscriptions from Class III or Class IV employees for the entertainment of a government servant not belonging to Class III or Class IV is prohibited under all circumstances.\nExplanation:\n These rules aim to strike a balance between acknowledging the service and contributions of government servants and maintaining the dignity and integrity of the public service. The general prohibition on receiving addresses, testimonials, or participating in public events is in place to prevent undue influence or conflicts of interest. However, exceptions are provided for certain circumstances, like private farewell events or sitting for portraits, as long as they are in line with government guidelines and subject to any applicable orders. The note emphasizes the importance of not pressuring government servants or collecting subscriptions for farewell events from certain employee classes to maintain fairness and ethical conduct in such situations.",
          " (1) Save as otherwise provided in this rule, a Government servant shall not except with the previous sanction of Government -\n (a) receive any complimentary or valedictory address or accept any testimonial presented to him or attend any public meeting or entertainment held in his honour.\n (b) take part in the presentation of any complimentary or valedictory address or a testimonial to any other Government servant or to any person who had recently quitted service of Government or attend any public meeting or entertainment held in honour of such Government servant or person.\n (2) Notwithstanding anything contained in sub-rule (1) but subject to the provisions of any general or special order of Government, a Government servant may -\n (a) at the request of any public body sit for a portrait, bust, or statues not intended for presentation to him.\n (b) attend a farewell entertainment of a substantially private and informal character held as a mark of regard to himself or to some other Government servant, or to a person who has recently quitted the service of Government on the occassion of the retirement from the service or departure from the district or station, of himself or such other Government servant or persons.\n (c) attend a simple and inexpensive entertainment arranged by any public body or institution.\nNote :- Exercise of pressure or influence or any sort on any sort on any Government servant to induce him to subscribe towards any farewell entertainment even if it is of a substantially private or informal character, and the collection of subscriptions from Class III or Class IV employees, under any circumstances for the entertainment of any Government servant not belonging to Class III or Class IV is forbidden.\n\nIn other words\n\nExplanation of the Central Civil Services (Conduct) Rules, 1964 - Rule 14: Complimentary or Valedictory Addresses and Testimonials:\n Rule 14(1) prohibits government servants from receiving or accepting complimentary or valedictory addresses, testimonials, attending public meetings or entertainments held in their honour, or taking part in the presentation of such addresses or testimonials to other government servants or persons who have recently quitted government service, without the previous sanction of the government.\n Rule 14(2) provides for certain exceptions to the above prohibition, namely:\n  Government servants may sit for portraits, busts, or statues at the request of any public body, provided that the portraits, busts, or statues are not intended for presentation to the government servant.\n  Government servants may attend a farewell entertainment of a substantially private and informal character held as a mark of regard to themselves, to some other government servant, or to a person who has recently quitted the service of government on the occasion of their retirement from the service or departure from the district or station.\n  Government servants may attend a simple and inexpensive entertainment arranged by any public body or institution.\n Note: It is forbidden to exercise pressure or influence of any sort on any government servant to induce them to subscribe towards any farewell entertainment, even if it is of a substantially private or informal character. It is also forbidden to collect subscriptions from Class III or Class IV employees, under any circumstances, for the entertainment of any government servant not belonging to Class III or Class IV.\nPurpose of the rule:\n The purpose of the rule is to prevent government servants from being influenced or corrupted by external parties. The rule also helps to maintain public confidence in the government.\nConclusion:\n Government servants should be aware of the rules on complimentary or valedictory addresses and testimonials and should take steps to avoid violating them. If unsure about the rules, government servants should consult with their supervisor or the relevant government department."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Private trade or employment ",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Private trade or employment ?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 Private trade or employment ?",
          "How does the Gujarat Civil Services (Conduct) Rules, 1971 address the issue of civil servants having private trade or employment?",
          "What are the guidelines regarding private business or secondary employment for civil servants in Gujarat, according to the rules?",
          "What does the Gujarat Civil Services (Conduct) Rules, 1971 say about civil servants engaging in private trade or employment?"
        ],
        "responses": [
          " (1) subject to the provisions of sub-rule (2), no Government servant shall, except with the previous sanction of the Government -\n (a) engage directly or indirectly in any trade or business, or\n (b) negotiate for, or undertake, any other employment, or\n (c) hold an elective office, canvass for a candidate or candidates for an elective office, in any body whether incorporated or not, or\n  (d) canvass in support of any business of insurance agency, commission agency etc. owned or managed by any member of his family, or\n (e) take part except in the discharge of his official duties, in the registration, promotion or management of any bank or other company registered, or required to be registered, under the Companies Act, 1956 (1 of 1959) or any other law for the time being in force or of any co-operative society for commercial purposes.\n Explanation :- Making or helping in making the provision of funds for a business undertaken by a wife or a member of his family shall be regarded as indirectly engaging a Government servant in trade or business and shall require previous sanction of the Government.\n (2) A Government servant may, without the previous sanction of the Government,  \n (a) undertake honorary work of a social or charitable nature, or\n (b) undertake occassional work of a literacy, artistic or scientific character, or\n (c) participate in sports activities as an ameteur, or\n (d) take part in the registration, promotion or management (not involving the holding of an elective office) of a literacy, scientific or charitable society or of a club or similar organization, the aims or objects of which relate to promotion of sports, cultural or creation activities registered under the Societies Registration Act, 1860 (21 of 1860) or any other law for the time being in force, or\n (e) take part in the registration, promotion or management (act involving the holding of elective office) of a co-operative society substantially for the benefit of Government servants registered under the Gujarat Co-operative Societies Act, 1961 (Guj. X of 1962) or any other Law for the time being in force :\nProvided that - \n (i) he shall discontinue taking part in such activities if so directed by the Government.\n (ii) in a case falling under clause (d) or clause (e) of this sub-rule, his official duties shall not suffer thereby and he shall, within a period of one month of his taking part in such activity, report to the Government giving details of the nature of his participation.\n (iii) every Government servant shall report to the Government if any member of his family is engaged in a trade or business or owns or manages an insurance agency or commission agency.\n(iv) Unless otherwise provided by general of special of the Government, no Government servant shall accept any fee for any work done by him for any private or public body or any private person without the sanction of the prescribed authority.\nExplanation :-The term 'fee' used in this sub-rule shall have the meaning assigned to it in Note 2 below rule 9(25) of the Bombay Civil Services Rules, 1959.\n\nIn other words\n\nRestrictions on Government Servants:\n 1.Engaging in Trade, Business, or Other Employment:\n  Government servants are generally prohibited from engaging directly or indirectly in any trade or business or from negotiating for or undertaking any other employment without obtaining prior permission from the government.\n 2.Holding Elective Office or Canvassing:\n  They are also barred from holding an elective office, canvassing for a candidate or candidates in any elections (whether for incorporated bodies or not), and from canvassing in support of businesses like insurance agencies or commission agencies owned or managed by a family member.\n 3.Involvement in Banking or Company Management:\n  Government servants are prohibited from taking part in the registration, promotion, or management of banks, companies registered under the Companies Act, 1956, or co-operative societies for commercial purposes, except when such involvement is part of their official duties.\nExplanation and Further Provisions:\n 1.Indirect Engagement in Trade or Business:\n  It's clarified that providing funds for a business venture undertaken by a spouse or family member would be considered an indirect engagement in trade or business, requiring prior government permission.\nExceptions for Specific Activities:\n 1.Honorary and Occasional Activities:\n Government servants may undertake certain activities without prior government permission. These include:\n  Honorary work of a social or charitable nature.\n  Occasional work of a literary, artistic, or scientific character.\n  Participation in sports activities as an amateur.\n  Involvement in the registration, promotion, or management (not involving elective office) of societies, clubs, or organizations related to sports, culture, or creative activities registered under relevant laws.\n 2.Participation in Cooperative Societies:\n  Government servants are allowed to participate in the registration, promotion, or management (not involving elective office) of co-operative societies that primarily benefit government servants and are registered under specific laws.\nProvisions for Exceptions:\n 1.Conditions for Exceptions:\n  Government servants must comply with certain conditions when participating in these exempted activities, including discontinuing such activities if directed by the government and reporting their participation within a month of commencing it.\n 2.Reporting Family Members' Engagements:\n  Government servants are required to report if any member of their family is engaged in trade, business, or owns or manages insurance or commission agencies.\n 3.Permission for Accepting Fees:\n  Government servants generally cannot accept fees for work done for private or public bodies or individuals without obtaining permission from the prescribed authority unless provided otherwise by the government.\nExplanation of 'Fee':\n The term 'fee' in this context is defined according to Note 2 below rule 9(25) of the Bombay Civil Services Rules, 1959.\nOverall Objective:\n These rules aim to maintain the impartiality, integrity, and discipline of government servants while balancing the need for them to engage in certain activities outside their official duties. They help prevent conflicts of interest and ensure that government servants do not misuse their positions for personal gain. Violation of these rules may lead to disciplinary actions or other consequences as specified by government regulations."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Investment, Lending and Borrowing  ",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Investment, Lending and Borrowing  ?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 Investment, Lending and Borrowing  ?",
          "tell me about Gujarat Civil Services (Conduct) Rules,1971 Investment, Lending and Borrowing  ?",
          "What are the investment,lending and borrowing rules for Gujarat civil servants under the Gujarat Civil Services (Conduct) Rules, 1971?",
          "please provide informaion about Gujarat Civil Services (Conduct) Rules,1971 Investment, Lending and Borrowing"
        ],
        "responses": [
          " (1) No Government servant shall speculate in any investment.\nExplanation :- Frequent purchase or sale or both of shares, securities or other investments shall be deemed to be speculation within the meaning of this sub-rule.\n (2) (i) No Government servant shall make, or permit any member of his family to make, any investment likely to embarrass or influence him in the discharge of his official duties and when a Government servant fails to prevent a member of his family from making an investment of this nature, he shall report to Government forthwith.\n   (ii) No Government servant who is involved in the decision making process of fixation of price of an Initial Public Offering or Follow-up Public Offering of shares of a State Public Sector Enterprise shall apply, either himself or through any member of his family or through any other person acting on his behalf, for allotment of shares in the Initial Public Offerings or Follow-up Public Offerings of such State Public Sector Enterprise.\n (3) If any question arises whether a security or investment is of a nature referred to in sub-rule (1) or sub-rule (2), the decision of the Government thereon shall be final.\n (4) No Government servant shall except with the previous sanction of the Government lend money to any person possessing land or valuable property within the local limits under his authority or at interest to any person :\n Provided that a Government servant may advance a small amount free of interest to a personal friend or relative, or a private servant even if such person possesses land within the local limit of his authority.\n (5) No Government servant shall, save in the ordinary course of business with a Bank or a firm of standing, borrow money from, or otherwise place himself under pecuniary obligation to any person within the local limits of his authority, or any other person with whom he is likely to have officail dealings, nor shall he permit, any member of his family except with the pervious sanction of the Government, to enter into any such transaction. In case, however, such a transaction is entered into by a member of his family without his permission, it should be reported to Government forthwith.\n  Provided that a Government servant may accept a purely temporary advance of small amount, free of interest from a personal friend or relative or operate a credit account with a bonafide tradesman.\n (6) When a Government servant is appointed or transferred to a post of such a nature as to involve him in the breach of any of the provisions of sub-rule (4) or sub-rule (5), he shall forthwith report the circumstances to the Government and shall thereafter act in accordance with such orders as may be passed by the Government.\n  Provided that a Government servant belonging to Class III or Class-IV service shall make such report to the Head of his Office.\n (7) This rule may, in the case of Class IV servants be relaxed in exceptional cases at the discretion of the Head of Office, and in so far as it relates to the lending to or borrowing by Government servants from the co-operative societies registered under anylaw for the time being in force shall be usbject ot any general or special restrictions or relaxations made or permitted by Government.",
          "Rule 16(1) prohibits government servants from speculating in any investment. This means that government servants cannot buy and sell investments frequently with the intention of making a quick profit.\nRule 16(2) prohibits government servants from making any investment that is likely to embarrass or influence them in the discharge of their official duties. This also prohibits government servants from allowing members of their family to make such investments.\nRule 16(3) provides that the decision of the government on whether a particular investment is likely to embarrass or influence a government servant in the discharge of their official duties is final.\nRule 16(4) prohibits government servants from lending money to any person possessing land or valuable property within the local limits under their authority, except in the case of small amounts lent free of interest to personal friends, relatives, or private servants.\nRule 16(5) prohibits government servants from borrowing money from any person within the local limits of their authority, or any other person with whom they are likely to have official dealings, except for a purely temporary advance of a small amount, free of interest, from a personal friend or relative, or for a credit account with a bona fide tradesman.\nRule 16(6) requires government servants to report to the government if they are appointed or transferred to a post that would put them in breach of any of the provisions of Rule 16(4) or Rule 16(5).\nRule 16(7) allows the Head of Office to relax the rules on lending and borrowing for Class IV servants in exceptional cases. It also allows the government to make or permit general or special restrictions or relaxations on the rules on lending and borrowing to or from cooperative societies.\nPurpose of the rule:\n  The purpose of the rule is to prevent government servants from using their official position for personal gain or to promote their own interests. It also helps to ensure that government servants are impartial and objective in their work.\nConclusion:\n  Government servants should be aware of the rules on investment, lending, and borrowing and should take steps to avoid violating them. If unsure about the rules, government servants should consult with their supervisor or the relevant government department."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Insolvency and Habitual Indebtedness",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Insolvency and Habitual Indebtedness?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 Insolvency and Habitual Indebtedness?",
          "How do the Gujarat Civil Services (Conduct) Rules, 1971, address issues of financial integrity among government employees?",
          "What measures are in place in Gujarat to ensure that civil servants do not fall into chronic debt as per the Conduct Rules?",
          "What are the implications for a civil servant under the Gujarat Civil Services (Conduct) Rules, 1971, if they become insolvent?"
        ],
        "responses": [
          " (1) A Govenment servant shall so manage his private affairs as to avoid habitual indebtedness or insolvency. A Government servant who becomes the subject of legal proceedings for insolvency shall forthwith report the full facts to the Government.\n (2) Where a moiety of the salary of a Government servant is attached, the report shall show what is the proportion of his debts to the salary and whether the debtor's position is irretrievable so as to enable Government to consider whether in the circumstances of the case, these matters would detract from the debtor's efficiency as a Government servant and whether it is desirable to retain him in the post occupied by him at the time when the matter is brought to the notice of Government or in any other post under Government.\n (3) When a Government servant is adjudged or declared an insolvent or when a moiety of the salary of such Government servant is constantly being attached, or has been continuously under attachment for a period exceeding two years or is attached for a sum, which in ordinary circumstances cannot be repaid within a period of two years, he shall be liable to be removed from services.\n (4) In every case under this rule, the burden of proving that the insolvency or indebtedness is the result of circumstances which with the exercise of ordinary diligence, the debtor could not have foreseen or over which he had no control and has not proceeded from extravagant or dissipated habits, shall be, upon the debtor. ",
          "Rule 17(1) requires government servants to manage their private affairs in a way that avoids habitual indebtedness or insolvency. If a government servant becomes the subject of legal proceedings for insolvency, they must report the full facts to the government immediately.\nRule 17(2) requires government servants to report the proportion of their debts to their salary and whether their situation is irretrievable if a moiety of their salary is attached. This information will help the government to decide whether the government servant's debts will affect their performance and whether it is still in the government's best interests to retain them in their current position or any other position under the government.\nRule 17(3) states that a government servant can be removed from service if they are adjudged or declared an insolvent, if a moiety of their salary is constantly being attached or has been under attachment for a period exceeding two years, or if their salary is attached for a sum that cannot be repaid within two years.\nRule 17(4) places the burden of proof on the government servant to show that their insolvency or indebtedness is the result of circumstances that were beyond their control and is not due to extravagant or dissipated habits.\nPurpose of the rule:\n  The purpose of the rule is to prevent government servants from using their official position for personal gain or to promote their own interests. It also helps to ensure that government servants are impartial and objective in their work.\nConclusion:\n  Government servants should be aware of the rules on insolvency and habitual indebtedness and should take steps to avoid violating them. If unsure about the rules, government servants should consult with their supervisor or the relevant government department.\nAdditional notes:\n The term 'moiety' means one-half.\n The term 'adjudged or declared an insolvent' means that the government servant has been declared bankrupt by a court of law.\n The term 'constantly being attached' means that the government servant's salary is being regularly seized by creditors to pay off their debts.\n The term 'irretrievable' means that the government servant's financial situation cannot be improved.\n I hope this explanation is helpful. Please let me know if you have any other questions."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 18. Government servant to inform Government about Criminal or Civil proceedings against him  ",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 18. Government servant to inform Government about Criminal or Civil proceedings against him  ?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 18. Government servant to inform Government about Criminal or Civil proceedings against him  ?",
          "How does Rule 18 in the Gujarat Civil Services (Conduct) Rules, 1971, affect government servants when they are involved in legal proceedings?",
          "Can you elaborate on the provision in the Gujarat Civil Services (Conduct) Rules, 1971, that mandates government servants to inform the government about legal actions against them, as specified in Rule 18?",
          "What is the significance of Rule 18 in the Gujarat Civil Services (Conduct) Rules, 1971?"
        ],
        "responses": [
          " (a) Whereas any criminal proceedings are instituted or are in progress against a Government servant conserning an offence which is alleged to have been committed by him while acting or purporting to act in the discharge of his official duty or which involves moral turpitude or which is punishable with imprisonment for a term of one year or more, or\n (b) Where any civil proceedings are instituted or are in progress against a Government servant for recovery of an amount exceedings ten times his monthly emoluments or for damages arising out of any breach of trust or mis-appropriation of money or fraud alleged to have been committed by such Government servant, the Government servant shall inform Government or the Head of the Department or Office concerned about such proceedings by submitting a report in writing stating briefly the facts leading to such proceedings.  19. Movable, Immovable and valuable property",
          "These outlines a rule that pertains to government servants in India and their obligation to inform the government or the relevant department or office about certain legal proceedings against them. Here's an explanation of the key points in this rule:\nNotification of Legal Proceedings:\n 1.Criminal Proceedings:\n  (a) When criminal proceedings are initiated or are ongoing against a government servant in connection with an offense alleged to have been committed by the government servant while acting in the discharge of their official duty, an offense involving moral turpitude, or an offense punishable with imprisonment for a term of one year or more, the government servant is required to inform the government or the relevant head of the department or office about such proceedings.\n 2.Civil Proceedings:\n  (b) Similarly, when civil proceedings are initiated or are ongoing against a government servant for one of the following reasons, the government servant must report the proceedings:\n  Recovery of an amount exceeding ten times the government servant's monthly emoluments.\n  Damages arising from any breach of trust, misappropriation of money, or fraud alleged to have been committed by the government servant.\nReporting Requirement:\n  Government servants are obligated to submit a written report, providing a brief account of the facts leading to these legal proceedings. The report should be submitted to the government or the relevant department or office.\nExplanation:\n  This rule is designed to ensure transparency and accountability among government servants. When legal proceedings, either criminal or civil, are initiated against a government servant under the specified conditions, they are required to promptly report these proceedings to the government or the relevant authority. By doing so, it allows the government to be aware of and, if necessary, take appropriate actions in response to these legal matters. It is important to maintain the integrity and public trust in the functioning of government departments and to address any legal issues involving government servants in a timely and transparent manner. Violation of this rule may lead to disciplinary actions or other consequences as specified by government regulations.",
          "Explanation of the rule:\n The rule you have quoted from the Central Civil Services (Conduct) Rules, 1964 states that government servants are required to inform the government or the relevant department or office about any criminal or civil proceedings instituted or in progress against them, under the following conditions:\n Criminal proceedings:\n  When the offense alleged to have been committed by the government servant was committed while acting or purporting to act in the discharge of their official duty, or\n  When the offense involves moral turpitude, or\n  When the offense is punishable with imprisonment for a term of one year or more.\n Civil proceedings:\n  When the proceedings are for recovery of an amount exceeding ten times the government servant's monthly emoluments, or\n  When the proceedings are for damages arising out of any breach of trust, misappropriation of money, or fraud alleged to have been committed by the government servant.\n The government servant is required to submit a written report, stating briefly the facts leading to such proceedings.\nPurpose of the rule:\n The purpose of the rule is to ensure transparency and accountability among government servants. It also helps to protect the public interest by ensuring that government servants are not involved in any illegal or unethical activities.\nExamples\n Here are some examples of situations where a government servant would be required to report legal proceedings under this rule:\n  A police officer is charged with assault while on duty.\n  A government accountant is accused of embezzling funds.\n  A teacher is sued for defamation by a student's parents.\n  A government official is charged with corruption.\nConsequences of violating the rule\n  Government servants who violate this rule may be subject to disciplinary action, including suspension, dismissal, or reduction in rank.\nConclusion:\n Government servants should be aware of their obligation to report legal proceedings under this rule. By doing so, they can help to maintain the integrity and public trust in the functioning of government departments."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Movable, Immovable and valuable property",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Movable, Immovable and valuable property?",
          "Explain Gujarat Civil Services (Conduct) Rules,1971 Movable, Immovable and valuable property?",
          "tell me about Gujarat Civil Services (Conduct) Rules,1971 Movable, Immovable and valuable property?",
          "please provide information about Gujarat Civil Services (Conduct) Rules,1971 Movable, Immovable and valuable property?",
          "What constitutes movable,immovable and valuable property under the Gujarat Civil Services (Conduct) Rules, 1971?"
        ],
        "responses": [
          " (1) This regulation outlines the requirement for government servants to declare their immovable assets:-\n (a) Upon their initial appointment to a service or post, every government servant must sa detailed report on their immovable assets, following a prescribed proforma bgovernment. This report should encompass all immovable properties owned, inherited, acquor held through lease or mortgage, whether in the government servant's name, their fmembers' names, or any other person's name.\n (b) Gazetted government servants must provide the information mentioned in clause (a) annon January 1st, covering the period up to December 31st of the preceding year.\n (c) Non-Gazetted government servants should submit the information as specified in sub(a) at the end of each year during which they attain an age that is a multiple of five (e.g., 25, 30, 35, etc.) until reaching the age of 58 or 60.\n Note 1: The provisions of clause (a) typically do not apply to Class-IV servants, bugovernment reserves the right to enforce them for any specific government servant or clagovernment servants.\n Note 2: Government servants who are already in service at the commencement of these rulessubmit their asset declaration by a date specified by the government followincommencement date.\n (2) A government servant cannot buy, sell, lease, mortgage, gift, or otherwise acquire or dispose of any immovable property in their name or in the name of a family member without prior approval from the designated authority. If the transaction involves someone with official dealings with the government servant, prior permission from the authority is mandatory.\n (3) A government servant must inform the designated authority within one month of any transaction involving movable property, whether in their name or a family member's name, if the value exceeds two months' basic pay. If the transaction involves a person with official dealings, prior approval from the designated authority is necessary.\n (4) The government or designated authority can, through a general or specific order, demand a government servant to provide a comprehensive statement of all movable or immovable properties held or obtained by themselves or their family members within a specified timeframe. The statement should include information on how the properties were acquired, if requested.\n (5) The government can exempt Class III or Class IV government servants from certain provisions of this rule, except sub-rule (4). However, such exemptions require approval from the General Administration Department.\nExplaination:-(1)In this rule, Movable property encompasses:(a) (i) Valuables like jewelry, shares, securities, and debentures(ii) Insurance policies with an annual premium exceeding two months' basic pay of the Government servant(b) Loans provided by Government servants, whether secured or not(c) Vehicles such as motor cars, motor cycles, horses, or any other means of conveyance(d) Appliances like refrigerators and radiograms.\n  (2) 'Prescribed authority' refers to:(a) (i) The Government, for a Government servant in a Class I post, unless a lower authority isspecifically designated by the Government.(ii) Head of Department, for a Government servant in a Class II post.(iii) Head of Office, for a Government servant in a Class III or IV post.(b) For a Government servant on foreign service or deputation to another Government or local bodies, theprescribed authority is the parent department or the Department to which the servant is administratively subordinate in their cadre.",
          "Explanation of the rules on declaration of immovable and movable assets by government servants\n Rule 1:\n Sub-rule (a): Every government servant, upon their initial appointment to a service or post, must submit a detailed report on their immovable assets to the government. The report must include all immovable properties owned, inherited, acquired, or held through lease or mortgage, whether in the government servant's name, their family members' names, or any other person's name.\n Sub-rule (b): Gazetted government servants must submit a report on their immovable assets on January 1st of each year, covering the period up to December 31st of the preceding year.\n Sub-rule (c): Non-gazetted government servants must submit a report on their immovable assets at the end of each year during which they attain an age that is a multiple of five (e.g., 25, 30, 35, etc.) until reaching the age of 58 or 60.\n Note 1: The provisions of sub-rule (a) typically do not apply to Class-IV servants, but the government reserves the right to enforce them for any specific government servant or class of government servants.\n Note 2: Government servants who are already in service at the commencement of these rules must submit their asset declaration by a date specified by the government following the commencement date.\n Rule 2\n A government servant cannot buy, sell, lease, mortgage, gift, or otherwise acquire or dispose of any immovable property in their name or in the name of a family member without prior approval from the designated authority. If the transaction involves someone with official dealings with the government servant, prior permission from the authority is mandatory.\n Rule 3\n  A government servant must inform the designated authority within one month of any transaction involving movable property, whether in their name or a family member's name, if the value exceeds two months' basic pay. If the transaction involves a person with official dealings, prior approval from the designated authority is necessary.\n Rule 4\n  The government or designated authority can, through a general or specific order, demand a government servant to provide a comprehensive statement of all movable or immovable properties held or obtained by themselves or their family members within a specified timeframe. The statement should include information on how the properties were acquired, if requested.\n Rule 5\n  The government can exempt Class III or Class IV government servants from certain provisions of this rule, except sub-rule (4). However, such exemptions require approval from the General Administration Department.\nExplanation\n 1.Movable property:\n Movable property includes:\n  Valuables like jewelry, shares, securities, and debentures.\n  Insurance policies with an annual premium exceeding two months' basic pay of the government servant.\n  Loans provided by government servants, whether secured or not.\n  Vehicles such as motor cars, motor cycles, horses, or any other means of conveyance.\n  Appliances like refrigerators and radiograms.\n 2.Prescribed authority:\n The prescribed authority for the purposes of these rules is:\n  For a government servant in a Class I post: the government or a lower authority specifically designated by the government.\n  For a government servant in a Class II post: the Head of Department.\n  For a government servant in a Class III or IV post: the Head of Office.\n  For a government servant on foreign service or deputation to another government or local body: the parent department or the department to which the servant is administratively subordinate in their cadre.\n Purpose of the rules\n The purpose of the rules on declaration of assets by government servants is to:\n  Promote transparency and accountability in government service.\n  Prevent government servants from using their official position for personal gain.\n  Protect the public interest by ensuring that government servants are not involved in any illegal or unethical activities.\nConclusion:\n  Government servants should be aware of their obligation to declare their immovable and movable assets in accordance with these rules. By doing so, they can help to maintain the integrity and public trust in the functioning of government departments."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Vindication of acts and character of Government Servant ",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Vindication of acts and character of Government Servant ?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 Vindication of acts and character of Government Servant ?",
          "How can a government servant under the Gujarat Civil Services (Conduct) Rules, 1971, defend their reputation and actions in the face of allegations or charges?",
          "What are the rights and processes available to government employees in Gujarat to protect their character and conduct as per the civil services rules?",
          "How do the Gujarat Civil Services (Conduct) Rules, 1971 address issues related to the character and actions of government servants?"
        ],
        "responses": [
          " (1) Government, have resources to any court or to the press for the vindication of his public acts or character from defamatory attacks. In granting sanction to take recourse to a court, Government shall in each case decide whether it will itself bear the cost of proceedings or whether the Government servant shall institute the proceedings at his own expenses, and if so, whether in the event of a decision in his favour Government shall reimburse him to the extent of the whole or any part of the cost incurred by him in excess of the costs, compensation or damage, if any, awarded by the court.\n (2) Nothing in this rule shall be deemed to prohibit a Government servant from vindicating his private character or any act done by him in his private capacity and where any action for vindicating his private character or any act done by him in private capacity is taken, the Government servant shall submit a report to the prescribed authority regarding such action.",
          "Rule 19(1) of the Central Civil Services (Conduct) Rules, 1964 states that government servants cannot resort to any court or to the press for the vindication of their public acts or character from defamatory attacks without the previous sanction of the government. This means that government servants cannot file a lawsuit or issue a press release to defend themselves against defamatory statements without first getting permission from the government.\n The purpose of this rule is to prevent government servants from using public resources for personal gain. It also helps to ensure that government servants do not use their official position to influence the outcome of legal proceedings or to promote their own interests.\n When the government grants permission to a government servant to take legal action, it will decide whether to bear the cost of the proceedings itself or whether the government servant must institute the proceedings at their own expense. If the government decides to bear the cost of the proceedings, it will also decide whether to reimburse the government servant for any costs incurred in excess of the costs, compensation, or damage awarded by the court.\nRule 19(2) clarifies that government servants are not prohibited from vindicating their private character or any act done by them in their private capacity without the government's sanction. This means that government servants can file a lawsuit or issue a press release to defend themselves against defamatory statements that are made about their private life or about actions that they took in their personal capacity. However, government servants are required to submit a report to the prescribed authority regarding any action taken to vindicate their private character or any act done by them in their private capacity.\n The prescribed authority for the purposes of Rule 19(2) is:\n  For a government servant in a Class I post: the government or a lower authority specifically designated by the government.\n  For a government servant in a Class II post: the Head of Department.\n  For a government servant in a Class III or IV post: the Head of Office.\n  For a government servant on foreign service or deputation to another government or local body: the parent department or the department to which the servant is administratively subordinate in their cadre.\nConclusion\n  Government servants should be aware of the rules on the vindication of public acts or character from defamatory attacks. By following these rules, government servants can help to maintain the integrity and public trust in the functioning of government departments."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Purchasing or bidding for or holding any Property",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Purchasing or bidding for or holding any Property?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 Purchasing or bidding for or holding any Property?",
          "How does the Gujarat Civil Services (Conduct) Rules, 1971, regulate the acquisition of property by civil servants?",
          "What are the provisions of the Gujarat Civil Services (Conduct) Rules, 1971, concerning civil servants and property ownership?",
          "What are the restrictions on property ownership or transactions for civil servants in Gujarat under the Gujarat Civil Services (Conduct) Rules, 1971?"
        ],
        "responses": [
          " (1) No Government servant shall purchase, or bid for, either in person, or by agent, or in his own name, or in the name of any other person, or jointly, or in share with any other person, any property which may under the provision of any law in force is sold or auctioned by or under the orders of Department or office to which he belongs or under which he is employed for the time being.\n (2) Notwithstanding anything contained in rule 16, no Government servant holding any office in the Revenue or the Land Records Department shall, except with the previous permission in writing of Government or of the Revenue Inspection Commissioner, Collector, Settlement Commissioner and Director of Land Records or Superintendent of Land Records to whom he is subordinate-\n (i) purchase or bid either in person, or by agent or in his own name, or in the name of any other person, or jointly or in share with any other person for any property which may, under the provision of the Bombay Land Revenue Code, 1879, or of any other law for the time being in force, be sold by order of any revenue or judicial authority in the district in which such Government servant at the time employed.\n (ii) hold directly or indirectly any farm or is in any way concerned on his private account in the collection or payment of revenue of any kind in the district in which such Government servant is for the time being employed.\n  Provided that nothing contained in this rule shall apply to revenue paid in fulfilment of any statutory obligation:\n  Provided further that a Government servant who holds directly or indirectly any farm in the district in which he is for the time being employed shall only report this fact to Government and shall not be required to obtain sanction of Government for holding such farm. ",
          "Rule 20 of the Central Civil Services (Conduct) Rules, 1964 prohibits government servants from purchasing or bidding for property that is being sold or auctioned by or under the orders of the department or office to which they belong or under which they are employed for the time being. This prohibition is intended to prevent government servants from using their official position for personal gain.\n Sub-rule (2) of Rule 20 imposes additional restrictions on government servants holding any office in the Revenue or Land Records Department. These government servants are prohibited from:\n  Purchasing or bidding for any property that may be sold by order of any revenue or judicial authority in the district in which they are employed, without the previous permission in writing of the government or the Revenue Inspection Commissioner, Collector, Settlement Commissioner and Director of Land Records or Superintendent of Land Records to whom they are subordinate.\n  Holding directly or indirectly any farm or being in any way concerned on their private account in the collection or payment of revenue of any kind in the district in which they are for the time being employed.\n These additional restrictions are intended to prevent government servants from using their official position to influence the sale of government property or to collect revenue for their own personal gain.\nConclusion\n Government servants should be aware of the rules on the purchase of property that is being sold by or under the orders of the department or office to which they belong or under which they are employed for the time being. By following these rules, government servants can help to maintain the integrity and public trust in the functioning of government departments."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Acting as Arbitrator",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Acting as Arbitrator?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 Acting as Arbitrator?",
          "tell me about Gujarat Civil Services (Conduct) Rules,1971 Acting as Arbitrator?",
          "What is the role of civil servants in arbitration under the Gujarat Civil Services (Conduct) Rules, 1971?",
          "What are the provisions in the Gujarat Civil Services (Conduct) Rules, 1971, regarding civil servants serving as arbitrators?"
        ],
        "responses": [
          " A Government servant shall not act as an arbitrator in any private case which is likely to come before him in any shape by virtue of any judicial or executive post which he may be holding.",
          "The rule that prohibits government servants from acting as an arbitrator in any private case which is likely to come before them in any shape by virtue of any judicial or executive post which they may be holding is intended to prevent conflict of interest and to maintain the impartiality of government servants.\n An arbitrator is a neutral third party who is appointed to resolve a dispute between two parties. As a government servant, one is expected to be impartial and to uphold the law. If a government servant acts as an arbitrator in a private case, it could be seen as a conflict of interest if the case later comes before them in their official capacity. For example, if a government servant who works as a judge arbitrates a private dispute between two parties, and then one of those parties later comes before them in court, the government servant could be accused of bias or prejudice.\n The rule also helps to maintain the public trust in government institutions. If government servants are seen to be acting in their own personal interests, it can erode the public's trust in the government. By prohibiting government servants from acting as arbitrators in private cases, the rule helps to ensure that government servants are focused on their official duties and not on their personal gain.\nConclusion\n  Government servants should be aware of the rule that prohibits them from acting as arbitrators in private cases. By following this rule, government servants can help to maintain the integrity and public trust in the functioning of government departments."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Canvassing of non-official or other outside influence",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Canvassing of non-official or other outside influence?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 Canvassing of non-official or other outside influence?",
          "How do the Gujarat Civil Services (Conduct) Rules, 1971 address the issue of government employees seeking non-official or external interference in their official matters?",
          "In the context of the Gujarat Civil Services (Conduct) Rules, 1971, what does 'canvassing' refer to, and why is it prohibited for government employees?",
          "What are the restrictions imposed on government employees regarding seeking external support or influence according to the Gujarat Civil Services (Conduct) Rules, 1971?"
        ],
        "responses": [
          " No Government servant shall bring or attempt to bring any political or other outside influence ot bear upon any superior authority or to approach any member of a legislature or other non-official for interceding with any superiorauthority furthering his interest or for redressing his grievance in regard to any matter pertaining to his service under Government.",
          "This outlines a rule that pertains to the conduct and behavior of government servants in India, particularly concerning their interactions with superior authorities, members of the legislature, and non-official individuals. Here's an explanation of the key points in this rule:\nProhibition on External Influence:\n 1.Political or Other Outside Influence: Government servants are prohibited from attempting to bring political or any other outside influence to bear upon any superior authority. This means they cannot use external factors, such as political affiliations, personal connections, or any form of pressure, to influence the decisions or actions of their superiors.\nProhibition on Approaching Legislators and Non-Officials:\n 1.Approaching Legislators or Non-Officials: Government servants are also prohibited from approaching any member of a legislature (elected officials) or other non-official individuals for the purpose of interceding with any superior authority. This includes seeking assistance from legislators or non-officials to further their own interests or to redress their grievances in matters related to their service under the government.\nObjective:\n The primary objective of this rule is to maintain the independence, impartiality, and integrity of the government's decision-making process and to prevent undue external influence or pressure on government servants' superiors. It aims to ensure that government servants adhere to the established procedures and channels for addressing their concerns, grievances, or requests within the governmental framework, rather than attempting to use external factors to influence decisions.\nExplanation:\n  This rule underscores the importance of maintaining the integrity and autonomy of government processes. It reinforces the principles of professionalism and neutrality in the conduct of government servants. Government servants are expected to follow established procedures and channels for addressing their concerns or grievances, which typically involve internal mechanisms for dispute resolution and communication with superiors. Using external influence, such as political connections or contacting legislators or non-officials to gain favor, is viewed as inappropriate and contrary to the principles of impartial and unbiased governance.\n Violating this rule may result in disciplinary actions or other consequences as specified by government regulations, as it is essential to uphold the credibility and impartiality of the civil service."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Membership of or Association with communal Institution",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Membership of or Association with communal Institution?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 Membership of or Association with communal Institution?",
          "How does Rule 5 of the Gujarat Civil Services (Conduct) Rules, 1971, address the issue of civil servants' involvement with sectarian institutions?",
          "tell me about Gujarat Civil Services (Conduct) Rules,1971 Membership of or Association with communal Institution.",
          "please provide informaion about Gujarat Civil Services (Conduct) Rules,1971 Membership of or Association with communal Institution."
        ],
        "responses": [
          " No Government servant shall participate in activities of or be associated with any institution whose membership is confined to the members of a particular community or class of communities notwithstanding the fact that the activities of the institution are of a social or an educational nature. But with the prior permission of Government, Government servants may be allowed to participate in the activities of institutions having religious or moral objects.\nExplanation :- In case of doubt, whether the membership of an Institution comes within the scope of this rule, the decision of Government shall be final. ",
          "The rule prohibiting government servants from participating in or being associated with institutions whose membership is confined to the members of a particular community or class of communities is intended to promote secularism and social harmony.\n Secularism is the principle of separation of the state from religion. It means that the government should treat all religions equally and should not favor one religion over another. Social harmony is the state of peace and tranquility in a society where people from different backgrounds live together in harmony.\n Government servants are expected to be impartial and to uphold the law. If a government servant participates in or is associated with an institution that is exclusive to a particular community or class of communities, it could create the perception that they are biased or prejudiced. This could undermine public trust in the government and could lead to social unrest.\n The rule allows government servants to participate in the activities of institutions having religious or moral objects, provided that they obtain prior permission from the government. This is because institutions with religious or moral objects are generally seen as being open to all people, regardless of their community or class.\n The rule also states that the decision of the government is final in case of doubt as to whether the membership of an institution comes within the scope of the rule. This means that the government has the discretion to decide whether or not a particular institution is exclusive to a particular community or class of communities.\nConclusion\n: Government servants should be aware of the rule prohibiting them from participating in or being associated with institutions whose membership is confined to the members of a particular community or class of communities. By following this rule, government servants can help to promote secularism and social harmony."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Association of name of Government servant with Public Institution or Works",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Association of name of Government servant with Public Institution or Works?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 Association of name of Government servant with Public Institution or Works?",
          "tell me about Gujarat Civil Services (Conduct) Rules,1971 Association of name of Government servant with Public Institution or Works?",
          "Please provide information about the rules concerning the association of government servants with public institutions or works under the Gujarat Civil Services (Conduct) Rules, 1971.",
          "What does the Gujarat Civil Services (Conduct) Rules, 1971, say about government employees being associated with public institutions or works?"
        ],
        "responses": [
          " No Government servant shall except with the previous sanction of Government associate his own name or allow it to be associated with any public institution like libraries, hospitals, schools and roads or such objects as shields, trophies, prizes, medals or cups. A Government servant shall not allow any member of his family living with or wholly dependent upon him to associate his/her name with any such institution or object.",
          "The passage you provided outlines a rule that pertains to government servants in India and their association with public institutions or objects. This rule aims to maintain the neutrality and impartiality of government servants in their official capacity. Here's an explanation of the key points in this rule:\n Prohibition on Association with Public Institutions or Objects:\n 1.Personal Association with Public Institutions: Government servants are generally prohibited from associating their own names with any public institution. These public institutions can include libraries, hospitals, schools, roads, or other similar public facilities or objects.\n 2.Prohibition on Family Members' Association: Government servants are also not allowed to permit any member of their family, who lives with them or is wholly dependent upon them, to associate their name with any public institution or object.\nPrior Sanction Requirement:\n  Requirement for Previous Sanction: The rule specifies that government servants can only associate their name or permit their family members to do so with public institutions or objects if they obtain the prior sanction or approval of the government. This means that any such association must be authorized by the appropriate government authority.\nObjective:\n The primary objective of this rule is to maintain the impartiality and neutrality of government servants in their official capacity. By prohibiting government servants and their family members from associating their names with public institutions or objects without prior government sanction, it aims to prevent any potential conflicts of interest or perceived favoritism.\nExplanation:\n  This rule emphasizes that government servants should not engage in personal associations that could potentially compromise their impartiality or neutrality when it comes to government matters. It aims to prevent situations where government servants or their family members might use their influence or connections to promote or be associated with public institutions or objects.\n In practice, government servants who wish to associate their name or allow their family members to do so with such institutions or objects must seek prior approval from the government. This ensures that such associations are transparent and do not give rise to concerns of bias, favoritism, or misuse of official position.\n Violation of this rule may lead to disciplinary actions or other consequences as specified by government regulations to maintain the credibility and impartiality of government servants in their official roles."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Plural Marriages",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Plural Marriages?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 Plural Marriages?",
          "tell me about Gujarat Civil Services (Conduct) Rules,1971 Plural Marriages?",
          "What are the regulations in Gujarat regarding government employees and their marital status?",
          "Are there any provisions in Gujarat's civil service conduct rules that address the issue of polygamy among government employees?"

        ],
        "responses": [
          " (1) No Govenment servant shall enter into, or contract, a marriage with a person having a spouse living, and\n (2) No Government servant having a spouse living, shall enter into, or contract, a marriage with any person :  Provided that the State Government may permit a Government servant to enter into, or contact, any such marriage as is referred to in clause (1) or (2), if it is satisfied that-\n (a) such marriage is permissible under the personal law applicable to such Government servant and the other party to the marriage, and\n (b) there are other grounds for so doing.\n(26-A) Adoption of small family by Government servants :-\n Every Government servant shall ensure that the number of his children does not exceed three :\n Provided that nothing in this rule shall apply to a Government servant who has more than three children on the 31st day of October, 1977.\n Provided further that a Government servant referred to in the preceding proviso shall ensure that the number of his children does not exceed the number of children he has on that day.  ",
          "Rule 22 of the Central Civil Services (Conduct) Rules, 1964 prohibits government servants from entering into or contracting a marriage with a person having a spouse living, or from entering into or contracting a marriage with any person if they themselves have a spouse living, without the permission of the state government.\n The purpose of this rule is to protect the institution of marriage and to prevent government servants from engaging in adultery. Adultery is a crime in India, and government servants are expected to uphold the law. If a government servant commits adultery, it could damage their reputation and could erode public trust in the government.\n The rule also states that the state government may grant permission to a government servant to enter into or contract a marriage with a person having a spouse living, or with any person if they themselves have a spouse living, if the state government is satisfied that:\n  Such marriage is permissible under the personal law applicable to the government servant and the other party to the marriage, and\n  There are other grounds for so doing.\nThe personal law applicable to a government servant is the law of the religion or community to which they belong. For example, if a government servant is a Hindu, their personal law would be Hindu law.\n Other grounds for granting permission could include:\n  The first spouse is presumed dead or has been missing for a long period of time.\n  The first spouse is mentally ill or has a terminal illness.\n  The first spouse has consented to the divorce.\n Rule 26A of the Central Civil Services (Conduct) Rules, 1964 requires government servants to ensure that the number of their children does not exceed three. This rule is intended to promote population control and to ensure that government servants are able to provide their children with a good education and upbringing.\n The rule does not apply to government servants who have more than three children on the 31st day of October, 1977. However, these government servants are required to ensure that the number of their children does not exceed the number of children they have on that day.\nConclusion:\n  Government servants should be aware of the rules on marriage and family planning. By following these rules, government servants can help to promote the institution of marriage, population control, and public trust in the government."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Interpretation ",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Interpretation ?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 Interpretation ?",
          "tell mw about Gujarat Civil Services (Conduct) Rules,1971 Interpretation ?",
          "How do the Gujarat Civil Services (Conduct) Rules, 1971 ensure ethical and responsible behavior among civil servants?",
          "How do the Gujarat Civil Services (Conduct) Rules, 1971 impact the behavior of government employees?"
        ],
        "responses": [
          " If any question arises relating to the interpretation of these rules, it shall be referred to the Government whose decision thereon shall be final. Government shall take decision in consultation with the State Public Service Commission. ",
          "The rule that states that if any question arises relating to the interpretation of the Central Civil Services (Conduct) Rules, 1964, it shall be referred to the government whose decision thereon shall be final, is intended to provide clarity and consistency in the interpretation and application of the rules.\n The government is the ultimate authority responsible for the conduct of government servants, and therefore it is appropriate for the government to have the final say on the interpretation of the rules. The rule also requires the government to consult with the State Public Service Commission before making a decision on the interpretation of the rules. This ensures that the government's decision is made in a fair and objective manner, and that it is consistent with the principles of good governance.\n Here are some of the benefits of having the government make the final decision on the interpretation of the rules:\n  It ensures that the rules are interpreted and applied consistently across all government departments and agencies.\n  It prevents government servants from disputing the interpretation of the rules, which can lead to delays and disruption.\n  It ensures that the government's interpretation of the rules is fair and objective.\n  It upholds the government's authority as the ultimate employer of government servants.\n Here are some of the potential drawbacks of having the government make the final decision on the interpretation of the rules:\n  It could lead to arbitrary decisions by the government.\n  It could make it difficult for government servants to challenge unfair or unreasonable interpretations of the rules.\n  It could reduce transparency and accountability in the government's decision-making process.\n Overall, the benefits of having the government make the final decision on the interpretation of the Central Civil Services (Conduct) Rules, 1964, outweigh the potential drawbacks. However, it is important to ensure that the government's decision-making process is fair and objective, and that government servants have the opportunity to challenge unfair or unreasonable interpretations of the rules."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Delegation of Power ",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Delegation of Power ?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 Delegation of Power ?",
          "tell me about Gujarat Civil Services (Conduct) Rules,1971 Delegation of Power",
          "How do higher-ranking officials delegate their authority to subordinates in the Gujarat Civil Services (Conduct) Rules, 1971?",
          "How do the Gujarat Civil Services (Conduct) Rules, 1971 impact the behavior of government employees in Gujarat?"
        ],
        "responses": [
          " The Government may, by general or special order, direct that any power exercisable by it or any Head of Department or office under these rules (except the power under rule 27 and this rule) shall, subject to such conditions, if any, as may be specified in the order, be exercisable also by such officer or authority as may be specified in the order.",
          " The rule that states that the government may, by general or special order, direct that any power exercisable by it or any Head of Department or office under the Central Civil Services (Conduct) Rules, 1964 (except the power under rule 27 and this rule) shall, subject to such conditions, if any, as may be specified in the order, be exercisable also by such officer or authority as may be specified in the order is intended to provide flexibility in the implementation of the rules.\n This rule allows the government to delegate the power to exercise certain functions under the rules to lower-level officers or authorities. This can be useful for a number of reasons, such as:\n  To reduce the workload on the government and Head of Departments and offices.\n  To ensure that decisions are made in a timely manner.\n  To bring decision-making closer to the ground, where the facts of the case can be more easily ascertained.\n The rule also allows the government to specify conditions under which the delegated power can be exercised. This helps to ensure that the power is exercised in a responsible and accountable manner.\n Here are some examples of how this rule could be used:\n  The government could delegate the power to approve leave requests to department heads.\n  The government could delegate the power to investigate disciplinary cases to lower-level officers.\n  The government could delegate the power to grant permission to government servants to marry to lower-level officers.\n Overall, the rule that allows the government to delegate the power to exercise certain functions under the Central Civil Services (Conduct) Rules, 1964 to lower-level officers or authorities is a useful tool for ensuring that the rules are implemented effectively and efficiently."
        ]
      },
      {
        "tag": "Gujarat Civil Services (Conduct) Rules,1971 Repeal and Saving ",
        "patterns": [
          "What is Gujarat Civil Services (Conduct) Rules,1971 Repeal and Saving ?",
          "Expalin Gujarat Civil Services (Conduct) Rules,1971 Repeal and Saving ?",
          "How does the 'Repeal and Saving' clause affect the previous rules governing the conduct of civil servants in Gujarat?",
          "tell me about Gujarat Civil Services (Conduct) Rules,1971 Repeal and Saving",
          "What rules or regulations were repealed by the Gujarat Civil Services (Conduct) Rules, 1971, and which provisions were saved?"
        ],
        "responses": [
          " Any rules corresponding to these rules in force and applicable to the Government servant to whom these rules apply are hereby repealed :\n Provided that any order made or action taken under the rules so repealed shall be deemed to have been made or taken under the corresponding provisions of these rules :\n Provided further that such repeal shall not affect the previous operation of the rules so repealed and a contravention of any of the said rules shall be punishable as if it were a contravention of these rules.",
          "The first proviso of rules states that any rules corresponding to the Central Civil Services (Conduct) Rules, 1964, which were in force and applicable to the government servant to whom the new rules apply, are hereby repealed. This means that the old rules are no longer in effect and have been replaced by the new rules.\n The second proviso states that any order made or action taken under the old rules shall be deemed to have been made or taken under the corresponding provisions of the new rules. This means that any orders or actions that were taken under the old rules will remain valid even though the old rules have been repealed.\n The third proviso states that the repeal of the old rules shall not affect the previous operation of the old rules. This means that any violations of the old rules that occurred before the new rules came into effect will still be punishable under the old rules.\n In summary, the rule states that the old rules have been repealed and replaced by the new rules, but any orders or actions that were taken under the old rules will remain valid and any violations of the old rules that occurred before the new rules came into effect will still be punishable.\n This provision is necessary to ensure that there is a smooth transition from the old rules to the new rules. It also helps to ensure that government servants are aware of the rules and that they are held accountable for their actions."
        ]
      }
    ]
    }