{
    "intents": [
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971  PART - I GENERAL Short title, Commencement and Application",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971  Short title, Commencement and Application ",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971  Short title, Commencement and Application"
        ],
        "response":[
          "(a) These rules may be called the Gujarat Civil Services (Discipline and Appeal) Rules, 1971. \n (b) They shall come into force with effect from 15th August, 1971. \n(c) They shall apply to all persons appointed to civil services and posts in connection with the affairs of the State of Gujarat whose conditions of service are regulated in accordance with the rules made under article 309 of the Constitution. Provided that nothing in these rules shall apply to any Government servants who are members of the All India Services or who are Inspectors of Police or Members of the Subordinate ranks of the Police Force. "
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971  PART - I GENERAL Definitions",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971  Definitions ",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971  Definitions"
        ],
        "response":[
          "(a) ‘Appointing Authority’ in relation to a Government servant means :- \n (i) the authority empowered to make appointments to the service of which the Government servant is for the time being a member or the grade of the Service in which the Government servant is for the time being included, or \n (ii) the authority empowered to make appointments to the post which the Government servant for the time being holds, or \n (iii) the authority which appointed the Government servant to such service, grade or post, as the case may be, or \n (iv) where the Government servant having been a permanent member of any other service or having substantively held any other permanent post has been in continuous employment of the Government, the authority which appointed him to that service or to any grade in that service or to that post, whichever authority is the highest authority; \n (b) “Commission” means the Gujarat Public Service Commission \n (c) “Disciplinary Authority” means the authority competent under these rules to impose on a Government servant any of the penalties specified in rule 6; \n (d) “The Government” means the Government of Gujarat \n (e) “Government servant” means a person who- \n (i) is a member of a Civil Service or who holds a Civil Post under the Government and includes any such person on foreign service or whose services are temporarily placed at the disposal of the Government of India or any other Government or a local or other authority. \n (ii) is a member of a Civil Service or holds a Civil Post under the Central Government or other State Government and whose services are temporarily placed at the disposal of the Government. \n (f) Words and expressions used but not defined in these rules shall have the meanings assigned to them in the Bombay Civil Services Rules, 1959 or in the rules relating to the recruitment and classification of services for the time being in force."
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971  PART - I GENERAL Special Provision by Agreement",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971  Special Provision by Agreement ",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971  Special Provision by Agreement"
        ],
        "response":[
          "Where it is considered necessary to make special provisions for any Government servant in respect of matters covered by these rules, the appointing authority may by agreement with such Government servant, make such special provisions and thereupon these rules shall not apply to such Government servant to the extent to which the special provisions so made are inconsistent there with : \n Provided that if the appointing authority is other than Government, the previous approval of Government shall be obtained by such authority before making such special provisions."
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules 1971 PART - I GENERAL Protection of rights and privileges conferred by any law or Agreement",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971  Protection of rights and privileges conferred by any law or Agreement",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971  Protection of rights and privileges conferred by any law or Agreement"
        ],
        "response":[
          "Nothing in these rules shall deprive any Government servant of any right or privilege to which he is entitled - \n (a) by or under any law for the time being in force, or \n (b) by the terms of any agreement subsisting between such person and Government at the commencement of these rules."
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules 1971 PART - II SUSPENSION ",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971 SUSPENSION",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971  SUSPENSION"
        ],
        "response":[
          "(1) The appointing authority or any authority to which it is subordinate or the disciplinary authority or any other authority empowered by Government in that behalf may place a Government servant under suspension : \n *(a) Where a disciplinary proceeding against him is contemplated or is pending, \n Provided that, where a Government Servant against whom disciplinary proceeding is contemplated is suspended, such suspension shall not be valid unless before the expiry of a period of ninety days from which the Government servant was suspended, disciplinary proceedings is initiated against him, \n Provided further that the Government or any other authority empowered by the government by special or general order may at any time before the expiry of the said period of ninety days and after considering the special circumstances for not initiating disciplinary proceedings, to be recorded in writing extend the period of suspension beyond the period of ninety days without disciplinary proceeding being initiated: \n Provided also that such extension of suspension shall not be for a period of ninety days at a time. \n (b) Where a case against him in respect of any criminal offence involving moral turpitude is under investigation, inquiry or trial : \n Provided that where the order of suspension is made by an authority subordinate to or lower in rank than the appointing authority, such authority shall forthwith report to the appointing authority the circumstances in which the order was made. \n (2) A Government servant shall be deemed to have been placed under suspension by an order of appointing authority - \n (a) with effect from the date of his detention, if he is detained in custody, whether on a criminal charge or otherwise, for a period exceeding fortyeight hours. \n (b) with effect from the date of his conviction if, in the event of conviction for an offence, he is sentenced to a term of imprisonment exceeding fortyeight hours and is not forthwith dismissed or removed or compulsorily retired consequent upon such conviction. \n Explanation :- The period of forty-eight hours referred to in clause (b) of this sub-rule shall be computed for the commencement of the imprisonment after the conviction and for this purpose, intermittent periods of imprisonment, if any, shall be taken into account. \n #(2A) An order of suspension made or deemed to have been made under this rule shall be reviewed by the authority competent to modify or revoke the suspension, before expiry of ninety days from @ the effective date of suspension After such review, the competent authority may pass an order either extending or revoking the suspension. The subsequent reviews shall be made before expiry of the extended period of suspension. The extension of suspension shall not be for a period exceeding one hundred and eighty days, at a time. \n An order of suspension made or deemed to have been made under sub-rule (1) or (2) of this rule, shall not be valid after a period of ninety days unless it is extended after review, for a further period before the expiry of ninety days. \n Provided that no such review of suspension shall be necessary in the case of deemed suspension under sub-rule (2),if the Government servant continues to be under suspension at the time of completion of ninety days of suspension and the ninety days period in such case will count from the date the Government servant detained in custody is released from detention or the date on which the fact of his release from detention is intimated to his appointing authority ,whichever is later. \n (3) Where a penalty of dismissal, removal or compulsory retirement from service imposed upon a Government Servant under suspension is set aside in appeal or on review under these rules and the case is remitted for further enquiry or action or with any other directions, the order of his suspension shall be deemed to have continued in force with effect on and from the date of the original order of dismissal, removal or compulsory retirement and shall remain in force until further orders. \n (4) Where a penalty of dismissal, removal or compulsory retirement from service imposed upon a Government Servant is set aside or declared or rendered void in consequence of or by a decision of a court of law, and the Disciplinary Authority on a consideration of the circumstances of the case, decides to hold a further inquiry against him on the allegations on which the penalty of dismissal, removal or compulsory retirement was originally imposed the Government servant shall be deemed to have been placed under suspension by the appointing authority, from the date of the original order of dismissal, removal or compulsory retirement and shall continue to remain under suspension until further orders. \n (5) (a) Subject to the provisions contained in sub-rule (2A),an order of suspension made or deemed to have been made under this rule shall continue to remain in force until it is modified or revoked by the authority competent to do so. \n (b) Where a Government servant is suspended or is deemed to have been suspended, in connection with any disciplinary proceeding or otherwise and any other disciplinary proceeding is commenced against him during the continuance of such suspension, the authority competent to place him under suspension may, for reasons to be recorded by him in writing, direct that the Government servant shall continue to be under suspension until the termination of all or any of such proceedings. \n (c) An order of suspension made or deemed to have been made under this rule may be at any time be modified or revoked by the authority which made or is deemed to have made it or by any authority to which that authority is subordinate. \n InShort - \n A government employee may be suspended under certain conditions, such as when a disciplinary proceeding is contemplated or is pending, or when a case against the employee in respect of any criminal offence involving moral turpitude is under investigation, inquiry or trial. The suspension order must be reviewed by the competent authority before the expiry of 90 days from the effective date of suspension. The suspension may be extended for a further period of 90 days after review, and subsequent reviews shall be made before the expiry of the extended period of suspension. The extension of suspension shall not be for a period exceeding 180 days, at a time.",
          "A government employee may be suspended under certain conditions, such as when a disciplinary proceeding is contemplated or is pending, or when a case against the employee in respect of any criminal offence involving moral turpitude is under investigation, inquiry or trial. The suspension order must be reviewed by the competent authority before the expiry of 90 days from the effective date of suspension. The suspension may be extended for a further period of 90 days after review, and subsequent reviews shall be made before the expiry of the extended period of suspension. The extension of suspension shall not be for a period exceeding 180 days, at a time."
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules 1971 PART III DISCIPLINE Nature of Penalties",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Nature of Penalties",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971  Nature of Penalties"
        ],
        "response":[
          "Without prejudice to the provision of any law for the time being in force, the following penalties may, for good and sufficient reasons, be imposed upon any member of the State, Subordinate or +(Inferior Service) namely. \n Minor Penalties \n (1) Censure \n (2) Withholding of increments or promotion. \n (3) Recovery from his pay of the whole or part of any pecuniary loss caused to Government by negligence or breach of orders. \n \n Major Penalties \n (4) Reduction to a lower stage in the time scale of pay for a specified period, with further directions as to whether or not the Government servant will earn increment of pay during the period of such reduction and whether on the expiry of such period the reduction will or will not have the effect of postponing the further increments of pay. \n (5) Reduction to a lower time scale of pay, grade, post or service which shall ordinarily be a bar to the promotion of the Government servant to the time scale of pay, grade, post or service from which he was reduced, with or without further direction regarding conditions of restoration to the grade or post or service from which the Government servant was reduced and his seniority and pay on such restoration to that grade, post or service. \n (6) Compulsory retirement. \n (7) Removal from service which shall not be a disqualification for future employment under Government. \n (8) Dismissal from Service which shall ordinarily be a disqualification for future employment under Government. \n Explanation : The following shall not amount to a penalty within the meaning of this rule :- \n (1) Withholding of increments in pay of a Government Servant for failure to pass a departmental or other examination with the rules or orders in this behalf for the time being in force or in accordance with the terms of his appointment. \n(2) Stoppage of pay of a Government servant at the efficiency bar in the timescale on the ground of his unfitness to cross the bar. \n (3) Non-promotion whether in a substantive or officiating capacity of a Government servant to a service, grade or post for promotion to which he is in ordinary course eligible, on administrative grounds and not as a measure of penalty on the ground of his misconduct. \n (4) Reversion to a lower service, grade or post of a Government servant officiating in a higher service, grade or post on the ground that he is considered, after trial, to be unsuitable for such higher service grade or post or on purely administrative grounds. \n (5) Reversion to his permanent service, grade or post of a Government servant appointed on probation to another service, grade or post during or at the end of the period of probation in accordance with the terms of his appointment or the rules and orders of Government in this behalf for the time being in force. \n (6) Replacement of the services of a Government servant whose services had been borrowed from Central Government or other State Government or any other authority, at the disposal of the Central or State Government or the authority from which the services or such Government servant had been borrowed. \n (7) Compulsory retirement of a Government servant in accordance with the provisions of any law or rules for the time being in force relating to such retirement. \n (8) Termination of Service- \n (a) of a Government servant appointed on probation, during or at the end of the period of probation in accordance with the terms of his appointment or the rules and orders of Government in this behalf for the time being in force, or \n (b) of a temporary Government servant on purely administrative grounds or \n (c) of a Government servant employed under a contract in accordance with the terms of such contract. \n InShort - \n Government employees can be penalized for misconduct. There are two types of penalties: minor and major. Minor penalties include censure, withholding of increments or promotion, and recovery of pecuniary loss caused to the government. Major penalties include reduction to a lower stage in the time scale of pay, reduction to a lower time scale of pay, grade, post or service, compulsory retirement, removal from service, and dismissal from service.",
          "Government employees can be penalized for misconduct. There are two types of penalties: minor and major. Minor penalties include censure, withholding of increments or promotion, and recovery of pecuniary loss caused to the government. Major penalties include reduction to a lower stage in the time scale of pay, reduction to a lower time scale of pay, grade, post or service, compulsory retirement, removal from service, and dismissal from service."
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971 PART III DISCIPLINE Disciplinary Authority ",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971 Disciplinary Authority",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971 Disciplinary Authority"
        ],
        "response":[
          "(1) The Government may impose any of the penalties specified in rule 6 on any Government servant. \n (2) Without prejudice to the provisions of sub-rule (1) the Head of a Department may impose any of the penalties specified in* items (1) and (2) of rule 6 on any Government Servant of State Service of State Service Class II, under his administrative control. \n (3) Without prejudice to the provisions of sub-rules (1) and (2), Heads of Departments and Heads of Offices may impose any of the penalties mentioned in rule 6 upon any Government servant of subordinate +(or Inferior) services who they have power to appoint. \n (4) Without prejudice to the provisions of sub-rules (1) and (2), Heads of Departments and Heads of Offices may impose any of the penalties specified in columns 3 of the Appendix appended to these rules on any Government servant of Subordinate (or Inferior) service serving under them, whom they have no power to appoint to the extent specified against them in the corresponding column 4 of the said Appendix." 
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971 PART III Authority to institute proceedings ",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971 Authority to institute proceedings",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971 Authority to institute proceedings"
        ],
        "response":[
          "(1) The Government or any other authority empowered by it by general or special order may- \n (a) Institute a disciplinary proceeding against a Government servant; \n (b) Direct a Disciplinary Authority to institute disciplinary proceedings against any Government servant on whom that disciplinary authority is competent to impose under these rules any of the penalties specified in rule 6. \n (2) A Disciplinary Authority competent under these rules to impose any of the penalties specified in*Items (1) to (3)-Minor Penalties of Rule 6 may institute disciplinary proceedings against any Government servant for the imposition of any of the penalties specified in items (4) to (8) -Major Penalties of rule 6 not withstanding that such disciplinary authority is not competent under these rules to impose any of the latter penalties. \n (3) A Disciplinary Authority competent under these rules to impose any of the penalties specified in Rule-6 on a Government servant, shall also be competent to institute Disciplinary Proceedings against him/her for such act of commission or omission as was committed by him/her while holding another Government post previously, either in the same service or another service of the State Government." 
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971 PART IV PROCEDURE FOR IMPOSING PENALTIES Procedure for imposing major penalties ",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971 Procedure for imposing major penalties",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971 Procedure for imposing major penalties"
        ],
        "response":[
          "(1) No order imposing any of the penalties specified in items (4) to (8) of rule 6 shall be passed except after an inquiry, held as far as may be, in the manner provided in this rule and rule 10 or in the manner provided by the Public Servants (Inquiry) Act, 1850 where such inquiry is held under that Act. \n (2) Whenever the Disciplinary Authority is of the opinion that there are grounds for inquiry into the truth of any imputation of misconduct or misbehavior or of any culpable act or omission, against a Government servant, it may itself inquire into, or appoint under this rule or under the provisions of the Public Servant (Inquiry) Act, 1850 as the case may be, an authority to inquire into the truth thereof (herein-after referred to as the Inquiry Authority) \n # Provided that where there is a complaint of sexual harassment within the meaning of rule + 3-B of the Gujarat Civil services (Conduct) Rules,1971, the complaints committee established in each Department or Office for inquiring into such complaints, shall be deemed to be the inquiry authority appointed by the disciplinary authority for the purpose of these rules and the Complaints Committee shall hold, if separate procedure has not been prescribed for holding the inquiry into the complaints of sexual harassment, the inquiry as far as practicable in accordance with the procedure laid down in these rules. \n Explanation :- Where the disciplinary authority itself holds the inquiry, any reference in these rules to the Inquiry Authority shall be construed as a reference to the disciplinary Authority.. \n (3) Where it is proposed to hold an inquiry against a Government servant under this rule or rule 10, the Disciplinary Authority shall draw up or cause to be drawn up- \n (i) the substance of the imputations of misconduct or misbehavior or of any culpable act or omission into definite and distinct articles of charge; \n (ii) a statement of the imputations of misconduct or misbehavior or of any culpable act or omission in support of each article of charge, which shall contain- \n (a) a statement of all relevant facts including any admission or confession made by the Government servant; and \n (b) a list of documents by which, and a list of witnesses by whom the articles of charges are proposed to be sustained. \n (4) The Disciplinary Authority shall deliver or cause to be delivered to the Government servant a copy of the articles of charge, the statement of the imputations of misconduct or misbehavior or of any culpable act or omission and a list of documents and witnesses by which each article of charges is proposed to be sustained and shall require the Government servant to submit, within such time as may be specified, a written statement of his defence and to state whether he desires to be heard in person. \n (5) (a) On receipt of the written statement of defence, the Disciplinary Authority may itself inquire into such of the articles of charges as are not admitted or if considers it necessary, to do so appoint, under sub-rule (2) an Inquiry Authority for the purpose and where all the articles of charge have been admitted by the Government servant in his written statement of defence, the Disciplinary Authority shall record its findings on each charge after taking such evidence as it may think fit and shall act in the manner laid down in rule 10. \n (b) If no written statement of defence is submitted by the Government servant, the Disciplinary Authority may itself inquire into such articles of charge or may, if it considers it necessary to do so, appoint, under subrule (2), an Inquiry Authority for the purpose. \n (c) The Disciplinary Authority may nominate any person hereinafter referred to as the Presenting Officer to present the case in support of the Charge, before itself if it is to inquire into the charges or before the Inquiry Authority. *[The Government servant may present his case with the assistance of any other Government approved by the Inquiry Authority, but may not engage a legal practitioner for the purpose unless the Disciplinary Authority having regard to the circumstances of the case so permits]. \n +Note :The Government servant may also take the assistance of a retired Government servant to present the case on his behalf subject to such conditions as may be determined in general or special orders issued by the Government from time to time. \n (6) The Disciplinary Authority shall, where it is not the Inquiry Authority, forward to the Inquiry Authority- \n (i) a copy of the articles of charges and the statement of imputations of misconduct or misbehavior; \n (ii) a copy of the written statement of defence, if any, submitted by the Government servant; \n (iii) a copy of the statement of witnesses, if any referred to in sub-rule (3); \n (iv) evidence proving the delivery of the documents referred to in sub-rule (3) to the Government servant; and \n (v) a copy of the order appointing the presenting Officer. \n (7) The Government servant shall appear in person before the Inquiry Authority on such day and at such time within ten working days from the date of receipt by him of the articles of charges and the statement of the imputations of misconduct or misbehavior, as the Inquiry Authority may, by a notice in writing specify in this behalf, or within such further time not exceeding ten days, as the Inquiry Authority may allow. \n (8) If the Government servant who has not admitted any of the articles of charge in his written statement of defence, appears before the Inquiry Authority, such authority shall ask him whether he is guilty or has any defence to make and if he pleads guilty to any of the articles of charge, the Inquiry Authority shall record the plea, sign the record and obtain the signature of the Government servant thereon. \n (9) The Inquiry Authority shall return a finding of guilt in respect of those articles of charges to which the Government servant pleads guilty. \n (10) The Inquiry Authority shall, if the Government servant fails to appear within the specified time or refuses or omits to plead, require the Presenting Officer to produce the evidence by which he proposes to prove the articles of charges, and shall adjourn the case to later date not exceeding thirty days, after recording an order that the Government servant may for the purpose of preparing his defence- \n (i) inspect within five days of the order or within such further time not exceeding five days as the Inquiring Authority may allow, the documents specified in the list referred to in sub-rule (3); \n (ii) submit a list of witness to be examined on his behalf; \n Note : If the Government servant applies orally or in writing for the supply of copies of the statement of witnesses mentioned in the list referred to in sub-rule (3), the Inquiry Authority shall furnish him with such copies as early as possible and in any case not later than three days before the commencement of the examination of the witnesses on behalf of the Disciplinary Authority. \n (iii) give a notice within ten days of the order or within such further time not exceeding ten days as the Inquiry Authority may allow, for the discovery or production of any documents which are in the possession of Government, but not mentioned in the list referred to in sub-rule (3). \n Note : The Government servant shall indicate the relevance of the documents required by him to be discovered or produced by the Government. \n (11) The Inquiry Authority shall, on receipt of the notice for the discovery or production of documents forward the same or copies thereof to the authority in whose custody or possession the documents are kept, with a requisition for the production of the documents by such date as may be specified in such requisition : \n Provided that the Inquiry Authority may, for reasons to be recorded by it in writing, refuse to requisition such of the documents as are in its opinion, not relevant to the case. \n (12) On receipt of the requisition referred to in sub-rule (11), every authority having the custody or possession of the requisitioned documents shall produce the same before the Inquiry Authority. \n Provided that if the authority having the custody or possession of the requisitioned documents is satisfied for reasons to be recorded by it in writing that the production of all or any of such documents would be against the public interest or security of the State, it shall inform the Inquiry Authority accordingly and the Inquiry Authority shall, on being so informed communicate the information to the Government servant and withdraw the requisition made by it for the production or discovery of such documents. \n (13) On the date fixed for the inquiry, the oral and documentary evidence by which the articles of charges are proposed to be proved shall be produced by or on behalf of the Disciplinary Authority. The witnesses shall be examined by or on behalf of the Presenting Officer and may be cross-examined by or on behalf of the Government servant. The Presenting Officer shall be entitled to re-examine the witnesses on any points on which they shall have been cross-examined, but not on any new matter, without the leave of the Inquiry Authority. The Inquiry Authority may also put such questions to the witnesses as it thinks fit. \n (14) If it shall appear necessary before the close of the case on behalf of the Disciplinary Authority, the Inquiry Authority may, in its discretion, allow the Presenting Officer to produce evidence not included in the list given to the Government servant or may itself call for new evidence of recall and reexamine any witness and in such case the Government servant shall be entitled to have, if he demands it, a copy of the list of further evidence proposed to be produced and an adjournment of the inquiry for three clear days before the production of such new evidence, exclusive of the day of adjournment and the day to which the inquiry is adjourned. The Inquiry Authority shall give the Government servant an opportunity of inspecting such documents before they are taken on the record. The Inquiry Authority may also allow the Government servant to produce new evidence, if it is of the opinion that the production of such evidence is necessary in the interest of justice. \n Note : New evidence shall not be permitted or called for and no witness shall be recalled to fill up any gap in the evidence .Such evidence may be called for only when there is an inherent lacuna or defect in the evidence which has been produced originally. \n (15) When the case for the Disciplinary Authority is closed, the Government servant shall be required to state his defence, orally or in writing, as he may prefer. If the defence is made orally, it shall be recorded and the Government servant shall be required to sign the record. In either case, a copy of the statement of defence shall be given to the Presenting Officer, if any has been appointed. \n (16) The evidence on behalf of the Government servant shall then be produced. The Government servant may examine himself in his own behalf if he so prefers. The witnesses produced by the Government servant shall then be examined and shall be liable to cross-examination, re-examination and examination by the Inquiry Authority according to the provisions applicable to the witnesses for the Disciplinary Authority. \n (17) The Inquiry Authority may, after the Government servant closes his case, and shall if the Government servant has not examined himself, generally, question him on the circumstances appearing against him in the evidence for the purpose of enabling the Government servant to explain any circumstances appearing in the evidence against him. \n (18) The Inquiry Authority may, after the completion of the production of evidence, hear the Presenting Officer, if any, appointed, and the Government servant, or permit them to file written briefs of their respective case, if they so desire. \n (19) If the Government servant to whom a copy of the articles of charge has even delivered does not submit the written statement of defence on or before the date specified for the purpose or does not appear in person before the Inquiry Authority or otherwise fails or refuses to comply with the provisions of this rule, the Inquiry Authority may hold the inquiry ex-parte. \n (20) (a) Where a Disciplinary Authority competent to impose any of the penalties specified in # items (1) to (3) of rules 6 (but not competent to impose any of the penalties specified in items (4) to (8) has itself inquired into or caused to be inquired into the articles of any charge and that authority having regard to its own findings or having regard to its decision on any of the findings of any Inquiry Authority appointed by it, is of the opinion that the penalties specified in item (4) to (8) of rule 6 should be imposed on the Government servant, that authority shall forward the records of the Inquiry to such Disciplinary Authority as is competent to impose the last mentioned penalties. \n (b) The Disciplinary Authority to which the records are so forwarded, may act on the evidence on the record or may, if it is of the opinion that further examination of any of the witnesses is necessary in the interest of justice, recall the witness and examine, cross-examine, and reexamine the witness and may impose on the Government servant such penalty as it may deem fit in accordance with these rules. \n (21) Wherever an Inquiry Authority, after having heard and recorded the whole or any part of the evidence in an inquiry ceases to exercise jurisdiction therein, and is succeeded by another Inquiry Authority which has and which exercises such jurisdiction, the Inquiry Authority, so succeeding may act on the evidence so recorded by its predecessor, or partly recorded by its predecessor and partly recorded by itself. \n Provided that if the succeeding Inquiry Authority is of the opinion that further examination of any of the witnesses whose evidence has already been recorded is necessary in the interests of justice, it may recall, examine, crossexamine and re-examine any such witnesses as herein before provided. \n (22) (i) After the conclusion of the inquiry, a report shall be prepared and it shall contain- \n (a) the articles of charge and the statement of imputations of misconduct or misbehavior or of any culpable act or omission; \n (b) the defence of the Government servant in respect of each article of charge; \n (c) an assessment of the evidence in respect of each articles of charge; \n (d) the finding on each article of charge and the reasons therefore. \n Explanation : If in the opinion of the Inquiry Authority the proceedings of the inquiry establish any article of charge different from the original articles of the charge, it may record its findings on such article of charge : \n Provided that the findings on such article of charge shall not be recorded unless the Government servant has either admitted the facts on which such article of charge is based or has had a reasonable opportunity of defending himself against such article of charge. \n (ii) The Inquiry Authority, where it is not itself the Disciplinary Authority shall forward to the Disciplinary Authority the records of inquiry which shall included- \n(a) the report prepared by it under clause (i), \n (b) the written statement of defence, if any, submitted by the Government servant. \n (c) the oral and documentary evidence produced in the course of the inquiry. \n (d) written briefs, if any, filed by the Presenting Officer or the Government servant or both during the course of the inquiry, and \n (e) the orders, if any, made by the Disciplinary Authority and the Inquiry Authority in regard to the inquiry.",
          "If in the opinion of the Inquiry Authority the proceedings of the inquiry establish any article of charge different from the original articles of the charge, it may record its findings on such article of charge : \n Provided that the findings on such article of charge shall not be recorded unless the Government servant has either admitted the facts on which such article of charge is based or has had a reasonable opportunity of defending himself against such article of charge. \n (ii) The Inquiry Authority, where it is not itself the Disciplinary Authority shall forward to the Disciplinary Authority the records of inquiry which shall included- \n(a) the report prepared by it under clause (i), \n (b) the written statement of defence, if any, submitted by the Government servant. \n (c) the oral and documentary evidence produced in the course of the inquiry. \n (d) written briefs, if any, filed by the Presenting Officer or the Government servant or both during the course of the inquiry, and \n (e) the orders, if any, made by the Disciplinary Authority and the Inquiry Authority in regard to the inquiry." 
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971 PART IV PROCEDURE FOR IMPOSING PENALTIES Action on the Inquiry Report ",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971 Action on the Inquiry Report",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971 Action on the Inquiry Report"
        ],
        "response":[
          "(1) The Disciplinary Authority, if it is not itself the Inquiry Authority may, for reasons to be recorded by it in writing, remit the case to the Inquiry Authority for further inquiry and report and the Inquiry Authority shall there upon proceed to hold the further inquiry according to the provisions of rule 9, as far as may be. \n (2) The Disciplinary Authority shall, if it disagrees with the findings of the Inquiry Authority on any article of charge, record its reasons for such disagreement and record its own finding on such charge if the evidence on record is sufficient for the purpose. \n (3) If the Disciplinary Authority having regard to its findings on all or any of the articles of charge is of the opinion that any of the penalties specified in items (1) to (3) of rule 6 should be imposed on the Government servant, it shall not withstanding anything contained in rule 11 make an order imposing such penalty : \n Provided that in every case where it is necessary to consult the Commission, the record of the inquiry shall be forwarded by the Disciplinary Authority to the Commission for its advice and such advice shall be taken into consideration before making any order imposing any penalty on the Government Servant. \n (4) If the Disciplinary Authority having regard to its findings on all or any of the articles of charge and on the basis of the evidence adduced during the inquiry is of that opinion that any of the penalties specified in items (4) to (8) of Rule 6 should be imposed on the Government servant, it shall make an order imposing such penalty it shall not be necessary to give the Government servant any opportunity of making representation on the penalty proposed to be imposed : \n Provided that in every case where it is necessary to consult the Commission, the record of the enquiry shall be forwarded by the Disciplinary Authority to the Commission for its advice and the advice shall be taken into consideration before making an order imposing any such penalty as may be imposed on the Government Servant." 
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971 PART IV PROCEDURE FOR IMPOSING PENALTIES Procedure for imposing minor penalties ",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971 Procedure for imposing minor penalties",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971 Procedure for imposing minor penalties"
        ],
        "response":[
          "(1) Subject to the provisions of sub-rule (3) of rule 10, no order imposing on a Government servant any of the penalties specified in items (1) to (3) of rule 6 shall be passed except after- \n  (a) informing the Government servant in writing of the proposal to take action against him and of the imputation of misconduct or misbehavior or of any culpable act or omission, on which it is proposed to be taken, and giving him a reasonable opportunity of making such representation as he may wish to make against the proposal. \n  (b) holding an inquiry in the manner laid down in the sub-rules (3) to (23) of rule 9, in every case in which the Disciplinary Authority is of the opinion that such inquiry is necessary. \n  (c) taking the representation, if any, submitted by the Government servant under clause (a) and the record of inquiry, if any, held under clause (b) into consideration, \n (d) recording a finding on each imputation of misconduct or misbehavior orof any culpable act or omission, and \n (e) consulting the Commission where such consultation is necessary. \n Provided that where it is proposed after considering the representation, if any, made by the Government servant under clause (a) to withhold increments of pay and such withholding of increments is likely to affect adversely the amount of pension payable to the Government servant or to withhold increments of pay for a period exceeding three years or to withhold increments of pay with cumulative effect for any period, and inquiry shall be held in the manner laid down in sub-rules (3) to (22) of rule 9, before making any order imposing such penalty on a Government servant. \n (2) The record of the proceedings in such cases shall include- \n (i) a copy of the intimation to the Government servant of the proposal to take action against him, \n (ii) a copy of the statement of imputations of misconduct or misbehavior delivered to him, \n (iii) his representation, if any, \n (iv) the evidence produced during the inquiry, \n (v) the advice of the Commission, if any, \n (vi) the finding on each imputation of misconduct or misbehavior, or of any culpable act or omission, and \n (vii) the orders on the case together with the reasons therefore. \n InShort - \n  The government servant must be informed of the proposal to take action against him and given an opportunity to make a representation. An inquiry may be held if necessary. The disciplinary authority must take into consideration the government servant's representation and the record of inquiry, if any, and record a finding on each allegation. The disciplinary authority must consult the commission where necessary. If the disciplinary authority proposes to withhold increments of pay for a period exceeding three years or with cumulative effect for any period, an inquiry must be held before making any order imposing such penalty. The record of the proceedings must include all relevant documents." 
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971 PART IV PROCEDURE FOR IMPOSING PENALTIES Imposition of Minor Penalty with Consent of Government Servant ",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971 Imposition of Minor Penalty with Consent of Government Servant",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971 Imposition of Minor Penalty with Consent of Government Servant"
        ],
        "response":[
          "(1) Where the Disciplinary Authority has delivered or caused to be delivered to the Government servant a copy of the articles of charge, the statement of imputations of misconduct or misbehavior or of any culpable act or omission and has received the written statement of defence sent by the Government servant in respect thereof, the Disciplinary Authority may forward such records of proceedings to the High Level Committee. \n (2) Where the High Level Committee on consideration of proceedings received by it under sub-rule (1), is of the opinion that the Government servant is liable to a minor penalty, it shall require the Government servant to appear before it and after considering the submissions, if any, made by such Government servant propose the minor penalty to be imposed on him and inform the Government servant accordingly. \n (3) (a) Where the Government servant agrees to the minor penalty as proposed, the High Level Committee shall record the consent given by the Government servant and obtain his signature thereon and shall make an order imposing the minor penalty on such Government servant. \n (b) Where High Level Committee after considering the records of proceedings and the submission made by the Government servant is of the opinion that no penalty is to be imposed, it may make an order exonerating the Government servant from the charges. \n (4) Where – \n (a) the Government servant does not agree to the minor penalty as proposed by the committee; or \n (b) the Committee, on consideration of the records of proceeding, is of the opinion that prima facie, the Government servant may become liable to major penalty, \n the High Level Committee shall return the record of proceedings to the DisciplinaryAuthority for holding an inquiry against the Government servant in accordance with these rules”. \n InShort - \n The Disciplinary Authority may forward the records of proceedings to the High Level Committee (HLC). The HLC may propose a minor penalty to the government servant. If the government servant agrees to the minor penalty, the HLC will record the consent and make an order imposing the penalty. If the government servant does not agree to the penalty, or if the HLC believes that the government servant may be liable for a major penalty, the HLC will return the records to the Disciplinary Authority for an inquiry." 
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971 PART IV PROCEDURE FOR IMPOSING PENALTIES Communication of orders ",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971 Communication of orders",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971 Communication of orders"
        ],
        "response":[
          "Orders made by the Disciplinary Authority shall be communicated to the Government servant who shall also be supplied with a copy of the report of the inquiry, if any, held by the Disciplinary Authority and a copy of its findings on each article of charge, or where the Disciplinary Authority is not the Inquiry Authority, a copy of the report of the Inquiry Authority and a statement of the findings of the Disciplinary Authority together with brief reasons for its disagreement, if any, with the finding of the Inquiry Authority (unless they have already been supplied to him) and also a copy of the advice, if any, given by the Commission and, when the Disciplinary Authority has not accepted the advice of the Commission, a brief statement of the reasons for such non-acceptance." 
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971 PART IV PROCEDURE FOR IMPOSING PENALTIES Common (Joint) Proceedings ",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971 Common (Joint) Proceedings",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971 Common (Joint) Proceedings"
        ],
        "response":[
          "(1) Where two or more Government servants are concerned in any case, the Government or any other authority competent to impose the penalty of dismissal from service on all such Government servants may make an order directing that disciplinary action against all of them may be taken in a common proceeding. \n Note : If the authorities competent to impose the penalty of dismissal on such Government servants are different, an order for taking disciplinary action in a common proceeding may be made by the highest in rank of such authorities with the consent of the others. \n (2) Subject to the provisions of sub-rule (4) and rule 7, any such order shall specify- \n (i) the authority which may function as the Disciplinary Authority for the purpose of such common proceedings. \n (ii) the penalties specified in rule 6 which such Disciplinary Authority shall be competent to impose. \n (iii) whether the procedure laid down in rules 9 and 10 or rule 11 shall be followed in the proceeding." 
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971 PART IV PROCEDURE FOR IMPOSING PENALTIES Special procedure in certain cases",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971 Special procedure in certain cases",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971 Special procedure in certain cases"
        ],
        "response":[
          "(1) Nothing contained in rules 8 or 9 shall apply- \n  (i) where a penalty is to be imposed on a Government servant on the ground of conduct which has led to his conviction on a criminal charge, or \n  (ii) where the Disciplinary Authority is satisfied for reasons to be recorded in writing that it is not reasonably practicable to follow the procedure prescribed in the said rules, or \n  (iii) where the Government is satisfied that in the interest of the security of the State, it is not expedient to follow such procedure. \n(2) In cases to which the provision of sub-rule (1) shall apply, the Disciplinary Authority may consider the circumstances of the case concerned and pass such order thereon as it deems fit : \n Provided that the Commission shall be consulted before passing such orders in any case in which such consultation is necessary." 
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971 PART IV PROCEDURE FOR IMPOSING PENALTIES Provisions regarding officers lent to Central Government or other State Governments, etc",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971 Provisions regarding officers lent to Central Government or other State Governments, etc",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971 Provisions regarding officers lent to Central Government or other State Governments, etc"
        ],
        "response":[
          "(1) Where the services of a Government servant are lent to the Central Government or other State Government or an authority subordinate thereto or to a local or other authority (hereinafter in this rule referred to as “the borrowing authority”), the borrowing authority shall have the powers of the appointing authority for the purpose of placing such Government Servant under suspension and of the Disciplinary Authority for the purpose of conducting a disciplinary proceeding against him : \n  Provided that the borrowing authority shall forthwith inform the authority which lent the services of the Government servant (hereinafter in this rule referred to as “The lending authority”) of the circumstances leading to the order of suspension of such Government servant or the commencement of the disciplinary proceeding, as the case may be. \n(2) In the light of the finding in the disciplinary proceeding conducted against the Government servant- \n (i) if the borrowing authority is of the opinion that any of the penalties specified in @ items (1) to (3) of the rule 6 shall be imposed on the Government servant, it may, after consultation with the lending authority, make such orders on the case as it deems necessary : \n Provided that in the event of a difference of opinion between the borrowing authority and the lending authority, the services of the Government servant shall be replaced at the disposal of the lending authority. \n (ii) If the borrowing authority is of the opinion that any of the penalties specified in items (4) to (8) of rule 6 shall be imposed on the Government servant, it shall replace his services at the disposal of the lending authority and transmit to it the proceedings of the inquiry and thereupon the lending authority may, if it is the Disciplinary Authority, pass such order thereon as it may deem necessary and if it is not the Disciplinary Authority, submit the case to the Disciplinary Authority which shall pass such orders on the case it may deem necessary : \n Provided that before passing any such order, the Disciplinary Authority shall comply with the provisions of sub-rules (3) and (4) of rule-10. \n Explanation :- The Disciplinary Authority may make an order under this clause on the record of the inquiry transmitted to it by the borrowing authority, or after holding such further inquiry as it may deem necessary so far as may be, in accordance with rule 9." 
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971 PART IV PROCEDURE FOR IMPOSING PENALTIES Provisions regarding officers borrowed from Central Government or other State Government etc.",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971 Provisions regarding officers borrowed from Central Government or other State Government etc.",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971 Provisions regarding officers borrowed from Central Government or other State Government etc."
        ],
        "response":[
          "(1) When an order of suspension is made or a disciplinary proceeding is conducted against a Government servant whose services have been borrowed from Central Government or other State Government or an authority subordinate thereto or a local or other authority, the authority lending his services (hereinafter in this rule referred to as “the lending authority”) shall forthwith be informed of the circumstances leading to the order of the suspension of the Government servant or of the commencement of the disciplinary proceeding, as the case may be. \n(2) In the light of the finding in the disciplinary proceeding conducted against the Government servant, if the Disciplinary Authority is of the opinion that any of the penalties specified in items (1) to (3) of rule 6 should be imposed on him, it may, subject to the provisions of sub-rule (3) of rule 10 after consultation with the lending authority pass such orders on the case as it may deem necessary : \n Provided that in the event of a difference of opinion between the borrowing authority and the lending authority, the services of the Government servant shall be replaced at the disposal of the lending authority. \n (3) If the disciplinary authority is of the opinion that any of the penalties specified in items (4) to (8) of rule 6 should be imposed on the Government servant, it shall replace the services of such Government servant at the disposal of the lending authority and transmit to it the proceeding of the inquiry for such action as it may deem necessary." 
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971 PART V APPEALS Orders against which an appeal shall not lie",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971 Orders against which an appeal shall not lie",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971 Orders against which an appeal shall not lie"
        ],
        "response":[
          "Notwithstanding anything contained in this Part, no appeal shall lie against :- \n (i) any order of an interlocutory nature or of the nature of a step-in-aid for the final disposal of a disciplinary proceeding, other than an order of suspension; \n (ii) any order passed by an inquiry authority in the course of an inquiry under rule 9. \n (iii) any order passed by the High Level Committee under rule 11-A." 
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971 PART V APPEALS Orders against which appeal lies",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971 Orders against which appeal lies",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971 Orders against which appeal lies"
        ],
        "response":[
          "(1) Subject to the provisions of rule 22, a Government servant may prefer an appeal against all or any of the following orders, namely :- \n (i) an order of suspension made or deemed to have been made under rule 5, \n (ii) an order imposing any of the penalties specified in *(rule 6) whether made by the Disciplinary Authority or by any appellate or reviewing authority, \n (iii) an order enhancing any penalty, imposed under rule 6, \n (iv) an order which- \n  (a) denies or varies to his disadvantage his pay, allowances, pension or other conditions of services as regulated by rules or by agreement, or \n  (b) interprets to his disadvantage the provisions of any such rules or agreement. \n  (c) discharges him from service, or \n  (d) has the effect of his non-promotion to a higher post, or \n  (e) has the effect of his non-confirmation in service. \n (v) an order- \n  (a) stopping him at the efficiency bar in the time scale of pay on the ground of his unfitness to cross the bar. \n  (b) reverting him while officiating in a higher service, grade or post to a lower service, grade or post, otherwise than as a penalty. \n  (c) reducing or withholding the pension or denying the maximum pension admissible to him under the rules. \n  (d) determining the subsistence and other allowances to be paid to him for the period of suspension or for the period during which he is deemed to be under suspension or for any portion thereof. \n  (e) determining his pay and allowances- \n   (i) for the period of suspension, or \n   (ii) for the period from the date of his dismissal, removal or compulsory retirement from service, or from the date of his reduction to a lower service, grade, post, time-scale or stage in a time scale of pay, to the date of his reinstatement or restoration to his service, grade or post, or \n  (f) determining whether or not the period from the date of hissuspension or from the date of his dismissal, removal, compulsory retirement or reduction to a lower service, grade, post, time scale of pay or stage in a time scale of pay to the date of his re-instatement or restoration to his service, grade or post shall be treated as a period spent on duty for any purpose. \n(2) An appeal referred to in sub-rule (1) shall lie to an officer immediately superior to the Officer who made the order provided that : \n  (i) an appeal against an order reducing or withholding the pension or denying the maximum pension admissible under the rules shall lie only to the Government. \n  (ii) an appeal from a decision of an officer in appeal shall lie only to the Government. \n  (iii) an appeal against an order in a common proceeding held under rule 13 shall lie to the authority to which the authority functioning as the Disciplinary Authority for the purpose of that proceeding is immediately subordinate. \n  (iv) where the person who made the order appealed against becomes, by virtue of his subsequent or otherwise, the appellate authority in respect of such order, an appeal against such order shall lie to the authority to which such person is immediately subordinate. \n(3) An appeal shall lie to the State Government from an order passed by an officer or authority, immediately subordinate to the State Government, irrespective of whether such order is passed in exercise of original or appellate power or power of review. \n Explanation :- In this rule- \n (i) the expression “Government servant” includes a person who has ceased to be in Government Services. \n (ii) the expression “Pension” includes additional person, gratuity and any other retirement benefit." 
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971 PART V- APPEALS Period of limitation for appeals",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971 Period of limitation for appeals",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971 Period of limitation for appeals"
        ],
        "response":[
          "No appeal under this part shall be entertained unless it is submitted within a period of 45 days from the date on which the appellant receives a copy of the order appealed against : \n Provided that the appellate authority may entertain the appeal after the expiry of the said period, if it is satisfied that the appellant had sufficient cause for not submitting the appeal in time." 
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971 PART V- APPEALS Form and contents of appeals",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971 Form and contents of appeals",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971 Form and contents of appeals"
        ],
        "response":[
          " (1) Every person preferring an appeal do so separately and in his own name. \n (2) The appeal shall be presented to the authority to whom the appeal lies, and a copy thereof forwarded by the appellant to the authority which made the order appealed against. It shall contain all material statements and arguments on which the appellant relies, shall not contain any disrespectful or improper language, and shall be complete itself. \n (3) The authority which made the order appealed against shall on receipt of a copy of the appeal, forward the same together with the relevant records to the appellate authority without any avoidable delay, and without waiting for any direction from the appellate authority." 
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971 PART V APPEALS Consideration of appeals",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971 Consideration of appeals",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971 Consideration of appeals"
        ],
        "response":[
          "(1) In the case of an appeal against an order of suspension, the appellate authority shall consider whether in the light of the provisions of rule 5 and having regard to the circumstances of the case, the order of suspension is justified or not and confirm or revoke the order accordingly. \n(2) In the case of an appeal against an order imposing any of the penalties specified in rule 6, or enhancing any penalty imposed under the said rule, the appellate authority shall consider- \n (a) whether the procedure prescribed in these rules has been complied with; \n (b) whether such non-compliance, if any, has resulted in any material irregularity or illegality so as to result in miscarriage of justice. \n (c) where the finding are justified, and \n (d) whether the penalty imposed is excessive, adequate or inadequate, and, after consultation with the Commission, if such consultation is necessary in the case, pass orders; \n  (i) setting aside, reducing, confirming or enhancing the penalty, or \n  (ii) remitting the case to the authority which imposed the penalty or to any other authority for further inquiry or with such direction as it may deem fit in the circumstances of the case : \n  Provided that- \n  (i) the appellate authority shall not so enhance the penalty as to inflict a penalty which neither such authority nor the authority which made the order appealed against is competent to impose in the case under appeal; \n  (ii) no order for enhancing the penalty shall be passed unless the appellant is given an opportunity of making any representation which he may wish to make against such enhanced penalty, and \n  (iii) if the enhanced penalty which the appellate authority proposes to impose is one of the penalties specified in items (4) to (8) of rule 6 and an inquiry under rule 9 has not already been held in the case, the appellate authority shall subject to the provisions of rule 11, itself hold such inquiry or direct some other person to hold such inquiry in accordance with the provisions of rule-8 and thereafter on consideration of the proceeding and record of such inquiry and after giving the appellant an opportunity of making any representation which he may wish to make against such penalty, pass such orders as it may deem fit. \n(3) In the case of an appeal against any order specified in rule 14, the appellate authority shall consider all the circumstances of the case and pass such orders as it deems just and equitable." 
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971 Part VI Review Government’s power to review",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971 Government’s power to review",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971 Government’s power to review"
        ],
        "response":[
          "Notwithstanding anything contained in these rules, the Government may, in its own motion or otherwise, after calling for the record of the case, review any order passed by any authority which is made or is appealable, or which is deemed to have been made or to be appealable, under these rules and, after consultation with the Commission where such consultation is necessary and may- \n (a) confirm, modify or set aside the order; \n (b) impose any penalty or set aside, reduce, confirm or enhance the penalty imposed by the order; \n (c) remit the case to the authority which made the order or to any other authority directing such further action or inquiry as it considers proper in the circumstances of the case, or \n (d) pass such other order as it deems fit; \n Provided that \n  (i) an order imposing or enhancing a penalty shall not be passed unless the person concerned has been given an opportunity of making any representation which he may wish to make against such enhanced penalty; \n  (ii) if the Government proposes to impose any of the penalties specified in items (4) to (8) of rule 6 in a case where an inquiry under rule 9 has not been held, it shall, subject to the provisions of rule 14, itself hold such inquiry or direct some person to hold such inquiry in accordance with the provisions of rule 9 and thereafter on consideration of the proceedings and record of such inquiry and after giving the person concerned an opportunity of making any representation which he may wish to make against such penalty pass such orders as it may deem fit. \n  (iii) the Government shall not review orders or decisions of any officer or authority in relation to a specified Civil Servant as defined in section 2(h) of the Gujarat Civil Services Tribunal Act, 1972 (Gujarat Act No. 2 of 1973) (hereinafter referred to as “the said Act”) with respect to any of the matters specified in the Schedule to the said Act, in the cases where an appeal lies to the Gujarat Civil Services Tribunal constituted under section-3 of the said Act against such orders or decision under section 11 of the said Act." 
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971 Part VI Review- Review of orders in disciplinary cases",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971 Review of orders in disciplinary cases",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971 Review of orders in disciplinary cases"
        ],
        "response":[
          "The authority to which an appeal against an order imposing any of the penalties specified in rule 6 lies may, of its own motion or otherwise, call for the record of any proceeding under these rules and review any order passed in such a case and, may, after consultation with the Commission where such consultation is necessary, pass such orders as it deems fit as if the Government servant had preferred an appeal against such order; \n Provided that no action under this rule shall be taken after the expiry of a period of more than six months from the date of such order." 
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971 Part VI Review- Review by Government of its own order",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971 Review by Government of its own order",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971 Review by Government of its own order"
        ],
        "response":[
          "(1) the Government may review its own order provided the following conditions are fulfilled, namely :- \n (i) there is some error apparent on the face of the record, or \n (ii) there are other sufficient reasons for review \n Provided that the penalty inflicted on a Government servant shall not be enhanced unless he has given an opportunity to show cause why such penalty should not be enhanced; \n Provided further that none of the penalties specified in @ items (1) to (3) of rule 6 shall be changed to any of the penalties specified in items (4) to (8) of the said rule 6 unless the procedure laid down in rule 9 has been followed. \n(2) No proceedings of review under this rule shall be commenced until after- \n (i) the expiry of the period of limitation for an appeal, or \n (ii) the disposal of the appeal, when any such appeal has been preferred." 
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971 PART VII MISCELLANEOUS Power to relax time limit and condone delay",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971 Power to relax time limit and condone delay",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971 Power to relax time limit and condone delay"
        ],
        "response":[
          "Save as otherwise expressly provided in these rules, the authority competent under these rules to make any order, may, for good and sufficient reasons or if sufficient cause is shown, extend the time specified in these rules for anything required to be done under these rules or condone any delay." 
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971 PART VII MISCELLANEOUS Supply of copy of Commission’s advice",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971 Supply of copy of Commission’s advice",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971 Supply of copy of Commission’s advice"
        ],
        "response":[
          "Wherever the commission is consulted as provided in these rules, a copy of the advice by the commission and, where such advice has not been accepted, also a brief statement of the reasons for such non-acceptance, shall be furnished to the Government servant concerned along with a copy of the order passed in the cases by the authority making the order." 
        ]
      },
      {
        "tags" : "Gujarat Civil Services (Discipline and Appeal) Rules  1971 PART VII MISCELLANEOUS Repeal and Saving",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971 Repeal and Saving",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971 Repeal and Saving"
        ],
        "response":[
          "(1) Any rule corresponding to these rules in force immediately before the commencement of these rules and applicable to the Government servants to whom these rules apply are hereby repealed : \n (a) such, repeal shall not affect the previous operation of the said rules or anything done or any action taken there under : \n (b) any order passed under the rules hereby repealed shall, so far as it is not inconsistent with these rules, be deemed to have been passed under these rules; \n (c) any proceedings under the said rules pending at the commencement of these rules shall be continued and disposed of, as far as may be, in accordance with the provisions of these rules. \n(2) Nothing in these rules shall operate to deprive any person to whom these rules apply of any right of appeal which had accrued to him under the rules hereby repealed in respect of any order passed before the commencement of these rules, and such right, if not exercisable under these rules, shall be exercisable as if the rules referred to in sub-rule (1) had not been repealed. \n(3) An appeal pending at or preferred after the commencement of these rules against an order made before such commencement shall be considered and orders thereon shall be passed, in accordance with these rules." 
        ]
      },
      {
        "tags" : "MISCELLANEOUS Removal of doubts",
        "patterns":[
          "What is  Civil Services (Discipline and Appeal) Rules 1971 Removal of doubts",
          "Explain about Civil Services (Discipline and Appeal) Rules 1971 Removal of doubts"
        ],
        "response":[
          "Where a doubt arises as to who is the Head of any office or as to whether any authority is subordinate to or higher than any other authority or as to the interpretation of any of the provisions of these rules, the matter shall be referred to the Government whose decision thereon shall be final." 
        ]
      }
    ]
}