{
    "intents": [
      {
        "tag": "Instructions regarding the Business of the Government issued under rule 15of the Gujarat Government.Rules of Business, 1990.Confidential GENERAL ADMINISTRATION DEPARTMENT order",
        "patterns": [
          "what is Instructions regarding the Business of the Government issued under rule 15of the Gujarat Government.Rules of Business, 1990.Confidential GENERAL ADMINISTRATION DEPARTMENT order?",
          "Explain Instructions regarding the Business of the Government issued under rule 15of the Gujarat Government.Rules of Business, 1990.Confidential GENERAL ADMINISTRATION DEPARTMENT order"
        ],
        "responses": [
          "Sachivalaya, Gndhinagar, 1 st November, 1996.\n The following Instructions have been issued by the Governor ofGujarat under rule 15 of the Gujarat Government Rules of Business, 1990.\n GENERAL ADMINISTRATION DEPARTMENT \n Sachivalaya, Gandhinagar, 1st November, 1996.\n In exercise of the powers conferred on him by rule 15 of the Gujarat Government Rules of Business, 1990 and in supersession of the instructions in force immediately before the coming into force of these instructions."
        ]
      },
      {
        "tag": "Instructions regarding the Business of the Government issued under rule 15of the Gujarat Government.Rules of Business, 1990.PART 1 DEFINITIONS.",
        "patterns": [
          "What is Instructions regarding the Business of the Government issued under rule 15of the Gujarat Government.Rules of Business, 1990.PART 1 DEFINITIONS?",
          "Explain Instructions regarding the Business of the Government issued under rule 15of the Gujarat Government.Rules of Business, 1990.PART 1 DEFINITIONS."
        ],
        "responses": [
          "1. In these Instructions, unless the context otherwise requires: \n (i) 'Cabinet' means the Cabinet as provided in Instruction 2;\n (ii) 'Case' includes the papers under consideration and all previous papers and notes put up in connection therewith to enable the question raised to be disposed of;\n (iii) 'Rules' means the Gujarat Government Rules of Business,1990; \n (iv) 'Schedule' means a Schedule appended to the Rules;\n (v) 'Minister' in relation to the Cabinet shall have the same meaning as is assigned to in clause (c) of rule 2 of the Rules and; in relation to the Council of Ministers; shall include the Ministers of State and the Deputy Ministers.\n (vi) 'Secretary' means a Secretary to the Government of Gujarat and includes an Additional Chief Secretary a Principal Secretary an Additional Secretary a Special Secretary; a Joint Secretary; a Deputy Secretary an Under Secretary and an Assistant Secretary.\n (vii) Words and expressions used in these Instructions but not defined therein; and defined in the Rules shall have the meaning assigned to them in the Rules.\n 2. A matter shall be deemed to be brought before the Cabinet if under a direction of the Chief Minister under clause (2) of rule 9 of the Rules; it is to be brought before all Ministers excluding the Minister of State and the Deputy Ministers;and in these Instructions the expression 'Cabinet'shall be construed accordingly.\n 3. (i) A case shall be deemed to belong to a Department to which under the Schedule to the Rules .the subject matter there of pertains or is mainly related.\n (ii) If any question arises regarding the Department to which a case belongs the decision of the Minister charge of the Departments concerned if all such Departments are in charge of the same Minister shall be final. If such Departments are under different Minister who;after discussion; are unable to agree as to the Department to which the case belongs. The Chief Minister shall decide the question."
        ]
      },
      {
        "tag": "Instructions regarding the Business of the Government issued under rule 15of the Gujarat Government.Rules of Business, 1990.PART II GENERAL",
        "patterns": [
          "What is Instructions regarding the Business of the Government issued under rule 15of the Gujarat Government.Rules of Business, 1990.PART II GENERAL?",
          "Explain Instructions regarding the Business of the Government issued under rule 15of the Gujarat Government.Rules of Business, 1990.PART II GENERAL."
       ],
        "responses": [
          "4. (1) (a) Except as otherwise provided in these Instructions cases shall ordinarily be disposed of by; or under the authority of;the Minister in charge; who may; by means of standing order; give such directions as he thinks fit for the disposal of cases in the Department. \n (b) Copies of the direction issued by the Minister in charge under clause (a) shall be sent to the Chief Minister and the Governor. \n (2) Until standing orders are made this instruction; the standing orders in force immediately before the date of the coming into force of the subsequent order shall; so far as may be; continue to apply. \n5. Each Minister shall arrange with the Secretary of the Department what matters or classes of matters are to be brought to his personal notice. \n6. Except as otherwise provided in these Instructions cases shall be submitted by the Secretary in the Department to which the case belongs to the Minister in charge. \n7. The Minister in charge may ask to see the papers relating to any case; disposed of by or under the authority of the Secretary without reference to the Minister in charge and may take action which he considers necessary with reference to it in accordance with the Rules and these Instructions. \n8. (1) Subject to the Rules and the other provisions in these Instructions; the Minister in charge may dispose of all the cases arising in Departments which he controls. \n (2) When a difference of opinion arises between Departments which the same Minister controls; the Minister may decide. \n9. When the subject of a case concerns more than one Department no order shall be issued nor shall the case be laid before the Council or the Cabinet until it has been considered by all the Departments concerned unless the case is one of extreme urgency. \n10. If the Department concerned are not in agreement regarding a case dealt with under instruction 9; the Minister in charge of the Department may; if he wishes to proceed with the case direct that the case be submitted to the Chief Minister for orders for laying the case before the Council or the Cabinet. \n11. (1) The Chief Secretary may; on the orders of the Chief Minister or of any Minister or of his own motion; ask to see papers relating to any case in any  Department and any such request by him shall be complied with by the Secretary of the Department concerned. \n (2) The Chief Secretary may after examination of the case; submit it for the orders of the Minister in charge or of the Chief Minister through the Minister in charge. \n12. Any matter in which a difference of opinion arises or is likely to arise between any Department and the Gujarat Legislature Secretariat shall be brought to the notice of the Chief Minister through the Minister in charge. \n13. All communications received from the Government of India (including those from the Prime Minister and other Ministers of the Union); other than those of a routine or unimportant character shall; as soon as possible after receipt; be submitted by the Secretary to the Minister in charge and copies there of shall be forwarded immediately to the Governor and the Chief Minister for information. \n14. Any matter likely to bring the State Government into controversy with the Government of India or with any other State Government shall; as soon as the possibility of such a controversy is seen; be brought to the notice of the Governor and the Chief Minister and the Minister in charge. \n15. (1) The following classes of cases shall be submitted to the Chief Minister before the issue of orders; namely:  \n (i) Proposals for the grant of pardons; reprieves; respites; or remissions of punishment or for the suspension; remission or commutation of a sentence in pursuance of article 161 of the constitution of India; \n (ii) Cases raising questions of policy and cases of administrative importance not already covered by the Second Schedule to the Rules; \n (iii) Cases which affect or are likely to affect the peace and tranquility of the State; \n (iv) Cases which affect or are likely to affect the interest of the Schedule Castes and Scheduled Tribes; \n (v) Cases relating to the Gujarat Legislature Secretariat which in the opinion of the Department dealing with them are of sufficient importance; \n (vi) Cases which affect the relations of the State Government with the Government of India; any other State Government; the Supreme Court or the High Court; \n (vii) Constitution of an advisory Board under article 22(4) (a) of the Constitution for the detention of persons without trial; \n (viii) Proposals regarding the imposition of any punishment on All India Service Officers; Heads of Departments; Collectors; District Development Officers; District Superintendents of Police and all other Class I Officers drawing pay in the pay scale of Rs. 15 600;39 100 (PB 3) Grade pay Rs.7600 or above. \n (ix) (a) Proposals for the appointment; posting and confirmation of the following officers : \n 1. Secretaries;Special Secretaries; other Supertime Scale Indian Administrative Service Officers; Joint Secretaries and Chief Engineers of Departments of Government;\n 2 All India Services Officers (excluding those in the Junior time scale) ;\n3. Heads of the Departments;\n4. District Judges;\n5. Deputy Inspectors General of Police;\n6. Collectors;\n7. District Development Officers;\n8. Superintendents of Police; \n9. Superintending Engineers; \n10. All other Class I Officers drawing pay in the pay scale of Rs. 15 600 Grade pay Rs.7600 and above.\n Provided that the cases about substitute arrangements during the leave vacancies and vacancies for other reasons need not be submitted to the Chief Minister if the substitute appointments are made from the approved select list : \n Provided further that the cases about substitute; arrangements during the vacancies exceeding two months in duration should be shown to Chief Minister when the select lists have not been prepared or when the appointments are proposed to be made not in accordance with the approved select lists; \n (x) Proposals for the provision of representation to the Anglo Indian community (Article 333); \n (xi) Any communication from the Election Commission; especially; with references to its requirements as to staff and action proposed to be taken thereon; \n (xii) Any proposal for the institution of a prosecution by Government against the advice tendered by the Legal Department; \n (xiii) Any material departure from the Rules and these Instructions which comes to the notice of the Chief Secretary or the Secretary of any Department; \n (xiv) Proposed rules affecting the pay; allowances; or pension payable to or in respect of Officers of the All India Services; \n (xv) Cases pertaining to the Governor's personal establishment and matters pertaining to the residence of the Governor; \n (xvi) Proposals for the appointment of Chairman; Members and Secretary of the State Public Service Commission; \n (xvii) Cases relating to the application of the Acts of Parliament or the State Legislature to the Scheduled Areas and the making of regulations for the peace and good Government of those areas; \n (xviii) Cases relating to amendments to High Court Rules or Orders; \n (xix) Cases pertaining to resignation and appointment of High Court judges; \n (xx) Promulgation of statutory rules and amendments to such existing rules whether made by Government or by a subordinate authority; \n(2) The following classes of cases shall be submitted by the Chief Minister to the Governor before the issue of orders:  \n (I)   Proposals for the grant of pardons; reprieves; respited or remissions of punishments or for the suspension remission or commutation of sentence in pursuance of Article 161 of the Constitution of India; \n (ii)   Cases pertaining to the Governors personal establishment and matters pertaining to the residence of the Governor; \n (iii) Cases pertaining to promulgation and withdrawal of Ordinance; \n (iv)   Cases relating to recommendation or sanctions introducing particular types of legislation; \n (v) Cases pertaining to the summoning or proroguing of the Legislature; \n (vi) Cases relating to amendments to High Court Rules or Orders; \n (vii) Cases pertaining to resignation and appointment of High Court Judge:; \n (viii) Cases pertaining to the appointment or resignation of Chairman; Members and Secretary of the State Public Service Commission; \n (ix) Any departure from the Rules and these Instructions which comes to the; notice of the Chief Secretary or the Secretary of any Department; \n (x) Cases relating to non application or application with modification of Acts of Parliament or of the State Legislature to the Scheduled Area and the 'making of regulations for the peace and good Government of such areas ; \n (xi)   Cases pertaining to appointments resignation and removal of the Advocate General; \n (xii) Cases pertaining to the Governor's address and massages to the Legislative Assembly; \n (xiii)   Cases pertaining to disqualifications of Members of Legislative Assembly; \n (xiv) Cases of obtaining recommendations of the Governor for presentation to the Legislative Assembly of Annual Financial Statement and Statements relating to supplementary; additional or excess grants and appropriation bills; \n (xv) Such other cases of administrative importance as the Chief Minister might consider necessary;\n(3) The Chief Minister shall keep the Governor informed at the earliest opportunity of the following classes of cases: \n (i) Cases which in the opinion of the Chief Minister involve questions of major policy;\n (ii) Cases which affect or are likely to affect the peace and tranquility of the state; \n (iii) Cases which affect or are likely to affect the interest of Scheduled Castes and Scheduled Tribes; and \n (iv) Cases which affect the relations of State Government with the Government of India any other State Government; the Supreme Court or the High Court. \n(4) (I) Cases pertaining to proposals for giving guarantee by Government   of the State exceeding rupees Five (5) crores and cases regarding   proposals for giving guarantee on behalf of private Institutions and   individuals shall be submitted for approval to the Minister for   Finance through the Secretary Finance Department; Chief   Secretary and the Minister concerned. \n (ii) Cases pertaining to proposals for giving guarantee by the Government of the State up to rupees Five (5) crores shall be submitted for approval to the Chief Secretary through the Secretary. Finance Department and the decision taken thereon shall be communicated to the Minister for Finance for information.\n (5) Not with standing anything contained in the Rules or anywhere in these Instruction; it shall be competent for the Chief Minister to pass orders in any case involving a question of policy or a matter of urgent public importance; relating to any department when he considers it necessary or expedient so to do; or when the case is referred to him by the Minister in charge of the department.\n16. Where in any case the Governor considers that any further action should be taken or that action should be taken otherwise than accordance with the orders passed by the Minister in charge; the Governor may require the case to be laid before the Council of Minister for consideration where upon the case shall be so laid: Provided that the notes; minutes or comment's of the Governor in any such case shall not be brought on the Secretariat record unless if Governor so directs.\n17. The Chief Minister Shall:\n (a) Cause to be furnished to the Governor such information relating to the Administration of the affairs of the State and proposals for legislation as the Governor may call for; and \n (b) if the Governor    so requires; submit for the consideration of the Council or the Cabinet any matter on which a decision has been taken by a Minister but which; has not been considered by the Council or the Cabinet."

        ]
      },
      {
        "tag": "Instructions regarding the Business of the Government issued under rule 15of the Gujarat Government.Rules of Business, 1990.PART III PROCEDURE OF THE COUNCIL OF MINISTERS AND OF THE CABINET",
        "patterns": [
          "What is Instructions regarding the Business of the Government issued under rule 15of the Gujarat Government.Rules of Business, 1990.PART III PROCEDURE OF THE COUNCIL OF MINISTERS AND OF THE CABINET?",
          "Explain Instructions regarding the Business of the Government issued under rule 15of the Gujarat Government.Rules of Business, 1990.PART III PROCEDURE OF THE COUNCIL OF MINISTERS AND OF THE CABINET."
        ],
        "responses": [
          "18. The Chief Secretary or such other officers as the Chief Minister may appoint shall be the Secretary to the Council and to the Cabinet. \n19. The Secretary to the Council or the Cabinet shall attend every meeting of the Council or the Cabinet; unless the Chief Minister excuses his attendance from any meeting. The duty of the Secretary to the Council or the Cabinet shall be: \n (i) to communicate a list of business for the date; time and place of every meeting to the Governor and to each Minister and to each Secretary of the Department concerned; at least three days before the date for the meeting unless in any case the Chief Minister otherewise directs; \n (ii) To record the minute of the proceedings of the Council or the Cabinet; \n (iii) To keep the records of the proceedings of the Council or the Cabinet; \n (iv) To inform the Chief Minister of the State of the pending business of the Council or the Cabinet and to obtain orders about the time and place of meeting of the Council or the Cabinet and the business to be taken up; \n (v) To see that the Governor and the Ministers are provided with copies or relevant papers; before hand; \n (vi) To see that the Secretaries; whose presence may be required in the Council meeting or the Cabinet meeting are in attendance; \n (vii) To send to the Governor and Ministers as soon as possible after the end of each meeting copies of the proceedings. \n20. All cases referred to in the Second Schedule shall be submitted to the Chief Minister; after consideration by the Minister in charge for obtaining a direction of the Chief Minister under rule9. \n21. (1) The Chief Minister may direct that any case referred to in the Second Schedule may; instead of being brought up for discussion at a meeting of the Council; be circulated to the Ministers for opinion and if all the Ministers are unanimous and the Chief Minister thinks that a discussion at   a meeting of the Council is unnecessary; the case shall be decided without   such discussion. If the Misters are not unanimous or if the Chief Minister   thinks that a discussion at a meeting is necessary; the cases shall be   discussed at a meeting of the Council;\n   Provided that where any case is so circulated and it is found that it could not be circulated to some particular Minister owing to his absence from the headquarters at the time the case was so circulated; the Chief Minister may direct; if in his opinion the case is of an urgent nature; that such Minister shall be excluded for the purpose of determining whether all Ministers are a unanimous or not. \n (2) If it is decided to circulate any case to the Ministers; a memorandum giving a gist of papers relating to such case which is circulated among the Ministers shall simultaneously be sent to the Governor. \n (3) When a case is circulated; the order of circulation shall be as follows: \n (I) to the Minister (other than the Minister in charge) in order of juniority; \n (2) To the Minister in charge; \n (3) To the Chief Minister. \n22. (1) In case which are circulated for opinion under instruction 21; the Chief   Minister may direct; if the matter be urgent that if any Minister fails to communicate his opinion to the Secretary to the Council by a date which he has specified in the memorandum for circulation it shall assumed that he has accepted the recommendations contained therein. \n (2) If the Ministers have accepted the recommendations contained in the memorandum for circulation or the date by which they were required lo communicate their opinion has expired the Secretary to the Council :shall submit the case to the Chief Minister. If the Chief Minister accepts the recommendations and if he has no observations to make; he shall return the case to the Secretary to the Council who will pass it on the Secretary concerned who will thereafter take steps to issue necessary orders. \n23. In relation to matters referred to in instruction 2 which are to be brought before the Cabinet; the provision of instructions 21 and 22 shall apply; as they apply in relation to matters to be brought before or considered by the Council. \n24. When it has been decided to bring a case before the Council or; as the case may be. Cabinet; the Department to which the case belongs shall; unless the Chief Minister otherwise directs; prepare a memorandum indicating with sufficient precision the salient fact of the case and the points for decision. Such memorandum and such other papers as are necessary to enable the case to be disposed of shall be circulated to the Ministers Copies of the memorandum and other papers shall at the same time be sent to the Governor. \n25. In cases which concern more Minister than one; the Ministers shall attempt by previous discussion to arrive at an agreement. If an agreement is reached; the memorandum referred to in instruction 22 or 24 shall contain the joint recommendations of the Ministers; and if no agreement is reached; the memorandum shall state the points of difference and the recommendations of each of the Ministers concerned.\n26. (I) The Council or; as the case may be; the Cabinet shall meet at such place and time as the Chief Minister may direct. \n (2)   After an agenda paper showing the cases to be discussed at a meeting of the Council or of Cabinet has been approved by the Chief Minister; copies thereof; together with copies of such memorandum as have not been circulated under instruction 24; shall be sent by the Secretary to the Council or; as the case may be; to the Cabinet; to the Chief Minister and other Ministers so as to reach them two clear days before the date of such meeting. The Chief Minister may; in the case of emergency curtail the said period of two days. Copies of the agenda and the memoranda shall; at the same time; be sent to the Governor. \n (3) Except with the permission of the Chief Minister; no case shall be placed on the agenda of a meeting unless papers relating thereto have been circulated as required by instruction 24  \n (4) If any Minister is on tour; the agenda paper shall be forwarded to the Secretary in the Department named by him for the purpose who; if he considers that the discussion of any case should await the return of the Minister; may request the Secretary to the Council or. to the Cabinet to take orders of the Chief Minister for postponement of the discussion of the case until the return of the Minister. \n (5) The Chief Minister or; in the absence of the Chief Minister; the Deputy Chief Minister; and in the absence of the Chief Minister and the Deputy Chief Minister; any other Minister nominated by the Chief Minister; shall preside at a meeting of the Council or the Cabinet.\n (6) The Secretary of a Department concerned with the case shall attend the meeting unless his presence is excused by the Chief Minister. \n (7) The Secretary to the Council or to the Cabinet shall attend all meeting of the Council or; as the case may be; of the Cabinet and shall prepare record of the decisions. He shall forward a copy of such record to each of the Ministers including the Chief Minister and to the Governor. \n27. (1) When a case is brought before a meeting of the Council or of the Cabinet; the Presiding Authority will call upon the Minister in charge  to make such   observations as he thinks fit on the point or point submitted for  discussion. Other Ministers may then speak. Secretaries; except when asked for their opinion; will take no part  in the discussions. \n (2) When a; decision upon the point or points under discussion has been reached; the Secretary in the Department concerned (or in his absence the Secretary to the Council or the Cabinet) shall take down in writing and read out the order proposed to be passed on the cast and such; order shall after its terms have been finally approved by the Council or as the case may be; by the cabinet and initiated by the Chief Minister or the Presiding Minister; be recorded by the Secretary to the Council or to the Cabinet in the Minutes of the proceedings of the Council or the Cabinet. A copy of the order so approved and initial shall be kept with the notes of the case.\n (3) Relevant extracts from the decisions of Government reached at a  meeting of the Council or the Cabinet shall be supplied by the Secretary of the Council or to the Cabinet to the Secretaries of the Departments concerned. \n28. When any matter has been discussed in the Council or in the Cabinet; any Minister who has taken part in the discussion may record a minute on the subject which shall form part of the record of the proceedings. \n29. (1) When a case has been decided by the Council or by the Cabinet after discussion at meeting the Minister concerned shall take action to give effect to the decision. If however, any deviation is proposed to the made   from that decision the case shall be submitted to the Chief Minister by the minister concerned and further action on it will be taken according to any directions of the Chief Minister. The Secretary in the Department concerned will in each such case cause to be supplied to the Secretary to   the Council or to the Cabinet such documents as the latter may require to enable him to maintain his record of the case. \n (2) The decision of the Council or of the Cabinet relating case may be separately recorded and after approval by the Chief Minister or any other Minister presiding shall be placed with the record the case. An advance copy of the draft of the decisions and approved draft shall be sent to the Governor. \n30. The discussions and recorded proceeding of the Council or of the Cabinet shall be secret. Save as provided in instructions 19 and 27 no proceedings of the Council or of the Cabinet or extracts therefrom; or information relating there to shall be supplied or disclosed to any person. \n31. Where any case (including a draft Bill) is brought not before the Council or Cabinet but before such Minister as directed by the Chief Minister under clause (2) of rule 9 of the Rules, the procedure to be followed for the disposalthere of shall be such as the Chief Minister may by means of standing orders direct."
        ]
      },
      {
        "tag": "Instructions regarding the Business of the Government issued under rule 15of the Gujarat Government.Rules of Business, 1990.PART TV PROPOSALS FOR LEGISLATION",
        "patterns": [
          "What is Instructions regarding the Business of the Government issued under rule 15of the Gujarat Government.Rules of Business, 1990.PART TV PROPOSALS FOR LEGISLATION?",
          "Explain Instructions regarding the Business of the Government issued under rule 15of the Gujarat Government.Rules of Business, 1990.PART TV PROPOSALS FOR LEGISLATION."
          
        ],
        "responses": [
          "\n32. Except as otherwise provided by instruction 35, the Legislative and  Parliamentary Affairs Department is not in respect of legislation; an originating or initiating Department and its proper function is to put into technical shape the projects of legislation of which the policy has been; approved and every proposal to intimate legislation shall be considered in; and if necessary. Transferred to the Department to which the subject matter of the legislation relates and the necessity for legislation and all matters of substance to be embodied in the Bill shall be discussed and; subject to the provision of rule 9 of the Rules; settled in such Department.\n33. Proposal to initiate legislation shall be treated as a case and shall be disposed of accordingly:\n Provided that the case shall not be submitted to the Chief Minister until the Department concerned has consulted the Legislative and Parliamentary Affairs Department as to \n (i) The expediency of the proposed legislation from a legal point of view;\n (ii) The competence of the State Legislature. to enact the measure proposed. \n (iii) The requirements of the Constitution as to obtaining the previous sanction of the President thereto; and \n (iv) The consistency of the proposed measure with the provisions of the Constitution and in particular those relating to the fundamental right. \n34. (1) If Legislation is decided upon by the Minister in charge. The Department will; if it involves expenditure from the Consolidated Fund of the State; prepare in consultation with the Finance Department; a Financial Statement. The papers shall then be sent to the Legislative and Parliamentary Affairs Department for the preparation of a draft Bill. \n (2) The Legislative and Parliamentary Affairs Department shall then prepare a tentative draft Bill and after such draft. Bill is approved by  the Minister for Low; shall send it to the Originating Department indicating at the same time the sanction; recommendation or  administrative approval if any; required for the Bill and requesting the  Originating Department to prepare the Statements of Objects and Reasons; the Memorandum of Delegated Legislation; if any; and the  Financial Memorandum; if any; to show the same to the Legislative and Parliamentary Affairs Department before the tentative draft Bill is submitted to the Council of Ministers. \n (3) The Originating Department shall obtain the opinions of such officers and. bodies as it deems necessary and the opinions received with a copy of the tentative draft Bill shall then be submitted to the Minister  in charge. \n (4) If the tentative draft Bill is not approved either by the Originating Department or the Minister incharge and alterations are suggested to be made in the draft Bill by the Department or the Minister; such alterations shall be carried out by the Originating Department in consultation with the Legislative and Parliamentary Affairs Department and there after the tentative draft Bill shall again be submitted to; the Minister in charge.\n (5) If the tentative draft Bill is approved by the Minister in charge; the  Department shall submit the draft together with the Financial Memorandum and also the Statement of Objects and Reasons and the Memorandum of Delegated Legislation; if any to the Chief Secretary with its suggestions for obtaining the directions of the Chief Minister under rule 9 of the Rules as to the submission of the Bill for the Approval of the Council or such Ministers as the Chief Minister may direct. A copy of such Bill shall be submitted by the Chief Secretary to the Governor. In the case of every Bill for which a Financial Memorandum has been prepared; the Department shall send a copy of such Bill with the Financial Memorandum and the Statement of Objects and Reasons to the Finance Department simultaneously when  the draft Bill is sent to the Chief Secretary. \n (6) If the Bill as so approved requires the administrative approval of the Government of India; the Originating Department; shall; without any  delay; take steps to obtain such approval and if the Bill as so approved requires the previous sanction of the President or the recommendation of the Governor; the Legislative and Parliamentary Affairs Department shall; without any delay; take steps to obtain such sanction or recommendation. The sanction of the President shall be obtained by the Legislative and Parliamentary Affairs Department  through the Secretary to the Governor.  \n (7) After the Bill is so approved and the Administrative approval of the Government of India is obtained by the Originating Department; where necessary; the draft together with the Statement of Objects and Reasons and the Memorandum if any; Delegated Legislation and the Financial Memorandum; if any; shall without any delay; be sent by the Originating Department to the Legislative and Parliamentary Affairs Department for further necessary action; such as obtaining of the previous sanction of the President or; as the case may be; recommendation of the Governor; When the draft Bill is ready for being processed by the Gujarat Legislative Assembly; the Legislative and Parliamentary Affairs Department shall taken steps either for its publication in the Official Gazette with the consent of the Speaker under the proviso to rule 127 A of the Gujarat Legislative Assembly Rules or; as the case may be for its introduction in the Gujarat Legislative Assembly. \n (8) The Originating Department shall take all necessary action so that every Bill to be taken up in the next session of the Legislature is approved by the Council of Ministers or the Cabinet; as the case may be; at least 10 days before the date of the commencement of such session. In exceptional circumstances this time limit may be waived after obtaining the orders of the Chief Minister. \n (9) If any Provision; in the tentative Bill are so modified by the Originating Department as to involve expenditure from the Consolidated Fund of the States the Originating Department shall prepare or revise as the case may be; in consultation with the Finance Department the Financial Memorandum. The procedure described in Paragraph (4) shall then apply to such Bill. \n35. (1) Measures designed solely to codify and consolidate existing enactments and legislation of a formal character such as repealing and amending Bill may be initiated in the Legislative and Parliamentary Affairs Department; Provided that the Legislative and Parliamentary Affairs Department shall send a copy of the draft Bill together with the Statement of Objects and Reasons to the Department which is concerned with the subject matter for consideration as an administrative measure and shall also; if the Bill deals with an Act of Parliament send a copy of the Central Government. \n (2) The Department to which a copy of the Bill is sent shall forthwith make such enquiries as it thinks fit and shall send to the Legislative and Parliamentary Affairs Department its opinion thereon together with a copy of every communication received by it on the subject. \n (3) There upon the Legislative and Parliamentary Affairs Departments shall submit the Bill to the Council of Ministers or the Cabinet for orders and if the Council or the Cabinet so direct; take steps for its introduction in the Legislative Assembly. \n36. A copy of every Bill introduced in the State Legislature shall immediately after its introduction be forwarded; to the Governor as well as to the Central Government for information. \n37. (1) Whenever a non official Member of the State Legislature gives notice of his intention to move for leave to introduce a Bill; and the Secretary to the  Legislature forwards a copy of the Bill to the Legislative and Parliamentary  Affairs Department; the Legislative and Parliamentary Affairs Department   shall forthwith send a copy of the Bill and the Statement of objects and Reasons for information to the Chief Minister and to the Department to which the case belongs. \n (2) The Bill shall be dealt with as a case by the Legislative and Parliamentary Affairs Department in the first instance; where it shall be considered in its technical aspects; such as need for previous sanction .of the President and the competence of the State Legislature to enact the measure and then forwarded with its opinion to the Department to which the case belongs. \n (3) Every such Bill a copy of which is received by any Department shall be Circulated after examination by that Department to the Minister and to the Governor and dealt with; if necessary; under the Instructions providing for cases after effecting more than one Department. \n (4) If any provisions of such Bill involve expenditure from the Consolidated Fund of the State; the Department shall; before it is circulated; prepare in consultation with the Finance Department; the Financial Statement in respect of the Bill. \n38. Every Bill of the nature referred to in article 199 of the Constitution shall \n (a) If the Bill does not relate to a subject dealt with in the Finance Department; be sent to the Secretary of the Department for his remarks and shall be dealt with in the Department dealing with the said subject. Such Bill shall there after be submitted to the Finance Minister and the Governor. \n (b) If the Bill relates to a subject dealt with the Finance Department; be submitted to the Finance Minister and the Governor. \n39. The provisions of instruction 37 shall apply as far as may be to amendments of substance recommended by the Select Committee and also to all amendments notice of which is given by member of the State Legislature for being moved during the consideration of a Bill in the Legislature: \n40. (1) When a Bill has been passed by the Legislature it shall be examined on receipt of the authentic copy thereof from the Secretary to the legislature In the Legislative Parliamentary Affairs Department and the Department concerned and shall be forwarded to the Governor with a report of the   Secretary to Government; Legislative and Parliamentary Affairs  Department to the reasons; if any why the Governor's assent should not be given to the Bill or the Bill should not be reserved for the consideration of the President. \n (2) Where the Governor directs that the Bill should be reserved for the consideration of the President or returned to the Legislature with a message; necessary action in that behalf shall be taken by the Secretary to the; Governor in consultation with the Secretary of the Administrative Department concerned and the Secretary to  Government; Legislative and Parliamentary Affairs Department.  \n (3) After obtaining the assent of the Governor or the President; as the  case may be the legislative and parliamentary Affairs Department shall take steps for the publication of the Bill in the Official Gazette as an act of the Legislature. \n41. The provisions of instructions 32; 33 and 34 shall; so far as may be apply in respect of ordinance promulgated by the Governor under clause (1) of Article 213 of the Constitutions of India; subject to the following: \n (a) After the ordinance has been approved by the Council of Ministers or the Cabinet; the originating or initiating Department Shall forth with submit the ordinance through the Chief Minister to the Governor for his signature;\n Provided that where under the proviso to clause (1) of the said Article 213 previous instructions of the President are necessary for the promulgating of the Ordinance the Department concerned shall obtain the same through the Secretary to Governor and then submit the Ordinance; to the Governor as aforesaid. \n (b) On receipt of the copy of Ordinance signed by the Governor the Department shall forward the same to the Legislative and Parliamentary Affairs Department for publication. \n (c) After the publication of the Ordinance; the Legislative and Parliamentary Affairs Department shall forward a copy of the same to the Governor and two copies there of to the Secretary Gujarat Legislative Secretariat; for being laid before the Legislature as required under clause (2) of Article 213 of the Constitution. \n42. Whenever it is proposed in any Department other than the Legislative and Parliamentary Affairs Department. \n (i) To issue a statutory rule; notification or order or \n (ii) To sanction under a statutory power the issue of any rule by law notification or order by a subordinate authority; or \n (iii) To submit to the Central Government any draft statutory rule notification or order for issue by them. The draft may be referred to the Legislative and Parliamentary Affairs Department for opinion and for revision where necessary. \n43. (1) All Administrative Department shall consult the Legislative &  Parliamentary Affairs Department/Legal Department  \n (a) The construction of Statutes Acts Regulations and statutory rules; orders and notifications; \n (b) Any general legal principles arising out of any case; and \n (c) The institution or withdrawal of any prosecution at the instance of any administrative Department. Except in case which are simple and clear and where no point of law is involved. \n (2) Every such reference shall be accompanied by an accurate statement of the facts of the case and the exact point or points on which the advice of the Legal Department is desired."
        ]
      },
      {
        "tag": "Instructions regarding the Business of the Government issued under rule 15of the Gujarat Government.Rules of Business, 1990.PART V THE FINANCE DEPARTMENT",
        "patterns": [
          "What is Instructions regarding the Business of the Government issued under rule 15of the Gujarat Government.Rules of Business, 1990.PART V THE FINANCE DEPARTMENT?",
          "Explain Instructions regarding the Business of the Government issued under rule 15of the Gujarat Government.Rules of Business, 1990.PART V THE FINANCE DEPARTMENT."
        ],
        "responses": [
          "44. The Finance Department shall perform the following functions, namely:  \n (a) It shall be in charge of the accounts relating to loans granted by the  Government and shall advise on all transactions relating to such loans; \n (b) It shall be responsible for the safety and employment of all fund belonging to; vesting in or under the management of the State Government; \n (c) It shall examine and report on all proposals for the increase;  continuance  or reduction of taxation; \n (d) it shall examine and report on all proposals for borrowing by the Government; shall take all steps necessary for the purpose of raising such loans as have been duly authorised and shall be in charge of all matters relating to the service of loans; \n (e) it shall be responsible for all matters relating to financial procedure and application of the principle of sound finance;  \n (f) it shall be responsible for seeing that proper financial rules are framed for the guidance; of other Departments and that suitable accounts  including commercial accounts; where necessary; are maintained by other Department and establishments subordinate to them; \n (g) it shall be responsible for all matters relating to budget procedure and to the form and content of the annual financial statement and it shall be responsible during the year for the provision of ways and means and for watching the state of the Government balances;  \n (h) In connection with the budget and with supplementary estimates: \n (i) It shall prepare the annual statement of estimated receipts and expenditure for presentation to the Legislature and any supplementary estimates of expenditure which it may be necessary to present in the course of the year; it shall also prepare the appropriation bills and Bills relating to the Consolidated and Contingency Funds of the State; \n (ii) for the purpose of such preparation; it shall obtain from the Departments concerned material on which to base it estimates; and it shall be responsible for the correctness of the estimates; framed on the material so supplied; \n (iii) it shall examine and advise on all schemes of new expenditure for which it is proposed to make provision in the estimates and shall decline to provide in the estimates for any scheme which has not been so examined; \n (i) On receipt of a report from an audit officer to the effect that expenditure for which there is no sufficient sanction is being incurred; it shall require steps to be taken to obtain sanction or that the expenditure shall immediately cease ; \n (j) It shall lay the audit report relating to the State accounts before the committee on Public Accounts. \n (k) It shall decide to what extent in particular Departments the audit of expenditure should be reinforced by an audit of receipts; \n (L) It shall advice Departments responsible for the collection of revenue regarding methods of collection employed. \n45. (1) after grants have been voted by the Legislative Assembly \n (a) the Finance Department shall have power to sanction any re appropriation with in a grant from one major; minor or sub ordinate head; to another; \n (b) if any re appropriation within a grant between a head sub  ordinate to a minor head is sanctioned by any Department in pursuance of any delegation made by the Finance Department a copy of every order sanctioning the re appropriation shall be communicated to the Finance Department as soon as it is passed.  \n (2) The Finance Department shall have power:  \n (a) to delegate; subject to any conditions which it may specify in this behalf the power of re appropriation conferred; by clause  \n (a) of paragraph (1) ; and \n (b) to sanction the delegation by administrative Department to; any officer or class of officers of the power of re appropriation conferred on such administrative Department by clause (b) of the said paragraph. \n (3) Copies of orders sanctioning any re appropriation which does not require the sanction of the Finance Department shall be communicated to that Department as soon as such orders are passed. \n46. Every report .made by the Finance Department on any matter on which it is; by statute or rule; required to advice or report; shall be forwarded to the Department concerned. \n47. The Finance Department shall be consulted before the issue of orders upon all proposals which affect the finances of the State and in particular \n (a) Proposals to add; any post or abolish any post from the public service or to vary the emoluments of any post; \n (b) Proposals to sanction an allowance or special or personal pay for any post or class of posts or to any servant of the Government of the State; \n (c) Proposals involving abandonment of revenue or involving any expenditure for which. No provision has been made in the Appropriation Act. \n48. The views of the Finance Department shall be brought to the permanent record of the Department to which the case belongs and shall form part of the case. \n49. The Finance Department may; by general or special order; prescribe cases in which its assent may be presumed to have been given. \n50. (1) The Finance Minister may call for any papers in a case in which any of the matter referred to in the rule 11 of the Rules or instruction 48 is involved and the Department to whom the request is addressed shall supply the papers. \n (2) On receipt of papers called for under paragraph (1) the Finance Minister may request that the papers with his note on them shall be submitted to the Council. \n (3) The Finance Department may make rules to govern financial procedure in general in all Departments and to regulate the buisness of the Finance Department and the dealing of other Department the Finance Department."
        ]
      },
      {
        "tag": "Instructions regarding the Business of the Government issued under rule 15of the Gujarat Government.Rules of Business, 1990.PART VI MISCELLANEOUS",
        "patterns": [
          "What is Instructions regarding the Business of the Government issued under rule 15of the Gujarat Government.Rules of Business, 1990.PART VI MISCELLANEOUS?",
          "Explain Instructions regarding the Business of the Government issued under rule 15of the Gujarat Government.Rules of Business, 1990.PART VI MISCELLANEOUS."
        ],
        "responses": [
          "51. Whenever it may be found necessary; to make communication to high officers of Government; such as Collectors; Heads of Departments; conveying or implying the dissatisfaction of Government in any degree; or indicating how they might more satisfactorily discharge the duties of their office; such communicator shall be made in the form of confidential letters or memoranda to be signed by the Chief Secretary and not in the form of Government Resolutions and the draft of such communication shall be submitted to the Minister in charge and the Chief Minister for approval. \n52. The Secretary to the Department concerned is in each case responsible for the careful observance of these Instructions and when he considers that there has been any material departure from them he shall personally brings the matter to the notice of the Minister in charge of the Department and the Chief Secretary. \n53. (1) where a question asked by a member of the Legislative Assembly concerns Departments which are in charge of different Ministers it shall be answered by the Minister in charge of the Department to which the question is sent by the Secretary to the Legislature. \n (2) Such Minister shall; before answering such question; consult Minister in charge of the other Departments concerned as to the reply to be given to those parts of the question which concern such Departments. \n54. No function of a Secretary falling under rules 10(2) and 14 of the Rules and instruction 52 shall be discharged by Special; Joint; Deputy; under or Assistant Secretary. \n55. In addition to the cases and copies of the proceedings which are required to be sent to the Governor; each Department of the Secretariat shall also forward to the Governor for his information copies of the following :  \n (i) Important letters and telegrams addressed to the Government of India; important letters and telegrams from and to the State Government; the High Court and the Gujarat Public Service Commission. \n (ii) All orders embodying important principals or changes of policy in the administration of the State. \n56. If any doubt arises as to the interpretation of these Instructions it shall be referred to the Chief Minister whose decision shall be final. \n57. If any provision in these Instructions is repugnant to vail and the provision in the Instructions shall; to the extent of repugnancy be void. "
        ]
      }
    ]
    }